[{"confidence": 0.87, "end": 12.649, "track": 0, "text": "Are welcome to 2018 folks I'm your host for this big date of your podcast and Thomas along with their beers along for this fun ride.", "newpara": true, "start": 0.006, "speaker": "Cory"}, {"confidence": 0.93, "end": 19.547, "track": 0, "text": "And it's everybody is probably aware machine learning is easily one of the hottest topics topics in Analytics.", "start": 12.511, "speaker": "Cory"}, {"confidence": 0.95, "end": 26.037, "track": 0, "text": "And big data for not only the back half of 2017 definitely the hottest thing happened in 2018.", "start": 19.71, "speaker": "Cory"}, {"confidence": 0.92, "end": 33.633, "track": 0, "text": "And I'm sure it's going to stick around for a while and a handful of a sewer students of this big data space in the.", "start": 26.17, "speaker": "Cory"}, {"confidence": 0.94, "end": 41.955, "track": 0, "text": "The environment where our fans of machine learning think it's a cool Trend and think it's going to have a lot of power we've started poking around and look at it companies.", "start": 33.741, "speaker": "Cory"}, {"confidence": 0.91, "end": 51.708, "track": 0, "text": "Do an interesting work to accelerate machine learning in the Enterprise and we wandered into these these folks are did a robot and we thought.", "start": 42.16, "speaker": "Cory"}, {"confidence": 0.96, "end": 65.757, "track": 0, "text": "It sucks you're doing some pretty interesting work simplifying how organizations and frankly aspiring data scientist can leverage machine learning in real life and such a real life unicorn.", "start": 51.612, "speaker": "Cory"}, {"confidence": 0.93, "end": 79.061, "track": 0, "text": "West Side at least it is pictures of very robust Big Data mustache his name is dr. Greg Michaelson he's the VP at datarobot leading their work for banking customers and the big date of robot Labs teams.", "start": 66.196, "speaker": "Cory"}, {"confidence": 0.86, "end": 80.924, "track": 0, "text": "Greg welcome to the show sir.", "start": 79.182, "speaker": "Cory"}, {"confidence": 0.92, "end": 91.482, "track": 1, "text": "Hey thanks for having me although I'm I'm sad to report that my mustache did not survive the Christmas holidays that's what the New Year's resolution.", "newpara": true, "start": 80.636, "speaker": "Greg"}, {"confidence": 0.91, "end": 99.774, "track": 0, "text": "I have to assume I have to assume by casually you mean that it got taken off as you were trying to eat a turkey leg and it got pulled off that's the only acceptable answer.", "newpara": true, "start": 91.182, "speaker": "Cory"}, {"confidence": 0.96, "end": 109.161, "track": 1, "text": "Shaved off every mustache has a lifespan and you know you wake up one day and that's all she wrote for the mustache.", "newpara": true, "start": 96.043, "speaker": "Greg"}, {"confidence": 0.93, "end": 122.519, "track": 0, "text": "See now here's a play we're going to we're going to teach you this play for my playbook if you if you brand something like big did a beard as your thing then it's really hard for the wife or anyone to tell you you got to shave it off because.", "newpara": true, "start": 108.861, "speaker": "Cory"}, {"confidence": 0.93, "end": 125.884, "track": 0, "text": "I mean there's like stickers of their likeness on there.", "start": 122.621, "speaker": "Cory"}, {"confidence": 0.91, "end": 131.4, "track": 1, "text": "Yeah my wife wants told me that she wasn't going to kiss me until I shave my mustache.", "newpara": true, "start": 125.584, "speaker": "Greg"}, {"confidence": 0.92, "end": 144.434, "track": 0, "text": "Yeah well that's you know you got it you got to respect the ladies so Greg I obviously we were fans of date of robot we started doing some some trolling on you and and one thing I pulled out of your bio that I thought was interesting,", "newpara": true, "start": 131.587, "speaker": "Cory"}, {"confidence": 0.92, "end": 146.693, "track": 0, "text": "is Ura.", "start": 144.506, "speaker": "Cory"}, {"confidence": 0.94, "end": 158.183, "track": 0, "text": "At least you have some ties to the state of Alabama to get your PhD at the University of Alabama so you are you the phds from Alabama love college football and are excited about college football championships.", "start": 146.94, "speaker": "Cory"}, {"confidence": 0.93, "end": 171.138, "track": 1, "text": "Yeah man I went to LSU to so I did my undergrad at LSU so you know occasionally my undergrad will play my grad and we'll see which part of me is the best football team in the country.", "newpara": true, "start": 158.063, "speaker": "Greg"}, {"confidence": 0.92, "end": 184.965, "track": 0, "text": "And I swallow that where I think there's you know if if not by well I mean I'm trying to help her body wave perspective from a mass perspective work I'm seeing a lot of data science and Big Data people in the Southeast in Hart of Dixie practice in the stuff.", "newpara": true, "start": 171.271, "speaker": "Cory"}, {"confidence": 0.87, "end": 186.197, "track": 1, "text": "Amen brother.", "newpara": true, "start": 184.923, "speaker": "Greg"}, {"confidence": 0.91, "end": 189.964, "track": 0, "text": "Greg you live in Charlotte North Carolina now is that right.", "newpara": true, "start": 186.077, "speaker": "Cory"}, {"confidence": 0.94, "end": 190.878, "track": 1, "text": "I do.", "newpara": true, "start": 189.689, "speaker": "Greg"}, {"confidence": 0.91, "end": 197.344, "track": 0, "text": "Alright well let's let's talk a little bit about datarobot so things that we.", "newpara": true, "start": 191.011, "speaker": "Cory"}, {"confidence": 0.93, "end": 208.905, "track": 0, "text": "So we can have video disclaimer Kyle and I and one of our other big hit of your guys went to the date of the robot Essentials course a couple weeks back because we were just totally interested in how this thing works.", "start": 197.302, "speaker": "Cory"}, {"confidence": 0.91, "end": 218.754, "track": 0, "text": "And I think the terms of the the general statement that you guys used to describe the platform is the democratization of data science.", "start": 209.284, "speaker": "Cory"}, {"confidence": 0.91, "end": 225.839, "track": 0, "text": "Tell me what that means what is it really what is date of robot doing to make it make data science approachable.", "start": 218.796, "speaker": "Cory"}, {"confidence": 0.91, "end": 238.157, "track": 1, "text": "Yeah I think you actually read this morning an article from Glassdoor LinkedIn or so I can't recall where it was from but it's it mentioned that.", "newpara": true, "start": 225.857, "speaker": "Greg"}, {"confidence": 0.91, "end": 248.234, "track": 1, "text": "Data science salaries have topped like their they stopped going up even though they're still really high and yeah that made me think that.", "start": 238.278, "speaker": "Greg"}, {"confidence": 0.94, "end": 262.915, "track": 1, "text": "There's some some risky tell even though there is a ton of demand out there in the market for data scientists and for data science because companies are collecting a ton of data and they want to do obviously monetize that data and helping.", "start": 248.469, "speaker": "Greg"}, {"confidence": 0.91, "end": 269.993, "track": 1, "text": "Use it to help them make their businesses run cheaper and and be more efficient and so on,", "start": 262.999, "speaker": "Greg"}, {"confidence": 0.94, "end": 279.932, "track": 1, "text": "there's a couple of problems one is you can't hardly find these people right they all work at Google or Facebook or whatever their possible to hire and they change jobs every 9 months for,", "start": 269.783, "speaker": "Greg"}, {"confidence": 0.94, "end": 283.544, "track": 1, "text": "30% more money so they're super hard to get,", "start": 279.807, "speaker": "Greg"}, {"confidence": 0.91, "end": 291.145, "track": 1, "text": "the other is there there I mean most of them are Space Cadets right up and I speak from personal experience right these guys are,", "start": 283.4, "speaker": "Greg"}, {"confidence": 0.91, "end": 298.038, "track": 1, "text": "you know they like to solve problems they like to write computer code they're not Bankers right they're not Hospital administrators or not.", "start": 291.062, "speaker": "Greg"}, {"confidence": 0.94, "end": 307.772, "track": 1, "text": "Generally speaking business people until I think well I think I constantly worry that Executives out there,", "start": 298.266, "speaker": "Greg"}, {"confidence": 0.95, "end": 316.798, "track": 1, "text": "are going to get sick of this one day they're going to say you know what we invested in data scientists phds and we're just not getting any value.", "start": 307.749, "speaker": "Greg"}, {"confidence": 0.89, "end": 325.217, "track": 1, "text": "Right and so weird. Right I think AIG did something like this a few years ago they did kind of double down on setting up the science department.", "newpara": true, "start": 316.804, "speaker": "Greg"}, {"confidence": 0.7, "end": 328.335, "track": 1, "text": "And then you don't think there's later,", "start": 325.524, "speaker": "Greg"}, {"confidence": 0.92, "end": 341.483, "track": 1, "text": "they they just laid them all off right cuz they weren't getting any riy so that's that's kind of the place where data robot plays a bit in a we what we've done is we've automated the technical pieces,", "start": 328.174, "speaker": "Greg"}, {"confidence": 0.86, "end": 348.009, "track": 1, "text": "of the data science raw so training the models pre-processing the data,", "start": 341.484, "speaker": "Greg"}, {"confidence": 0.93, "end": 360.736, "track": 1, "text": "handling missing values tuning the different models picking out which algorithms to use partitioning your data all that kind of technical stuff that your PhD is normally have to do we automated,", "start": 348.003, "speaker": "Greg"}, {"confidence": 0.94, "end": 370.17, "track": 1, "text": "so that you can take business people who actually know the business problems and use them to solve the problems that there aren't really the experts in that's what we try to do.", "start": 360.671, "speaker": "Greg"}, {"confidence": 0.91, "end": 379.623, "track": 0, "text": "Okay so one thing I know it's that's perfect I think one of the things I think is interesting is what's I'm going to unpack this little bit because one of the things that is.", "newpara": true, "start": 369.895, "speaker": "Cory"}, {"confidence": 0.93, "end": 385.464, "track": 0, "text": "Is interesting to me is that we have a lot of data that's that's one thing.", "start": 380.032, "speaker": "Cory"}, {"confidence": 0.91, "end": 394.718, "track": 0, "text": "That just the process of once we have the dinner with cleansing we're done at the process of applying machine learning to a data set.", "start": 385.801, "speaker": "Cory"}, {"confidence": 0.93, "end": 403.25, "track": 0, "text": "It's pretty soft right there's a bunch of different libraries that you wouldn't use any there's a lotta there could be a lot of challenges in trying.", "start": 395.253, "speaker": "Cory"}, {"confidence": 0.94, "end": 412.468, "track": 0, "text": "To figure out which models are right like why do you like it how do you guys do that better like what I mean you clearly have some experience building models but.", "start": 403.491, "speaker": "Cory"}, {"confidence": 0.91, "end": 419.835, "track": 0, "text": "Really that model building selection thing why is there a robot unique there cuz I think your history and where you guys came from may have something to do with that.", "start": 412.649, "speaker": "Cory"}, {"confidence": 0.98, "end": 428.182, "track": 1, "text": "Yeah well so it turns out that the secret to building really good models is not,", "newpara": true, "start": 420.196, "speaker": "Greg"}, {"confidence": 0.94, "end": 430.339, "track": 1, "text": "being an expert in one type.", "start": 428.189, "speaker": "Greg"}, {"confidence": 0.92, "end": 440.17, "track": 1, "text": "Right so yeah maybe if you're playing in like the computer vision space or something like that I mean in that space kind of drone that works are the only show in town,", "start": 430.622, "speaker": "Greg"}, {"confidence": 0.8, "end": 445.837, "track": 1, "text": "but if you're building like a frog model or you know you're you're trying to,", "start": 440.08, "speaker": "Greg"}, {"confidence": 0.96, "end": 460.042, "track": 1, "text": "predict read mission in the hospital or you're doing like drug Discovery or whatever it is there's no rule of thumb to say oh you should use xgboost here or you know you should build a linear model or whatever it is the only way to know what's going to work the best is to try everything,", "start": 445.735, "speaker": "Greg"}, {"confidence": 0.96, "end": 467.68, "track": 1, "text": "until our roots are kind of in this thing you guys are familiar with it I'm sure called keggle.", "start": 459.946, "speaker": "Greg"}, {"confidence": 0.91, "end": 469.795, "track": 0, "text": "Competitive data science right.", "newpara": true, "start": 467.608, "speaker": "Cory"}, {"confidence": 0.88, "end": 472.088, "track": 1, "text": "Sites like Airbnb for data science right.", "newpara": true, "start": 469.519, "speaker": "Greg"}, {"confidence": 0.93, "end": 486.885, "track": 0, "text": "I've never heard it said that way I was I was thinking it was more like the it was like massive was a massive online game or one of those nerds.", "newpara": true, "start": 473.335, "speaker": "Cory"}, {"confidence": 0.9, "end": 493.861, "track": 1, "text": "Totally turned out the secret to winning those things is just to try,", "newpara": true, "start": 486.585, "speaker": "Greg"}, {"confidence": 0.95, "end": 505.122, "track": 1, "text": "as many things as you can and you'll discover the thing that works for your particular dataset for whatever reason and and that's how you get good model so it just tries everything,", "start": 493.729, "speaker": "Greg"}, {"confidence": 0.9, "end": 516.077, "track": 1, "text": "using kind of brute force and also some some heuristics and some smart things that leave baked into the platform it's basically AI building AI which is pretty cool.", "start": 505.099, "speaker": "Greg"}, {"confidence": 0.92, "end": 518.15, "track": 0, "text": "Von Neumann probe.", "newpara": true, "start": 516.077, "speaker": "Cory"}, {"confidence": 0.98, "end": 521.455, "track": 1, "text": "I don't know what that means.", "newpara": true, "start": 518.0, "speaker": "Greg"}, {"confidence": 0.83, "end": 528.365, "track": 0, "text": "Look up the Spades are self-replicating spacecraft to take over the galaxies it's like a high bill and I are maybe switch called Skynet.", "newpara": true, "start": 520.043, "speaker": "Cory"}, {"confidence": 0.71, "end": 530.384, "track": 1, "text": "Yes sure why not.", "newpara": true, "start": 528.065, "speaker": "Greg"}, {"confidence": 0.92, "end": 544.428, "track": 0, "text": "So so what are things at that other say so it's so what what did a robot does is a very focused thing because one thing is that I learned in that class and we learned was there's some things I have to happen before.", "newpara": true, "start": 530.084, "speaker": "Cory"}, {"confidence": 0.96, "end": 551.945, "track": 0, "text": "Datarobot is leveraged which is really around this this concept of data wrangling is that fair to say.", "start": 544.807, "speaker": "Cory"}, {"confidence": 0.96, "end": 560.46, "track": 1, "text": "Yeah I think there's a couple of pieces to it what is data that you get wherever you are is going to be a mess,", "newpara": true, "start": 551.987, "speaker": "Greg"}, {"confidence": 0.97, "end": 573.181, "track": 1, "text": "right you're going to have missing values you're going to have you know just weirdness about your data that you can't discover until you start kind of down this process so being able to iterate really fast is important,", "start": 560.322, "speaker": "Greg"}, {"confidence": 0.93, "end": 578.072, "track": 1, "text": "and then the other piece that's important is being able to,", "start": 573.133, "speaker": "Greg"}, {"confidence": 0.95, "end": 585.379, "track": 1, "text": "partition your data appropriately right so I don't know how technical you want to get but one of the one of the secrets to.", "start": 577.971, "speaker": "Greg"}, {"confidence": 0.92, "end": 591.376, "track": 1, "text": "To building these models in a safe ways to never evaluate how well a bottle works,", "start": 585.56, "speaker": "Greg"}, {"confidence": 0.9, "end": 604.68, "track": 1, "text": "add data that was used to train it so you have to partition out set aside some data at the start in order to have kind of a hold out her a test sample that that you can use to see how well your models did,", "start": 591.413, "speaker": "Greg"}, {"confidence": 0.88, "end": 610.065, "track": 1, "text": "so yeah it's another piece of the whole data wrangling pie that the day robot takes care of for you.", "start": 604.687, "speaker": "Greg"}, {"confidence": 0.93, "end": 620.358, "track": 3, "text": "Greg is this tool do we use datarobot do you focus on the data scientist as a tool for them because,", "newpara": true, "start": 610.462, "speaker": "Thomas"}, {"confidence": 0.92, "end": 627.863, "track": 3, "text": "data scientist are in a really hard to find and really popular so is this something that a data engineer can start looking at a running up against or do you see,", "start": 620.136, "speaker": "Thomas"}, {"confidence": 0.89, "end": 631.415, "track": 3, "text": "this being something that the data scientist is going to use them, augment for them.", "start": 627.624, "speaker": "Thomas"}, {"confidence": 0.97, "end": 640.23, "track": 1, "text": "You know it's funny you should ask that question I would say probably 60% of our users.", "newpara": true, "start": 631.115, "speaker": "Greg"}, {"confidence": 0.96, "end": 648.949, "track": 1, "text": "I'm guessing have never done data science projects before yeah so you know we went in with one of the biggest banks,", "start": 640.363, "speaker": "Greg"}, {"confidence": 0.96, "end": 662.644, "track": 1, "text": "in the world and started working with an organization actually a sales organization that was trying to kind of increase efficiency and and boost revenue and so on and we worked with,", "start": 648.878, "speaker": "Greg"}, {"confidence": 0.96, "end": 664.068, "track": 1, "text": "yeah some guys that,", "start": 662.602, "speaker": "Greg"}, {"confidence": 0.94, "end": 678.412, "track": 1, "text": "so guys and gals that had never done data science before 90% of our users at that bank have never done this kind of work before and within the first year they generated you know 10:20 million dollars in additional Revenue just from prospecting better,", "start": 664.027, "speaker": "Greg"}, {"confidence": 0.93, "end": 688.321, "track": 1, "text": "right so that's that's a subset of our users kind of these new analysts that are data Savvy maybe they spend most of their time in Excel.", "start": 678.304, "speaker": "Greg"}, {"confidence": 0.9, "end": 692.779, "track": 1, "text": "You know kind of kind of doing that analyst type work.", "start": 688.507, "speaker": "Greg"}, {"confidence": 0.92, "end": 702.202, "track": 1, "text": "The rest of our users are arguing with your your data scientist right with with varying levels of skill I find it,", "start": 692.912, "speaker": "Greg"}, {"confidence": 0.88, "end": 706.931, "track": 1, "text": "that working with data scientist in a bit of a mixed bag.", "start": 702.244, "speaker": "Greg"}, {"confidence": 0.98, "end": 712.934, "track": 1, "text": "Because there's some sort of a mix of skepticism and fear I think.", "start": 707.31, "speaker": "Greg"}, {"confidence": 0.87, "end": 721.479, "track": 1, "text": "With with the to her like datarobot because we are made of a big chunk of the work that a lot of data scientist do today.", "start": 713.355, "speaker": "Greg"}, {"confidence": 0.87, "end": 727.308, "track": 1, "text": "And so you know there's a portion of data scientist to see datarobot and they go.", "newpara": true, "start": 721.846, "speaker": "Greg"}, {"confidence": 0.92, "end": 737.427, "track": 1, "text": "Holy crap what am I going to do right is my job going to be is going to be here and then there's a bigger chunk of data scientist that look at datarobot it's a,", "start": 727.362, "speaker": "Greg"}, {"confidence": 0.86, "end": 742.751, "track": 1, "text": "well I can accomplish you have 10 times more than I could yesterday using it to like this.", "start": 737.439, "speaker": "Greg"}, {"confidence": 0.92, "end": 756.95, "track": 0, "text": "Yeah but that's that's what it seems like you said the people there there's not nearly enough of the data scientist anyway so maybe the maybe maybe they spend their time actually focused on developing the ROI rather than developing the model for the sake of model development.", "newpara": true, "start": 742.781, "speaker": "Cory"}, {"confidence": 0.95, "end": 772.081, "track": 1, "text": "Yeah I mean it's a trend right so in the days of data visualization space over the last five years we've had tools like qlikview Tableau come about that have democratize the whole management reporting piece,", "newpara": true, "start": 757.828, "speaker": "Greg"}, {"confidence": 0.9, "end": 776.528, "track": 1, "text": "on the dataprep ETL side we got tools like.", "start": 771.991, "speaker": "Greg"}, {"confidence": 0.79, "end": 782.501, "track": 1, "text": "Ultrax are Posada or talador some of these others that have made it possible for.", "start": 776.691, "speaker": "Greg"}, {"confidence": 0.93, "end": 797.397, "track": 1, "text": "For folks that can't code to build data sets and so on a robot has done the same for data science it's certainly the case that over the next five years you know technical people are going to be forced to become more business.", "start": 782.676, "speaker": "Greg"}, {"confidence": 0.96, "end": 800.558, "track": 1, "text": "And business people are going to be forced to become more technical.", "start": 797.47, "speaker": "Greg"}, {"confidence": 0.92, "end": 804.957, "track": 0, "text": "Yeah one of the things we've heard this over and over again is like.", "newpara": true, "start": 800.643, "speaker": "Cory"}, {"confidence": 0.85, "end": 811.633, "track": 0, "text": "You know machine learning school in until applied isn't eating will get to some of the ways you do it but I want am I my car,", "start": 804.819, "speaker": "Cory"}, {"confidence": 0.95, "end": 822.137, "track": 0, "text": "arguments you know where I think we'll see things like machine learning and AI have the most impact as we're intelligent software companies use it to power.", "start": 811.405, "speaker": "Cory"}, {"confidence": 0.96, "end": 827.725, "track": 0, "text": "Either building other ml or that they use it to simplify other very technical jobs.", "start": 822.143, "speaker": "Cory"}, {"confidence": 0.91, "end": 838.301, "track": 0, "text": "Already been place right automation on steroids to quote and ruining right I think a lot of this is going out I feel like it.", "start": 827.75, "speaker": "Cory"}, {"confidence": 0.93, "end": 844.472, "track": 0, "text": "I feel like machine learning what you guys are doing with it to to democratize it.", "start": 838.332, "speaker": "Cory"}, {"confidence": 0.91, "end": 851.984, "track": 0, "text": "Is almost as cooler I mean is cool but it feels like it's the nearest term chance machine learning has to find its way into the Enterprise.", "start": 844.371, "speaker": "Cory"}, {"confidence": 0.94, "end": 860.823, "track": 1, "text": "Yeah there's a lot of places right you know I mean it's certainly not knew that that these kinds of predicted models replace,", "newpara": true, "start": 852.693, "speaker": "Greg"}, {"confidence": 0.94, "end": 874.824, "track": 1, "text": "some of the more manual were coming 25 years ago when you went and got a quote for your auto insurance you sit down with an agent or another writer and they you know fill out some forms and estimate your risk and so on but today there's,", "start": 860.703, "speaker": "Greg"}, {"confidence": 0.87, "end": 877.697, "track": 1, "text": "there's doesn't happen right it's all a predictive model.", "start": 874.705, "speaker": "Greg"}, {"confidence": 0.88, "end": 884.721, "track": 1, "text": "It's so you know that this is kind of the natural extension of that you know if you look it up Factory,", "start": 878.196, "speaker": "Greg"}, {"confidence": 0.95, "end": 897.448, "track": 1, "text": "write a you know a manufacturing plant or something like that why in the world wouldn't you hook up Automated machine learning to All Those sensors that are taking readings in order to do predictive maintenance and keep that thing up and running,", "start": 884.589, "speaker": "Greg"}, {"confidence": 0.92, "end": 907.844, "track": 1, "text": "are you can build thousands of models to predict what parts are going to break in and replace them just in time without having to you know go through all that complex analysis in Selma.", "start": 897.335, "speaker": "Greg"}, {"confidence": 0.95, "end": 921.647, "track": 3, "text": "Greg so if we're talking about you know the ability Force users that are data Savvy but are not data scientist being able to use a robot be able to get boring machine learning because I mean the whole thing we were talking about one thing that really stuck out as you said democratizing data so what's,", "newpara": true, "start": 907.544, "speaker": "Thomas"}, {"confidence": 0.93, "end": 929.543, "track": 3, "text": "skills do these data saby Engineers or analyst need to have them in order to be able to become and use this to look like a data scientist what.", "start": 921.389, "speaker": "Thomas"}, {"confidence": 0.94, "end": 943.304, "track": 1, "text": "The biggest one is knowing the business right I mean if you think about sort of the standard definition of a data scientist there's those 3 skill sets you can picture that Den diagram that everybody seen.", "newpara": true, "start": 930.222, "speaker": "Greg"}, {"confidence": 0.96, "end": 950.112, "track": 1, "text": "The meeting of coding and algorithms and business expertise,", "start": 943.358, "speaker": "Greg"}, {"confidence": 0.98, "end": 957.713, "track": 1, "text": "I think the traditional data scientist has the most trouble with the business expertise side and that is arguably the most important piece of the puzzle.", "start": 950.01, "speaker": "Greg"}, {"confidence": 0.96, "end": 967.779, "track": 1, "text": "Turns out that if you can take somebody who knows the business knows the problems right they're losing sleep over you know whatever it might be,", "start": 957.9, "speaker": "Greg"}, {"confidence": 0.95, "end": 979.304, "track": 1, "text": "my Revenue are or operating expenses or risk whatever if you can give them the ability to spot opportunities to convert those business problems into real.", "start": 967.611, "speaker": "Greg"}, {"confidence": 0.86, "end": 985.986, "track": 1, "text": "Ml problems like mushy AI Solutions then you know you're 80% of the way there cuz you can,", "start": 979.425, "speaker": "Greg"}, {"confidence": 0.92, "end": 994.495, "track": 1, "text": "Automation in tools can get them the rest of the way so it's not really a technical challenge anymore obviously knowing the data is important,", "start": 985.896, "speaker": "Greg"}, {"confidence": 0.95, "end": 1002.565, "track": 1, "text": "and you know having having access to it and all the kind of data infrastructure and so on the that goes along with it but,", "start": 994.321, "speaker": "Greg"}, {"confidence": 0.97, "end": 1008.087, "track": 1, "text": "really 90% the battle is knowing the business and being able to frame the problem.", "start": 1002.439, "speaker": "Greg"}, {"confidence": 0.89, "end": 1018.76, "track": 0, "text": "You guys so nice so good they said you know it's organized in a decent way that I can implement it into datarobot.", "newpara": true, "start": 1008.286, "speaker": "Cory"}, {"confidence": 0.88, "end": 1024.624, "track": 0, "text": "And then you. You either uploaded there or you know you if you give bitter about access a file then.", "start": 1018.658, "speaker": "Cory"}, {"confidence": 0.93, "end": 1029.071, "track": 0, "text": "You can do some like you said that data you know cleansing missing values that kind of stuff.", "start": 1024.499, "speaker": "Cory"}, {"confidence": 0.91, "end": 1043.174, "track": 0, "text": "Goes into running at running at the meat of what a termite does which is it goes in parses the day to end illogical sets like you talked about holdouts right so you can do some training you can do some some validation,", "start": 1028.963, "speaker": "Cory"}, {"confidence": 0.98, "end": 1050.247, "track": 0, "text": "later and then after that once I've got some models and I figured out which models are best.", "start": 1043.001, "speaker": "Cory"}, {"confidence": 0.94, "end": 1059.735, "track": 0, "text": "Well that's what I do then what is a robot help me do from the point of I've got a model that that identified as good how do I actually put that into practice.", "start": 1050.38, "speaker": "Cory"}, {"confidence": 0.97, "end": 1067.084, "track": 1, "text": "Yeah really good question turns out that's the second hardest part of this process.", "newpara": true, "start": 1060.295, "speaker": "Greg"}, {"confidence": 0.94, "end": 1077.799, "track": 1, "text": "It's the first hardest lets you automate all the all the technical data side stuff and it's different for every use case so your deployment options have to be,", "start": 1067.199, "speaker": "Greg"}, {"confidence": 0.97, "end": 1083.225, "track": 1, "text": "very flexible because all use cases are going to have somewhat different implementation.", "start": 1077.775, "speaker": "Greg"}, {"confidence": 0.9, "end": 1096.745, "track": 1, "text": "Right so if you imagine a fraud use case right where I transaction like a processor like a point-of-sale type transaction processor and I want to block fraudulent transactions,", "start": 1083.616, "speaker": "Greg"}, {"confidence": 0.93, "end": 1107.898, "track": 1, "text": "why do you do that in real time right I need to do it when the person is standing there at the checkout register if it's a fraudulent transaction I want to block it before the person gets pays.", "start": 1096.746, "speaker": "Greg"}, {"confidence": 0.91, "end": 1119.279, "track": 1, "text": "Set a real time he's case that means it has to be highly available it has to be redundant to test the never fail has to be on all the time and has to respond and in microseconds and so on,", "start": 1108.199, "speaker": "Greg"}, {"confidence": 0.91, "end": 1129.032, "track": 1, "text": "that's one kind of one end of the spectrum right and there's lots of stuff in that real-time space things like high frequency trading or admitting Gore,", "start": 1119.316, "speaker": "Greg"}, {"confidence": 0.93, "end": 1137.421, "track": 1, "text": "yeah whatever might be you know the kind of on the far other side of the spectrum is,", "start": 1129.014, "speaker": "Greg"}, {"confidence": 0.94, "end": 1151.41, "track": 1, "text": "like nightly batch type processing right maybe I have a set of customer is it on a weekly basis say I want to score them for churn risk right I want to try to predict who's going to leave me for a competitor.", "start": 1137.421, "speaker": "Greg"}, {"confidence": 0.91, "end": 1156.962, "track": 1, "text": "Well I don't need to do that in real time and I don't need to do it every day maybe maybe I need to do it,", "newpara": true, "start": 1151.639, "speaker": "Greg"}, {"confidence": 0.95, "end": 1168.5, "track": 1, "text": "weekly or monthly you're even cordially something like that depending on the business so you know those two use cases both are worth tons of money but they have a really really different.", "start": 1156.884, "speaker": "Greg"}, {"confidence": 0.86, "end": 1173.457, "track": 1, "text": "I implementation path so I don't think you can focus on one,", "start": 1168.716, "speaker": "Greg"}, {"confidence": 0.94, "end": 1186.455, "track": 1, "text": "particular set up that's one of the mistakes that we actually see a lot is that organizations have sort of the happy past the one pass that they deploy these models with and they don't really work for either,", "start": 1173.421, "speaker": "Greg"}, {"confidence": 0.9, "end": 1191.136, "track": 1, "text": "either either one of those Solutions do you have to be flexible I guess is what I'm saying.", "start": 1186.449, "speaker": "Greg"}, {"confidence": 0.88, "end": 1206.717, "track": 0, "text": "Yeah so that's one thing that we also knows truth is it by I heard every algorithm is wrong but many of them are inherently useful.", "newpara": true, "start": 1191.935, "speaker": "Cory"}, {"confidence": 0.44, "end": 1207.504, "track": 1, "text": "He's at.", "newpara": true, "start": 1206.477, "speaker": "Greg"}, {"confidence": 0.94, "end": 1212.035, "track": 0, "text": "But but they also their usefulness doesn't it doesn't degrade over time.", "newpara": true, "start": 1207.306, "speaker": "Cory"}, {"confidence": 0.89, "end": 1227.737, "track": 1, "text": "They do so you have to watch him in fact there's a lot of regulation in the financial sector that actually forces organizations to do that kind of modeling for their or monitoring for their models you know it needs in the credit scoring space,", "newpara": true, "start": 1212.312, "speaker": "Greg"}, {"confidence": 0.92, "end": 1236.702, "track": 1, "text": "for example really all models within banking institutions depending on the level of risk associated with them going wrong,", "start": 1227.509, "speaker": "Greg"}, {"confidence": 0.9, "end": 1246.137, "track": 1, "text": "yeah tomorrow right are they still making accurate predictions is the is the population different has the world changed because you know these events happened in the world and,", "start": 1236.553, "speaker": "Greg"}, {"confidence": 0.95, "end": 1259.272, "track": 1, "text": "the extent that the relationships between the features that you including your models and whatever outcome that you're trying to predict to the extent those relationships change then all the sudden your models aren't aren't going to be working anymore so keeping an item is really important.", "start": 1246.059, "speaker": "Greg"}, {"confidence": 0.92, "end": 1269.776, "track": 0, "text": "Is that one of the other challenges with a lot of this machine learning the trend towards AI is the ability to audit what's actually going on under the covers.", "newpara": true, "start": 1259.832, "speaker": "Cory"}, {"confidence": 0.92, "end": 1280.178, "track": 1, "text": "There's actually been a ton of progress in that space so you know yet I think all of us and probably heard the word Black Box before you guys heard that.", "newpara": true, "start": 1270.54, "speaker": "Greg"}, {"confidence": 0.93, "end": 1290.754, "track": 1, "text": "That phrase I hate it because depending on who who you're talking to they'll use that word is like an arrow that they're firing at you a flaming arrow.", "start": 1280.509, "speaker": "Greg"}, {"confidence": 0.91, "end": 1299.443, "track": 1, "text": "So if you talk to the statisticians and they'll use the word Black Box to describe any machine learning technique like a random forest or something like that.", "start": 1291.001, "speaker": "Greg"}, {"confidence": 0.93, "end": 1308.625, "track": 1, "text": "Let me talk to a business person then all bottles are black boxes you know whatever right but it turns out it might be you that.", "start": 1300.069, "speaker": "Greg"}, {"confidence": 0.98, "end": 1312.447, "track": 1, "text": "The technology to understand how these models work.", "start": 1309.046, "speaker": "Greg"}, {"confidence": 0.83, "end": 1321.953, "track": 1, "text": "Things like partial dependency and sensitivity analyses and reason you no reason codes and so on,", "start": 1312.766, "speaker": "Greg"}, {"confidence": 0.97, "end": 1330.312, "track": 1, "text": "there's plenty of ways to understand the inner workings of even your most complex deep neural networks.", "start": 1321.96, "speaker": "Greg"}, {"confidence": 0.93, "end": 1344.698, "track": 1, "text": "You know certainly their models that are less interpretable than others and there's there's a trade-off when it comes to model selection in terms of picking something that's simple and explainable versus accurate right there.", "start": 1330.534, "speaker": "Greg"}, {"confidence": 0.83, "end": 1348.189, "track": 1, "text": "Those things go to Spectrum.", "start": 1344.944, "speaker": "Greg"}, {"confidence": 0.9, "end": 1352.029, "track": 0, "text": "It's like you can have we are so you can have good fast and cheap but you have to pick two.", "newpara": true, "start": 1348.207, "speaker": "Cory"}, {"confidence": 0.91, "end": 1359.846, "track": 1, "text": "Exactly so simple or accurate I don't know if it certainly it was it was that way more in the past but.", "newpara": true, "start": 1351.728, "speaker": "Greg"}, {"confidence": 0.93, "end": 1367.208, "track": 1, "text": "The tools have really come a long way as far as interpreting how these models actually work even when they're really quite complex.", "start": 1360.045, "speaker": "Greg"}, {"confidence": 0.93, "end": 1378.889, "track": 0, "text": "Interesting dinner robot takes this concept of okay I can build a model and I can visualize what the model is and then I have the option of if I want to do this real time.", "newpara": true, "start": 1368.398, "speaker": "Cory"}, {"confidence": 0.89, "end": 1384.051, "track": 0, "text": "Do you know I wanted a boy that Fried Chicken a use case or I want to do that batch.", "start": 1379.382, "speaker": "Cory"}, {"confidence": 0.91, "end": 1389.387, "track": 0, "text": "Is it like like 120 say it deploys is not as it opening up like a.", "start": 1384.406, "speaker": "Cory"}, {"confidence": 0.9, "end": 1399.374, "track": 0, "text": "I'm in some sort of an API that I can integrate into you some sort of commercial or proprietary application like what how do I actually put it into put y'all put it into action.", "start": 1389.351, "speaker": "Cory"}, {"confidence": 0.86, "end": 1409.283, "track": 1, "text": "Yeah there's four main ways to do it inside a big the robot one is a gooey based approach so if I'm an Excel user.", "newpara": true, "start": 1399.314, "speaker": "Greg"}, {"confidence": 0.94, "end": 1421.295, "track": 1, "text": "And I have some kind of process that I that I manually do I can just drag and drop a file into the GUI super manual not super repeatable.", "start": 1409.47, "speaker": "Greg"}, {"confidence": 0.89, "end": 1426.799, "track": 1, "text": "But it exists right so if you don't want to write any code if you want kind of the the easy way then.", "start": 1421.542, "speaker": "Greg"}, {"confidence": 0.91, "end": 1437.628, "track": 1, "text": "The gooey is there II you like you say ASAP I approached so my personal view is that the API using an API for for deploying predictive models.", "start": 1426.92, "speaker": "Greg"}, {"confidence": 0.97, "end": 1446.822, "track": 1, "text": "Is a very excellent way to do it mainly because it keeps you from having to implement scoring code it eliminates the possibility of implementation errors.", "start": 1437.754, "speaker": "Greg"}, {"confidence": 0.88, "end": 1454.67, "track": 1, "text": "It's all right there's lots of good parts of good good options when it comes to a good reasons to use API.", "start": 1447.056, "speaker": "Greg"}, {"confidence": 0.9, "end": 1460.318, "track": 1, "text": "Hot low latency high-throughput horizontally scalable all that kind of stuff.", "start": 1455.229, "speaker": "Greg"}, {"confidence": 0.94, "end": 1472.925, "track": 1, "text": "Set a third or second the third is spark so you know if you're scoring a Giant Mountain of data then distributed scoring using something like to do pleasing Spa.", "start": 1460.691, "speaker": "Greg"}, {"confidence": 0.93, "end": 1476.116, "track": 1, "text": "It's super fast super good way to do it.", "start": 1473.082, "speaker": "Greg"}, {"confidence": 0.88, "end": 1484.336, "track": 1, "text": "In the last way to to get prediction Saturday to robot it's just a dump coat but will give you raw Java code so if you want to.", "start": 1476.471, "speaker": "Greg"}, {"confidence": 0.92, "end": 1497.917, "track": 1, "text": "Yeah literally see exactly every step to do to her about us taking you just dump the code directly out and Implement that directly that's a more technical approach right I mean that's going to require some engineering work to get it up and running.", "start": 1484.721, "speaker": "Greg"}, {"confidence": 0.95, "end": 1511.077, "track": 1, "text": "It's little it's it's cold right it needs to be in a compiled and maintained and so on so if you want the code you can have it and that's good for you know like an offline application or if I need,", "newpara": true, "start": 1498.133, "speaker": "Greg"}, {"confidence": 0.91, "end": 1520.973, "track": 1, "text": "Ultra Ultra fast embedded predictions for like a high-frequency trading yusuke's or something like that then you know that's that that's the fourth option.", "start": 1511.035, "speaker": "Greg"}, {"confidence": 0.74, "end": 1527.427, "track": 0, "text": "Interesting so one thing she brought up was deployment model so when things like I was.", "newpara": true, "start": 1521.334, "speaker": "Cory"}, {"confidence": 0.92, "end": 1540.833, "track": 0, "text": "On your website I noticed that you very much have a cloud service and I'm guessing that's probably that's probably like the entry point for a lot of your urinary customers they want to try it out they don't want to have to invest in.", "start": 1527.464, "speaker": "Cory"}, {"confidence": 0.95, "end": 1547.708, "track": 0, "text": "Deploying you know any sort of platform themselves I just want to play with and take her which is cool but.", "start": 1541.086, "speaker": "Cory"}, {"confidence": 0.95, "end": 1561.649, "track": 0, "text": "Do you also offer like are there are there large organizations that say look I don't want to I don't want to send all of this data that I want to run these models against I want to do this and you know in my security on my data center on my gear,", "start": 1547.618, "speaker": "Cory"}, {"confidence": 0.95, "end": 1570.446, "track": 0, "text": "is there a way for organizations to do it both ways or is it all or non-dairy is it only in the cloud what are the how do organizations actually deployed.", "start": 1562.142, "speaker": "Cory"}, {"confidence": 0.87, "end": 1574.268, "track": 0, "text": "Ada robot in context of their Enterprise strategy.", "newpara": true, "start": 1571.204, "speaker": "Cory"}, {"confidence": 0.96, "end": 1584.279, "track": 1, "text": "Yeah turns out that's a really good question and organizations have tackled it differently the more,", "newpara": true, "start": 1574.425, "speaker": "Greg"}, {"confidence": 0.87, "end": 1592.47, "track": 1, "text": "the smaller an organization is of the newer it is the more friendly they are towards the cloud I was just supposed to not surprising.", "start": 1584.262, "speaker": "Greg"}, {"confidence": 0.96, "end": 1601.964, "track": 1, "text": "And the more sensitive data an organization uses Health Data personal credit information that kind of thing those those guys,", "start": 1592.68, "speaker": "Greg"}, {"confidence": 0.9, "end": 1612.293, "track": 1, "text": "tend to want to have it on prep solution so about 2 3 years ago we kind of made the commitment to to be available however you want us,", "start": 1601.88, "speaker": "Greg"}, {"confidence": 0.88, "end": 1616.602, "track": 1, "text": "so we've got a Cloud solution we probably,", "start": 1612.192, "speaker": "Greg"}, {"confidence": 0.9, "end": 1629.377, "track": 1, "text": "yeah 60% of our customers use the cloud all the big customers and all the banks in and health health organizations use on Prime Solutions so datarobot can install on.", "start": 1616.524, "speaker": "Greg"}, {"confidence": 0.95, "end": 1635.909, "track": 1, "text": "Clusters Linux servers is there's lots and lots of ways to to get datarobot to work.", "start": 1629.828, "speaker": "Greg"}, {"confidence": 0.93, "end": 1647.591, "track": 1, "text": "In your environment we don't need an internet connection to run detour about never tries to the phone home when it's on Prime and so on so we can be fully behind a firewall on and not their problem.", "start": 1636.042, "speaker": "Greg"}, {"confidence": 0.95, "end": 1665.978, "track": 0, "text": "Cherish you bring up that that's that's actually one of the really intriguing things I learned about it about that I thought it was in terms of like usefulness and an Enterprise adoption what things are we saw over the last five years was a lot of organizations much like your AIG example previously where they invested have landed a science because I thought,", "newpara": true, "start": 1647.411, "speaker": "Cory"}, {"confidence": 0.9, "end": 1676.038, "track": 0, "text": "he's doing it we got to do it a lot of people interested in these big Hadoop cluster is because there were like there's the state of deluge we got to have a place to store it this technology whether it's,", "start": 1665.763, "speaker": "Cory"}, {"confidence": 0.92, "end": 1684.829, "track": 0, "text": "your quad air horn works or whatever this to do stuff is is where everybody seems to be stored it because then we can analyze it and there was kind of this like this,", "start": 1675.798, "speaker": "Cory"}, {"confidence": 0.88, "end": 1690.561, "track": 0, "text": "Sheikh investment and people had built these are clusters and then they struggle sometimes with getting value.", "start": 1684.643, "speaker": "Cory"}, {"confidence": 0.91, "end": 1700.813, "track": 0, "text": "Out of one all the data into the investments in technology that they made to the basically build these big siloed data analytics environments to me it seems like.", "start": 1690.928, "speaker": "Cory"}, {"confidence": 0.79, "end": 1706.48, "track": 0, "text": "Datarobot going in and then coexisting an existing to do clusters,", "start": 1701.09, "speaker": "Cory"}, {"confidence": 0.9, "end": 1713.071, "track": 0, "text": "like that has to be when I'm by myself and I have to be one of those like Target go to market and probably best places for people who are,", "start": 1706.306, "speaker": "Cory"}, {"confidence": 0.87, "end": 1719.988, "track": 0, "text": "like your customers are looking around going well I got this giant I do cluster and nobody likes it anymore.", "start": 1713.312, "speaker": "Cory"}, {"confidence": 0.92, "end": 1739.085, "track": 1, "text": "You're so right there that's exactly what we saw you know to three years ago as we were you know starting starting out in the yard Prime space is that organizations have spent millions of dollars on commodity Hardware to run Cloudera hortonworks,", "newpara": true, "start": 1720.036, "speaker": "Greg"}, {"confidence": 0.79, "end": 1746.362, "track": 1, "text": "whatever distribution of Hadoop takes it say wanted the cores are just sitting there,", "start": 1738.911, "speaker": "Greg"}, {"confidence": 0.92, "end": 1753.663, "track": 1, "text": "right there just not not being used no compute right maybe they're the date of notes are getting used but the the computers just kind of,", "start": 1746.206, "speaker": "Greg"}, {"confidence": 0.9, "end": 1761.078, "track": 1, "text": "a dormant so yeah we are weird it where is tightly integrated with the dupe as you as you can be,", "start": 1753.555, "speaker": "Greg"}, {"confidence": 0.94, "end": 1774.454, "track": 1, "text": "you know we had a great with all the electron cloud air will integrate with century and Kerberos and so on yeah we install with we look look just like a native application on Cloudera iPod Air package manager,", "start": 1760.886, "speaker": "Greg"}, {"confidence": 0.94, "end": 1782.939, "track": 1, "text": "yard integration all that kind of stuff so yeah we're where is tight as you can get with it with the deepest parts identification.", "start": 1774.773, "speaker": "Greg"}, {"confidence": 0.95, "end": 1791.917, "track": 0, "text": "Well I think that's one of those like you said you guys made that decision a few years ago but I would argue that pretty much anybody that wants to be you know kind of in this,", "newpara": true, "start": 1783.09, "speaker": "Cory"}, {"confidence": 0.91, "end": 1797.818, "track": 0, "text": "no data analytics space you got you got to be a first class citizen with the hood Defenders cuz.", "start": 1791.761, "speaker": "Cory"}, {"confidence": 0.89, "end": 1807.396, "track": 0, "text": "Like it or not there yet they have made very big investments in the customers have invested heavily in them so I think that's smart one one of the thing goes do you guys play with,", "start": 1797.788, "speaker": "Cory"}, {"confidence": 0.89, "end": 1818.357, "track": 0, "text": "I mean I think about the predictive models in the way that you you Orient data that goes into datarobot are there equally as big of martians maybe I was biggest,", "start": 1807.216, "speaker": "Cory"}, {"confidence": 0.86, "end": 1825.754, "track": 0, "text": "but it's tight connection points into more traditional Enterprise data warehouses so I can scale at databases npp's that kind of stuff.", "start": 1818.201, "speaker": "Cory"}, {"confidence": 0.94, "end": 1832.316, "track": 1, "text": "Sure I mean there's lots of ways to bring data in right so we can make odbc connections we can,", "newpara": true, "start": 1825.526, "speaker": "Greg"}, {"confidence": 0.89, "end": 1842.621, "track": 1, "text": "yeah I'm bringing Pat parqueadero files from hdfs we can connect to PS3 or or share drives or whatever so there's lots of ways to get,", "start": 1832.232, "speaker": "Greg"}, {"confidence": 0.88, "end": 1843.637, "track": 1, "text": "to get dated.", "start": 1842.585, "speaker": "Greg"}, {"confidence": 0.95, "end": 1855.619, "track": 1, "text": "It turns out everybody's infrastructure is different right even if you go over seats right so Asia has at least in my experience seems to have a much lower adoption of Hadoop.", "start": 1843.98, "speaker": "Greg"}, {"confidence": 0.94, "end": 1866.736, "track": 1, "text": "At least they haven't maybe they haven't gotten there yet maybe they're going down a different path I don't know so the hardware and Technology Stacks that that Enterprise so using.", "start": 1856.238, "speaker": "Greg"}, {"confidence": 0.93, "end": 1874.295, "track": 1, "text": "Dad to be hugely married and so you know being able to fit in with all those different technology Stacks is really important.", "start": 1866.988, "speaker": "Greg"}, {"confidence": 0.92, "end": 1886.007, "track": 0, "text": "Yeah I was actually over in Japan end of last year and I ran into a lot of your customers there was incredible and I didn't realize you guys had such a presence in Japan I was quite stunning.", "newpara": true, "start": 1874.439, "speaker": "Cory"}, {"confidence": 0.92, "end": 1894.678, "track": 1, "text": "Yeah Japan it turns out loves automation they are crazy about robots to so.", "newpara": true, "start": 1885.707, "speaker": "Greg"}, {"confidence": 0.96, "end": 1897.358, "track": 0, "text": "Stickers must go like hotcakes over there.", "newpara": true, "start": 1894.684, "speaker": "Cory"}, {"confidence": 0.92, "end": 1903.517, "track": 1, "text": "Oh yeah it's a match made in heaven we've actually got I think maybe 15 or 16 people at RR Tokyo office,", "newpara": true, "start": 1897.058, "speaker": "Greg"}, {"confidence": 0.93, "end": 1914.844, "track": 1, "text": "a massive massive customer base there so Japan this is I would say the Leading Edge of of Automation and interest in deploying Nai to optimize their,", "start": 1903.343, "speaker": "Greg"}, {"confidence": 0.89, "end": 1916.376, "track": 1, "text": "the way everything rents.", "start": 1914.875, "speaker": "Greg"}, {"confidence": 0.85, "end": 1919.231, "track": 0, "text": "Talking about the point a I know you're,", "newpara": true, "start": 1916.377, "speaker": "Cory"}, {"confidence": 0.9, "end": 1929.632, "track": 0, "text": "you're pretty heavily focused in the financial services industry and I know it may not be able to talk about specific customers but use cases and how,", "start": 1919.339, "speaker": "Cory"}, {"confidence": 0.92, "end": 1938.574, "track": 0, "text": "you seen organizations can I go from a problem statement to a hey I'm using data robot to effectively achieve Acts.", "start": 1929.453, "speaker": "Cory"}, {"confidence": 0.97, "end": 1951.457, "track": 1, "text": "Yeah so it turns out that pretty much any part of an organization particularly banking is is ripe for automation.", "newpara": true, "start": 1938.719, "speaker": "Greg"}, {"confidence": 0.95, "end": 1961.432, "track": 1, "text": "Right so if you if you look at the sales team right if you if you look at the process of generating.", "start": 1951.656, "speaker": "Greg"}, {"confidence": 0.97, "end": 1964.575, "track": 1, "text": "New business from Prospect list.", "start": 1961.529, "speaker": "Greg"}, {"confidence": 0.86, "end": 1975.626, "track": 1, "text": "Ranking those prospects in terms of maybe their propensity to buy maybe their credit worthiness you know whatever turns out to generate.", "start": 1964.696, "speaker": "Greg"}, {"confidence": 0.92, "end": 1988.281, "track": 1, "text": "Much better results than whatever subjected process is being used by sales teams today the same is true for cross-selling right to a deepening relationships with existing customers.", "start": 1975.812, "speaker": "Greg"}, {"confidence": 0.96, "end": 1998.911, "track": 1, "text": "Turns out targeted marketing to your existing customer base to increase the the level of adoption of your product is is hugely beneficial to an organization.", "start": 1988.534, "speaker": "Greg"}, {"confidence": 0.95, "end": 2010.346, "track": 1, "text": "Risk forecasting credit losses super easy with machine learning and a huge opportunity in in banking.", "start": 1999.416, "speaker": "Greg"}, {"confidence": 0.95, "end": 2013.351, "track": 1, "text": "Fraud Financial crime.", "start": 2010.695, "speaker": "Greg"}, {"confidence": 0.93, "end": 2020.862, "track": 1, "text": "You know of operations type use cases there is just so many different avenues that you can go down,", "start": 2013.592, "speaker": "Greg"}, {"confidence": 0.92, "end": 2031.27, "track": 1, "text": "what interesting one that I particularly like it has to do with what do you do when an account goes bad right what do you do when alone you know stops paying.", "start": 2020.803, "speaker": "Greg"}, {"confidence": 0.89, "end": 2042.116, "track": 1, "text": "What's the optimal resolution strategy for for maximizing recovery's on a alone that's gone bad turns out there's lots of really interesting things you can do in that space.", "newpara": true, "start": 2031.475, "speaker": "Greg"}, {"confidence": 0.91, "end": 2056.448, "track": 3, "text": "2017 or maybe the second half of 2017 started seeing fintech huge you know on Twitter it was trending all the time and then you have toward the end of 2017 even you no more gas.", "newpara": true, "start": 2042.615, "speaker": "Thomas"}, {"confidence": 0.88, "end": 2062.307, "track": 3, "text": "Dos Mars I was going to change his name to the dean of Bitcoin or the dino blockchain.", "newpara": true, "start": 2056.316, "speaker": "Thomas"}, {"confidence": 0.9, "end": 2069.409, "track": 3, "text": "Is AI machine learning in these use cases and that's what is that word striving so much of popularity in so much of the focus.", "newpara": true, "start": 2062.259, "speaker": "Thomas"}, {"confidence": 0.95, "end": 2072.901, "track": 3, "text": "On fintech or is it is it something totally different.", "newpara": true, "start": 2069.398, "speaker": "Thomas"}, {"confidence": 0.96, "end": 2087.136, "track": 1, "text": "It's a big piece of it right so you know you've got fintech companies in the in the lending space lending is all about forecasting risk right so if I can predict How likely you are to pay back a loan price it profitably,", "newpara": true, "start": 2072.607, "speaker": "Greg"}, {"confidence": 0.9, "end": 2093.842, "track": 1, "text": "and I can steal a piece of the market so it really is an arms race and that's based in to whoever's got the best model wins.", "start": 2087.106, "speaker": "Greg"}, {"confidence": 0.94, "end": 2101.979, "track": 1, "text": "You know if you look at the payment space if you look at just so many different sectors in infant.", "start": 2094.143, "speaker": "Greg"}, {"confidence": 0.86, "end": 2109.261, "track": 1, "text": "Identifying building those models in a fast way it's speed too fast speed to Market.", "start": 2102.394, "speaker": "Greg"}, {"confidence": 0.93, "end": 2122.644, "track": 1, "text": "And be nimble the way you do it is the reason why fintex are getting so much so much traction the reason they haven't fully taken over I think there are two reasons one is they don't have nearly as much data as the big guys do.", "start": 2109.406, "speaker": "Greg"}, {"confidence": 0.96, "end": 2130.63, "track": 1, "text": "And they don't have nearly as much business expertise right so it it's still the case in my view that the big players.", "start": 2122.975, "speaker": "Greg"}, {"confidence": 0.95, "end": 2138.874, "track": 1, "text": "Still have the expertise in terms of how the business works and and how to run say a bank for example.", "start": 2130.973, "speaker": "Greg"}, {"confidence": 0.67, "end": 2141.218, "track": 3, "text": "David versus Goliath.", "newpara": true, "start": 2139.271, "speaker": "Thomas"}, {"confidence": 0.94, "end": 2151.638, "track": 1, "text": "Yeah I mean the tech guys are are coming into their they're taking up a lot of that slack and I think some of the big players are are justifiably afraid,", "newpara": true, "start": 2141.194, "speaker": "Greg"}, {"confidence": 0.85, "end": 2157.304, "track": 1, "text": "I've got the market share that they're losing in that space but there's still time for for the big words to,", "start": 2151.506, "speaker": "Greg"}, {"confidence": 0.88, "end": 2164.004, "track": 1, "text": "to you know a vested in a i and end build models and more nipples High fashion to to stay head.", "start": 2157.298, "speaker": "Greg"}, {"confidence": 0.9, "end": 2172.525, "track": 2, "text": "What area of financials do you think machine learning will change the most of Sardar be the most transformative in.", "newpara": true, "start": 2165.171, "speaker": "Kyle"}, {"confidence": 0.96, "end": 2180.637, "track": 1, "text": "So interesting I think that I think the financial crimes and fraud Space is really interesting.", "newpara": true, "start": 2172.508, "speaker": "Greg"}, {"confidence": 0.97, "end": 2187.265, "track": 1, "text": "Most of the fraud systems that we come across these days are sort of rule-based.", "start": 2181.022, "speaker": "Greg"}, {"confidence": 0.92, "end": 2199.914, "track": 1, "text": "Right so you know what this transaction meets rules a b and c that will block it otherwise not those those systems tend not to be very good you can improve them very very easily with machine learning.", "start": 2187.314, "speaker": "Greg"}, {"confidence": 0.86, "end": 2205.923, "track": 1, "text": "That's going to reduce losses until I meant that's going to be really big.", "start": 2200.323, "speaker": "Greg"}, {"confidence": 0.91, "end": 2212.888, "track": 2, "text": "Take it a lot from a classification filter too much more of a alive breathing classify right.", "newpara": true, "start": 2206.2, "speaker": "Kyle"}, {"confidence": 0.9, "end": 2220.7, "track": 1, "text": "Is a ton of room there I think things it's been really interesting it in the lending space,", "newpara": true, "start": 2212.87, "speaker": "Greg"}, {"confidence": 0.95, "end": 2228.776, "track": 1, "text": "you know some of the phanteks like Lending Club and in some of these others are kind of going after the non-traditional lending Market.", "start": 2220.61, "speaker": "Greg"}, {"confidence": 0.95, "end": 2241.75, "track": 1, "text": "Your folks with no credit score or or bad credit or whatever it is that's kind of been a place where the traditional players haven't ever really wanted to play so much.", "start": 2229.257, "speaker": "Greg"}, {"confidence": 0.92, "end": 2249.417, "track": 1, "text": "Or conversely have been kind of predatory in the way they they work with those folks they could have like payday lenders and and so on.", "start": 2241.882, "speaker": "Greg"}, {"confidence": 0.89, "end": 2258.437, "track": 1, "text": "I think I get it I think there's a lot going on in that that's infile credit space and and some some of those areas that are that are really interesting.", "start": 2249.664, "speaker": "Greg"}, {"confidence": 0.85, "end": 2267.967, "track": 0, "text": "So you actually spend some time prior to that robot you were you were running the Crux of this set looks like Travelers and regions developing models.", "newpara": true, "start": 2258.539, "speaker": "Cory"}, {"confidence": 0.9, "end": 2277.888, "track": 0, "text": "So how did you end up going from a being a practitioner in the inner right in the heart of this stuff to to join in a tech company doing this.", "start": 2267.865, "speaker": "Cory"}, {"confidence": 0.9, "end": 2288.422, "track": 1, "text": "Yeah so the founders of datarobot we all work together at Travelers so that's where I met Jeremy H&R.", "newpara": true, "start": 2278.67, "speaker": "Greg"}, {"confidence": 0.87, "end": 2302.02, "track": 1, "text": "Are founder and Tom big boys is co-founder so we all kind of met there they went off to start the company back in 2012 I joined.", "start": 2288.537, "speaker": "Greg"}, {"confidence": 0.92, "end": 2317.007, "track": 1, "text": "Brad two-and-a-half 3 years later something like that after they'd kind of built the products one of the unique things about datarobot is that they took or we took the first say 25 million or so in venture capital.", "start": 2302.303, "speaker": "Greg"}, {"confidence": 0.94, "end": 2330.768, "track": 1, "text": "And just dumped a hundred percent of it into building a real legitimate products that actually does what we claim it does we didn't do an iota of marketing until you know year 3.", "start": 2317.224, "speaker": "Greg"}, {"confidence": 0.89, "end": 2337.84, "track": 1, "text": "Maybe your for it so I joined right when we when we started to go to market.", "start": 2331.784, "speaker": "Greg"}, {"confidence": 0.94, "end": 2345.935, "track": 1, "text": "Because that's what I wanted to do I wanted to go in and help him power and accelerate the way organizations adopt this kind of Technology.", "start": 2338.045, "speaker": "Greg"}, {"confidence": 0.93, "end": 2359.365, "track": 0, "text": "Interesting so I'm curious you don't have a mustache anymore I thought for sure that a large part of your statistical prowess had to originate from that robust mustache that's too bad.", "newpara": true, "start": 2345.749, "speaker": "Cory"}, {"confidence": 0.87, "end": 2363.499, "track": 1, "text": "Can I find that I can barely think straight now.", "newpara": true, "start": 2359.065, "speaker": "Greg"}, {"confidence": 0.86, "end": 2371.335, "track": 0, "text": "That's that's why I hate that for you I will welcome you back to the land of the first ice anytime your anytime you're interested.", "newpara": true, "start": 2363.199, "speaker": "Cory"}, {"confidence": 0.94, "end": 2383.065, "track": 0, "text": "Well Greg this is been super fun I appreciate the conversation I think what I take away from this is is state of robot is absolutely democratizing data science developing and given folks.", "start": 2371.69, "speaker": "Cory"}, {"confidence": 0.96, "end": 2397.763, "track": 0, "text": "Some great tools actually do data science without Peter data scientist since you're actually get some Roi from machine learning in the business and you guys are automated a bunch of stuff that maybe isn't the the easiest parts of the data science process and make it easier to take.", "start": 2383.131, "speaker": "Cory"}, {"confidence": 0.92, "end": 2407.894, "track": 0, "text": "As models pushing back into the business back into action I got super cool tech people to pay attention to I got to know the like in your when you think about what's next in the,", "start": 2397.823, "speaker": "Cory"}, {"confidence": 0.97, "end": 2410.863, "track": 0, "text": "the machine learning space and you kind of look at this in,", "start": 2407.72, "speaker": "Cory"}, {"confidence": 0.93, "end": 2423.398, "track": 0, "text": "Justice technology ecosystem over the next called 12 to 18 months what are some of the big macro trends that you think that we ought to be paying attention to as a relates to the machine learning and.", "start": 2411.019, "speaker": "Cory"}, {"confidence": 0.98, "end": 2428.71, "track": 1, "text": "I think one of the really interesting places is unstructured data.", "newpara": true, "start": 2423.098, "speaker": "Greg"}, {"confidence": 0.88, "end": 2439.118, "track": 1, "text": "Dear about does a fair amount with with text just raw text and it always surprises me how much value.", "start": 2429.113, "speaker": "Greg"}, {"confidence": 0.85, "end": 2441.881, "track": 1, "text": "Barry is it just straight text,", "start": 2439.34, "speaker": "Greg"}, {"confidence": 0.94, "end": 2450.799, "track": 1, "text": "right it's not a structured data field it says it's just what somebody typed in or the words that somebody ties said or whatever it might be,", "start": 2441.816, "speaker": "Greg"}, {"confidence": 0.95, "end": 2457.956, "track": 1, "text": "that unstructured data tends to be really orthogonal to other data sources that exist and so harnessing that stuff,", "start": 2450.673, "speaker": "Greg"}, {"confidence": 0.92, "end": 2464.211, "track": 1, "text": "both text and audio and video and photos and all that kind of stuff I think it's going to be really important.", "start": 2457.824, "speaker": "Greg"}, {"confidence": 0.95, "end": 2477.954, "track": 1, "text": "You know we started to do some work in that space using like a decapitated neural networks to feature eyes images and and so on so I think there's some exciting things to come in that space the other thing to look for,", "start": 2464.47, "speaker": "Greg"}, {"confidence": 0.91, "end": 2484.822, "track": 1, "text": "from datarobot in particular over the next year is the things we're doing in the time series space.", "start": 2477.852, "speaker": "Greg"}, {"confidence": 0.98, "end": 2494.401, "track": 1, "text": "We have a Time series beta that is out now that is doing stuff with time series data that I've never seen before,", "start": 2485.238, "speaker": "Greg"}, {"confidence": 0.93, "end": 2509.219, "track": 1, "text": "that the the automated feature creation the the forecast and capabilities of datarobot there are pretty unique in the market and I don't think there exists another product out there that they can kind of they can do what they do robot,", "start": 2494.371, "speaker": "Greg"}, {"confidence": 0.84, "end": 2512.747, "track": 1, "text": "candidate type series space that's another really interesting area.", "start": 2509.166, "speaker": "Greg"}, {"confidence": 0.9, "end": 2518.858, "track": 0, "text": "Chill like a Time series indexing or time series and then model development.", "newpara": true, "start": 2512.999, "speaker": "Cory"}, {"confidence": 0.87, "end": 2523.671, "track": 1, "text": "Yeah model development so forecasting type models.", "newpara": true, "start": 2518.75, "speaker": "Greg"}, {"confidence": 0.93, "end": 2534.89, "track": 1, "text": "In the may be in the market space or you know there's lots of different applications of of Time series I mean all all the sensor data that we that we get in factories today's Time series.", "start": 2523.852, "speaker": "Greg"}, {"confidence": 0.92, "end": 2546.295, "track": 0, "text": "Yes I think about so time series I start to think about the a lot of the security and log players have to be folks that would be interesting for you to use as sources.", "newpara": true, "start": 2535.539, "speaker": "Cory"}, {"confidence": 0.91, "end": 2556.907, "track": 0, "text": "Something I'm thinking about things like when you say timeshares in act like Splunk time series DB anything that does a Time series index seems like it might be a good source that then you could use.", "start": 2546.326, "speaker": "Cory"}, {"confidence": 0.82, "end": 2559.803, "track": 0, "text": "Did robots time series product to build models against.", "start": 2557.16, "speaker": "Cory"}, {"confidence": 0.92, "end": 2567.646, "track": 1, "text": "Yeah it turns out that that kind of munging time series data is hard right it's most time series is,", "newpara": true, "start": 2560.128, "speaker": "Greg"}, {"confidence": 0.93, "end": 2580.144, "track": 1, "text": "aren't the real regular so your regular time series and then looking at you know what are all let me just imagine all the aggregation so you can make ride you got like moving averages what it what was that,", "start": 2567.436, "speaker": "Greg"}, {"confidence": 0.9, "end": 2588.99, "track": 1, "text": "what happened over the last day two weeks on this in the state at how does that help me forecast forward for this the series that I'm interested in it and so on so.", "start": 2580.001, "speaker": "Greg"}, {"confidence": 0.92, "end": 2591.802, "track": 1, "text": "Time to feature engineering stuff is really interesting.", "start": 2589.309, "speaker": "Greg"}, {"confidence": 0.89, "end": 2603.556, "track": 0, "text": "Very cool. So it said I was so pretty on datarobot any other cool announcements that that you guys are going to be arson psycho and I was the cool things we should pay attention to specifically the date of robots doing outside of this time series.", "newpara": true, "start": 2592.271, "speaker": "Cory"}, {"confidence": 0.9, "end": 2614.943, "track": 1, "text": "This that's cool stuff coming all the time so you know I would I would say have a look at our our website and see you know what what's what's all,", "newpara": true, "start": 2603.724, "speaker": "Greg"}, {"confidence": 0.91, "end": 2626.204, "track": 1, "text": "you know in the works there lots of stuff that's going on but I can't talk about at the moment so you know lots of lots of exciting opportunities out there at the data science world is a big space,", "start": 2614.895, "speaker": "Greg"}, {"confidence": 0.92, "end": 2633.913, "track": 1, "text": "I am so you know reaching out to all the little mix and crannies of of the kinds of problems with that folks are facing today's it's a good time.", "start": 2626.192, "speaker": "Greg"}, {"confidence": 0.91, "end": 2642.554, "track": 0, "text": "So do you do you personally do you go into any of the any of the data conferences like are the conferences of interest that that you spend time at.", "newpara": true, "start": 2634.004, "speaker": "Cory"}, {"confidence": 0.94, "end": 2652.428, "track": 1, "text": "Stratus always big we do Strata every year that's it it's a great conference there's another one called the open data science conference odsc,", "newpara": true, "start": 2642.945, "speaker": "Greg"}, {"confidence": 0.94, "end": 2663.941, "track": 1, "text": "it's it's kind of an open source conference it's that exciting that's that's one that I always look forward to that would happen several times a year so those those two are good ones today,", "start": 2652.265, "speaker": "Greg"}, {"confidence": 0.86, "end": 2665.239, "track": 1, "text": "that I tend to enjoy.", "start": 2663.929, "speaker": "Greg"}, {"confidence": 0.91, "end": 2675.724, "track": 0, "text": "Awesome well we're actually a community sponsor of O'Reilly strata conference is globally and for those folks listening to remember.", "newpara": true, "start": 2665.864, "speaker": "Cory"}, {"confidence": 0.96, "end": 2679.39, "track": 0, "text": "You need to drop a review and iTunes or.", "start": 2675.629, "speaker": "Cory"}, {"confidence": 0.94, "end": 2689.497, "track": 0, "text": "Subscribe to the podcast and they will have a chance to win a free pass to strata San Jose which is in March this year so we're huge fans of strata ourselves.", "start": 2679.607, "speaker": "Cory"}, {"confidence": 0.95, "end": 2701.551, "track": 0, "text": "Actually I don't know if you saw but O'Reilly actually lunch there this year they're going to have an AI set of AI conferences one in New York one in Beijing and one in London so I'll be excited to check those out this year as well.", "start": 2689.606, "speaker": "Cory"}, {"confidence": 0.94, "end": 2716.088, "track": 1, "text": "Yeah the last time I was at strata I think I went by the O'Reilly booth and they were doing headshots there was a massive line kind of out the door doing headshots at the O'Reilly booths they always stupid stuff there.", "newpara": true, "start": 2701.522, "speaker": "Greg"}, {"confidence": 0.81, "end": 2719.831, "track": 0, "text": "Those are used for a decapitated neural network.", "newpara": true, "start": 2715.841, "speaker": "Cory"}, {"confidence": 0.93, "end": 2735.93, "track": 0, "text": "I kid I kid Greg I appreciate the time it's been super fun Thomas Kyle thanks for being on what we're going to do now though is where the shift gears real quick and we're going to go to our rapid-fire section and what I want to do is is Greg setback.", "start": 2721.646, "speaker": "Cory"}, {"confidence": 0.9, "end": 2742.69, "track": 0, "text": "Relax and give me the first thing that comes to mind when I ask you this what these questions okay.", "start": 2736.092, "speaker": "Cory"}, {"confidence": 0.9, "end": 2746.181, "track": 0, "text": "What year will Skynet go online.", "start": 2743.291, "speaker": "Cory"}, {"confidence": 0.72, "end": 2748.927, "track": 1, "text": "2025.", "newpara": true, "start": 2746.127, "speaker": "Greg"}, {"confidence": 0.97, "end": 2753.079, "track": 0, "text": "Alright what's the best book you've read in the last year.", "newpara": true, "start": 2748.705, "speaker": "Cory"}, {"confidence": 0.95, "end": 2764.154, "track": 1, "text": "Oh boy I don't so many to pick from I actually read Watership Watership Down with my kids this year cuz it's super sad but it's a good butt.", "newpara": true, "start": 2753.771, "speaker": "Greg"}, {"confidence": 0.95, "end": 2769.153, "track": 0, "text": "Alright what particular genre of music are you rocking right now.", "newpara": true, "start": 2764.202, "speaker": "Cory"}, {"confidence": 0.9, "end": 2773.372, "track": 1, "text": "Oh Willie Nelson all the way.", "newpara": true, "start": 2769.286, "speaker": "Greg"}, {"confidence": 0.94, "end": 2779.802, "track": 0, "text": "Classic huge fan what is your favorite piece of utterly useless technology.", "newpara": true, "start": 2771.281, "speaker": "Cory"}, {"confidence": 0.97, "end": 2791.207, "track": 1, "text": "Wow that's a good one sitting on my desk here is a motor from a player piano.", "newpara": true, "start": 2779.886, "speaker": "Greg"}, {"confidence": 0.91, "end": 2797.517, "track": 1, "text": "That is operated a hundred percent by suction so it's a suction powered motor.", "start": 2791.628, "speaker": "Greg"}, {"confidence": 0.83, "end": 2799.932, "track": 0, "text": "I think really sucks.", "newpara": true, "start": 2797.445, "speaker": "Cory"}, {"confidence": 0.97, "end": 2810.971, "track": 1, "text": "I rebuilt it about a year ago in my shop just for just for giggles and I can't think of anything to do with it but it's so cool that I can't I can't imagine getting rid of it.", "newpara": true, "start": 2799.95, "speaker": "Greg"}, {"confidence": 0.81, "end": 2815.267, "track": 0, "text": "So I can just see you twisting your mustache while working on a suction motor in your shop.", "newpara": true, "start": 2810.881, "speaker": "Cory"}, {"confidence": 0.95, "end": 2819.047, "track": 1, "text": "You got to see it man it's super cool.", "newpara": true, "start": 2814.979, "speaker": "Greg"}, {"confidence": 0.96, "end": 2822.286, "track": 0, "text": "Alright so what is your biggest Money Pit right now.", "newpara": true, "start": 2818.747, "speaker": "Cory"}, {"confidence": 0.96, "end": 2827.436, "track": 1, "text": "Oh I'm actually starting to consider making YouTube videos.", "newpara": true, "start": 2823.133, "speaker": "Greg"}, {"confidence": 0.95, "end": 2841.407, "track": 1, "text": "So I've I've recently bought some lighting and and that's some audio video equipment stuff to start start doing that so that's certainly going to be a money pit I don't expect to ever get any any benefits from doing that.", "start": 2827.827, "speaker": "Greg"}, {"confidence": 0.9, "end": 2845.294, "track": 2, "text": "Is that like a and blogging format or educational videos.", "newpara": true, "start": 2841.191, "speaker": "Kyle"}, {"confidence": 0.96, "end": 2850.955, "track": 1, "text": "I find that there is a vacuum of quality product review videos out there.", "newpara": true, "start": 2845.187, "speaker": "Greg"}, {"confidence": 0.94, "end": 2861.753, "track": 1, "text": "I have a variety of interests everything from Firearms to woodworking to you you name it so.", "start": 2851.034, "speaker": "Greg"}, {"confidence": 0.95, "end": 2863.051, "track": 2, "text": "True Renaissance Man.", "newpara": true, "start": 2861.454, "speaker": "Kyle"}, {"confidence": 0.96, "end": 2865.551, "track": 1, "text": "Exactly so yeah product reviews.", "newpara": true, "start": 2862.919, "speaker": "Greg"}, {"confidence": 0.81, "end": 2867.558, "track": 0, "text": "Are you a cook.", "newpara": true, "start": 2865.251, "speaker": "Cory"}, {"confidence": 0.98, "end": 2870.917, "track": 1, "text": "No I don't cook but I do eat.", "newpara": true, "start": 2868.135, "speaker": "Greg"}, {"confidence": 0.91, "end": 2878.05, "track": 0, "text": "We won't we won't take you down to sous-vide pathway that's another one will teach you about later alright are you going anywhere interesting soon.", "newpara": true, "start": 2870.725, "speaker": "Cory"}, {"confidence": 0.97, "end": 2893.962, "track": 1, "text": "I have to be in London in a few weeks for for work but I don't you know I spend up I spend most of my time traveling these days anyway so the most interesting place that I go is home.", "newpara": true, "start": 2879.15, "speaker": "Greg"}, {"confidence": 0.97, "end": 2898.823, "track": 0, "text": "Couldn't agree more alright last question what show are you binging on right now.", "newpara": true, "start": 2892.635, "speaker": "Cory"}, {"confidence": 0.93, "end": 2912.578, "track": 1, "text": "I just caught up to the end of Game of Thrones so the current debated my house is what next we're about a season behind in Westworld which is an awesome show.", "newpara": true, "start": 2899.617, "speaker": "Greg"}, {"confidence": 0.96, "end": 2919.41, "track": 1, "text": "And my oldest son is catching up on The Big Bang Theory now so so that plays at my house as well.", "start": 2912.783, "speaker": "Greg"}, {"confidence": 0.93, "end": 2928.448, "track": 0, "text": "Good choice thank you so much for your time let me ask her real quick where can we find you on social if there's one to follow you check you out check out what you're up to.", "newpara": true, "start": 2919.435, "speaker": "Cory"}, {"confidence": 0.94, "end": 2942.838, "track": 1, "text": "Yes and my Twitter is tweeting as Greg which is always exciting that's really the only social media I do I've got a Facebook account but Facebook is for grandparents at this point set.", "newpara": true, "start": 2929.993, "speaker": "Greg"}, {"confidence": 0.88, "end": 2950.165, "track": 0, "text": "And it's all alright well Greg it has been super awesome I highly encourage her listeners check out due to robot really cool.", "newpara": true, "start": 2942.6, "speaker": "Cory"}, {"confidence": 0.95, "end": 2961.408, "track": 0, "text": "Piece of technology empowering analyst and those folks just interested in a science to really have data science tools at their fingertips we appreciate you listening.", "start": 2950.015, "speaker": "Cory"}, {"confidence": 0.96, "end": 2962.423, "track": 0, "text": "Have a great day.", "start": 2961.408, "speaker": "Cory"}]