[{"confidence": 0.94, "end": 10.401, "track": 3, "text": "Apics welcome to the big date of your podcast my name is Thomas Simpson and I'll be your host for today but it won't just be me I've got two other beers that are going to join the bus so Rob how are you doing today.", "newpara": true, "start": 0.006, "speaker": "Thomas"}, {"confidence": 0.89, "end": 18.075, "track": 2, "text": "Doing awesome great nice rig grey rainy day in Seattle like normal so all positive and thumbs up an optimistic.", "newpara": true, "start": 10.101, "speaker": "Rob"}, {"confidence": 0.85, "end": 21.927, "track": 3, "text": "We've also got Corey maintenance going to jump on the bus Corey how's it going.", "newpara": true, "start": 18.406, "speaker": "Thomas"}, {"confidence": 0.89, "end": 28.327, "track": 0, "text": "Math living the dream are you guys still growing your beards it's I know it's it's still No Shave November.", "newpara": true, "start": 21.861, "speaker": "Cory"}, {"confidence": 0.78, "end": 30.141, "track": 2, "text": "Trying trying too hard.", "newpara": true, "start": 28.796, "speaker": "Rob"}, {"confidence": 0.86, "end": 36.307, "track": 3, "text": "I\nI did a little trim up and had a Miss lick so I'm I started back over.", "newpara": true, "start": 29.891, "speaker": "Thomas"}, {"confidence": 0.97, "end": 38.38, "track": 0, "text": "Disappointment all over the place.", "newpara": true, "start": 36.007, "speaker": "Cory"}, {"confidence": 0.93, "end": 48.902, "track": 3, "text": "I took today we've also got to guest I'd like to introduce the co-founder reporting Works a big data Community leader and author of the programming pig book Allen Gates Allen how are you doing today.", "newpara": true, "start": 38.206, "speaker": "Thomas"}, {"confidence": 0.99, "end": 50.949, "track": 1, "text": "I'm good how are you.", "newpara": true, "start": 48.782, "speaker": "Alan"}, {"confidence": 0.88, "end": 52.068, "track": 3, "text": "Doing great.", "newpara": true, "start": 50.699, "speaker": "Thomas"}, {"confidence": 0.91, "end": 62.53, "track": 1, "text": "Anna I'm in California where it's nice and sunny no Gloom here definitely and despite the No Shave November I'm nice and cleanly shaven this morning thank you.", "newpara": true, "start": 52.299, "speaker": "Alan"}, {"confidence": 0.93, "end": 73.16, "track": 0, "text": "Yeah it's just disappointing you just bragging we started off the podcast with you bragging about California we know how that we know how that's going to go.", "newpara": true, "start": 63.408, "speaker": "Cory"}, {"confidence": 0.93, "end": 85.557, "track": 3, "text": "Well and thanks for being on the show Once I wanted to start off by just didn't give you an opportunity to be able to introduce yourself and then we'll kind of dig into your background so can you tell the audience a little bit about yourself what you do on a daily basis.", "newpara": true, "start": 74.272, "speaker": "Thomas"}, {"confidence": 0.91, "end": 99.059, "track": 1, "text": "Sure so let me start with a little history since I'm an old guy so I actually started in the Deep World about 10 years ago and a half now when it was still very young,", "newpara": true, "start": 85.744, "speaker": "Alan"}, {"confidence": 0.86, "end": 106.45, "track": 1, "text": "my eye started on the pig project which was at the time in Apache.", "start": 98.988, "speaker": "Alan"}, {"confidence": 0.96, "end": 115.374, "track": 1, "text": "Yahoo Labs as a research project we took it to Apache as an open source project that was my first experience.", "start": 106.559, "speaker": "Alan"}, {"confidence": 0.91, "end": 125.024, "track": 1, "text": "With both open source and Apache in any big way I mean I can give you that a few patches here and there before but this was definitely my first big experience.", "start": 115.549, "speaker": "Alan"}, {"confidence": 0.87, "end": 133.263, "track": 1, "text": "Worked on Pig for years moved over and started helping with hives.", "start": 125.337, "speaker": "Alan"}, {"confidence": 0.93, "end": 147.564, "track": 1, "text": "Six seven years ago now and around about that time also helped found hortonworks out a bunch of us came out of Yahoo and help to build hortonworks where I am on the,", "start": 133.75, "speaker": "Alan"}, {"confidence": 0.88, "end": 152.107, "track": 1, "text": "the architecture team so I actually my day today job,", "start": 147.445, "speaker": "Alan"}, {"confidence": 0.96, "end": 160.538, "track": 1, "text": "part of it is still development doing architecture work reviewing other people's stuff and also part of it is.", "start": 151.988, "speaker": "Alan"}, {"confidence": 0.79, "end": 164.78, "track": 1, "text": "Other founder stuff like being involved in Otti and some other things.", "start": 160.665, "speaker": "Alan"}, {"confidence": 0.95, "end": 180.873, "track": 3, "text": "But that's really interesting let me dig dig in a little bit on the Yahoo kind of how it all kind of came about so we had bills s'mores on the show not too long ago when he was there at the same time kind of working on some of the marketing research and analytics side of it,", "newpara": true, "start": 165.821, "speaker": "Thomas"}, {"confidence": 0.92, "end": 190.337, "track": 3, "text": "what was it like being a part of being a Yahoo during the days that was just coming out open source until Pig was there hi if it was all kind of being just push to the market.", "start": 180.639, "speaker": "Thomas"}, {"confidence": 0.99, "end": 191.827, "track": 1, "text": "Well.", "newpara": true, "start": 190.301, "speaker": "Alan"}, {"confidence": 0.94, "end": 201.634, "track": 1, "text": "So early on we didn't know what how big it was going to be right I mean kind of now you look back and think of it must have been amazing bit of the time it kinda was all,", "start": 192.122, "speaker": "Alan"}, {"confidence": 0.95, "end": 209.614, "track": 1, "text": "just something we thought was for us and a few other people rate I mean we were involved Facebook Netflix Twitter.", "start": 201.58, "speaker": "Alan"}, {"confidence": 0.95, "end": 221.861, "track": 1, "text": "Basically all the web properties they couldn't buy a big enough database right we couldn't go to Oracle or teradata or whatever and buy a database it would handle the amount of.", "start": 209.741, "speaker": "Alan"}, {"confidence": 0.89, "end": 233.26, "track": 1, "text": "Data we need to move at a price that we could pay them today to maybe could have handled the volumes that we had back then early on but it couldn't not at a price point that,", "start": 221.969, "speaker": "Alan"}, {"confidence": 0.95, "end": 239.503, "track": 1, "text": "it was going to work out\nso we.", "start": 233.32, "speaker": "Alan"}, {"confidence": 0.95, "end": 249.154, "track": 1, "text": "Waited up building kind of our own saying and sharing that with with the others but it wasn't.", "start": 239.84, "speaker": "Alan"}, {"confidence": 0.91, "end": 257.819, "track": 1, "text": "It wasn't that long before other people start picking it up some of the insurance companies got interested some of the banks got interested some of the government's got interested,", "start": 249.262, "speaker": "Alan"}, {"confidence": 0.94, "end": 267.902, "track": 1, "text": "it's like oh well maybe maybe this is something that other people would be interested in maybe it's not just us that's willing to do it an early on what to do if you did you had to be pretty brave,", "start": 257.903, "speaker": "Alan"}, {"confidence": 0.86, "end": 275.972, "track": 1, "text": "to do it right you had to have a fair amount of engineering resources to make it work\nbut.", "start": 267.951, "speaker": "Alan"}, {"confidence": 0.88, "end": 286.548, "track": 1, "text": "It it still was something that people start to pick up and it was a ways after that we started to realize oh this could maybe go somewhere and by then there were other people.", "start": 276.904, "speaker": "Alan"}, {"confidence": 0.87, "end": 295.58, "track": 1, "text": "That were starting to push it hot air amount bar and that's when we start to realize okay so maybe we could.", "newpara": true, "start": 287.708, "speaker": "Alan"}, {"confidence": 0.9, "end": 300.009, "track": 1, "text": "We could take this somewhere and so we started work with Yahoo and how would we get out.", "start": 295.809, "speaker": "Alan"}, {"confidence": 0.93, "end": 313.319, "track": 1, "text": "Do this on our own at the same time Rob Bearden our CEO from Benchmark Capital approached Yahoo and said hey how would you like to spend this out you know this looks like a pretty interesting,", "start": 301.061, "speaker": "Alan"}, {"confidence": 0.84, "end": 320.968, "track": 1, "text": "project and so kind of those two streams coming together work to build order more.", "start": 313.301, "speaker": "Alan"}, {"confidence": 0.92, "end": 331.076, "track": 0, "text": "Does a Confluence of a whole bunch of interesting activity I do find it I do find it interesting that you say like it was just you guys are just kind of trying to solve a problem you're so much Engineers that are.", "newpara": true, "start": 321.149, "speaker": "Cory"}, {"confidence": 0.94, "end": 335.913, "track": 0, "text": "Dealing with you know I like you said the web properties are dealing with scale issues.", "start": 331.052, "speaker": "Cory"}, {"confidence": 0.94, "end": 348.718, "track": 0, "text": "And frankly budget problems that nobody else was probably dealing with the time right but you didn't like you didn't just like this didn't know in the beginning it was at the beginning of your career like I do just graduated from school was at the Genesis for you.", "start": 335.937, "speaker": "Cory"}, {"confidence": 0.92, "end": 358.525, "track": 1, "text": "No I'm almost at already been doing stuff for 15 years by then I actually my first job was in Tillicum way back in the early 90s.", "newpara": true, "start": 348.731, "speaker": "Alan"}, {"confidence": 0.87, "end": 365.393, "track": 1, "text": "The by the mid-nineties I work for informix the database company.", "start": 358.664, "speaker": "Alan"}, {"confidence": 0.97, "end": 374.323, "track": 1, "text": "So and then I work for a couple startups that I'm sure you've never heard of cuz they went nowhere.", "start": 365.64, "speaker": "Alan"}, {"confidence": 0.95, "end": 380.146, "track": 1, "text": "And then both of which working inside database database stuff and then.", "start": 374.491, "speaker": "Alan"}, {"confidence": 0.8, "end": 386.329, "track": 1, "text": "I actually started at Yahoo for years Sportster doesn't do stuff not.", "start": 380.645, "speaker": "Alan"}, {"confidence": 0.9, "end": 395.691, "track": 1, "text": "You know nothing to do but in just internal database tools for Yahoo since they were building their own Hadoop was not Yahoo's First Take.", "start": 386.432, "speaker": "Alan"}, {"confidence": 0.94, "end": 403.184, "track": 1, "text": "And how to do all this stuff and even originally inside Yahoo dupe wasn't for the database stuff it was for.", "start": 395.998, "speaker": "Alan"}, {"confidence": 0.88, "end": 412.745, "track": 1, "text": "Your car the web search right they needed to rebuild the web search because I saw the web crawl just say what Yahoo would call the web.", "start": 403.936, "speaker": "Alan"}, {"confidence": 0.93, "end": 422.63, "track": 1, "text": "On a regular basis to build all its links and I don't I was not involved in the wave cross stuff so I'll probably get the numbers out wrong but it took something like a week.", "start": 413.562, "speaker": "Alan"}, {"confidence": 0.94, "end": 435.85, "track": 1, "text": "To do the crawl when Yahoo had its own proprietary crawler when they started rebuilding it on Hadoop they got it down to taking hours instead of days to get crawled on.", "start": 422.907, "speaker": "Alan"}, {"confidence": 0.94, "end": 440.387, "track": 1, "text": "Then it was after that they turn to it and said.", "start": 436.036, "speaker": "Alan"}, {"confidence": 0.92, "end": 452.405, "track": 1, "text": "Turn to the internal daily stuff that I was working in in and said well maybe a dude's the right solution here too since it's improved the web crawl so radically that's when I got involved.", "newpara": true, "start": 440.874, "speaker": "Alan"}, {"confidence": 0.95, "end": 465.096, "track": 0, "text": "Very cool now is your background you know you said earlier you're in California in the Silicon Valley are you are you one of these dudes it was like it involved in super cool stuff in college and was already part of,", "newpara": true, "start": 452.279, "speaker": "Cory"}, {"confidence": 0.93, "end": 471.057, "track": 0, "text": "like a board for Venture Capital firm on the west coast air like what was your what was your Genesis like in education.", "start": 464.904, "speaker": "Cory"}, {"confidence": 0.91, "end": 481.338, "track": 1, "text": "I'm so my undergrad degrees in math and my I have a masters in theology so yeah that fits me super welfare office database stuff.", "newpara": true, "start": 472.079, "speaker": "Alan"}, {"confidence": 0.79, "end": 484.86, "track": 0, "text": "I am sure it takes like you said it takes a lot of faith to.", "newpara": true, "start": 481.207, "speaker": "Cory"}, {"confidence": 0.91, "end": 497.076, "track": 1, "text": "There is some faith in Baltimore but no am I might have grads in math I got involved in software cuz you know I was out of school in the early nineties and didn't I,", "newpara": true, "start": 484.854, "speaker": "Alan"}, {"confidence": 0.88, "end": 505.465, "track": 1, "text": "I have been goofing around not my wife and I took some time worked in national parks and traveled around and then.", "start": 497.167, "speaker": "Alan"}, {"confidence": 0.93, "end": 510.074, "track": 1, "text": "Friend of mine said hey you know my company needs.", "start": 506.18, "speaker": "Alan"}, {"confidence": 0.9, "end": 519.43, "track": 1, "text": "He worked at this Telecom company is hardwood ad he said hey we need somebody to do tech support them like a shirt beats waiting tables which is what I was doing.", "start": 510.459, "speaker": "Alan"}, {"confidence": 0.93, "end": 527.302, "track": 1, "text": "So I got that's how I got started in software taught myself C and Unix and.", "start": 519.773, "speaker": "Alan"}, {"confidence": 0.92, "end": 535.804, "track": 1, "text": "Cuz I decided hate exports not a lot of fun you just answering the phone and I'm dealing with people's problems I'd rather be riding this software so I figured out how to do that.", "start": 527.494, "speaker": "Alan"}, {"confidence": 0.92, "end": 542.553, "track": 1, "text": "And moved into the engineering department then got hired by informix and that's how I got into database.", "start": 536.574, "speaker": "Alan"}, {"confidence": 0.93, "end": 556.38, "track": 1, "text": "I work so yeah I know I took a completely on Orthodox route that was all in Oregon actually I moved to Silicon Valley around the end of 2000 right at the end of The Boom Like kind of time that exactly.", "start": 542.95, "speaker": "Alan"}, {"confidence": 0.8, "end": 560.652, "track": 1, "text": "Yeah exactly it's alright.", "start": 556.897, "speaker": "Alan"}, {"confidence": 0.98, "end": 562.899, "track": 3, "text": "Buy Low sell High.", "newpara": true, "start": 557.69, "speaker": "Thomas"}, {"confidence": 0.92, "end": 575.699, "track": 1, "text": "Yeah I never quite got the hang of that I admit I always kind that backwards cuz I can always look at him go that's not going to work cuz I remember looking at all those web things are going to sell dog food or whatever I'm like,", "newpara": true, "start": 562.599, "speaker": "Alan"}, {"confidence": 0.91, "end": 584.574, "track": 1, "text": "make any money off of that what I missed was they that's true in the end but in the short-term was true in the long-term but not in the short-term and.", "start": 575.771, "speaker": "Alan"}, {"confidence": 0.91, "end": 589.291, "track": 1, "text": "So I looked at it backwards and then find it exactly wrong and lol whatever.", "start": 585.001, "speaker": "Alan"}, {"confidence": 0.89, "end": 600.48, "track": 3, "text": "So you spend some time you know working in the national park waiting tables didn't Benny did 15 years fast forward your Yahoo and so you're doing and you're on the hoodoo project and you said,", "newpara": true, "start": 588.991, "speaker": "Thomas"}, {"confidence": 0.9, "end": 609.247, "track": 3, "text": "are you at all just having fun but you really realize it's going to be such a big thing that you guys are building so what's the background on why do we have,", "start": 600.24, "speaker": "Thomas"}, {"confidence": 0.9, "end": 613.814, "track": 3, "text": "why do we have high but we have why do we need a zookeeper dummy did you guys I mean,", "start": 609.043, "speaker": "Thomas"}, {"confidence": 0.9, "end": 621.963, "track": 3, "text": "I'll talk to you a little bit last year at the Woodworks Roadshow and he was talking about how you know somebody at one point said no more naming these things.", "start": 613.628, "speaker": "Thomas"}, {"confidence": 0.92, "end": 630.327, "track": 3, "text": "You know after animals in an effort to keep her damn cuz he had to kind of do it with a mall where you guys just have to open drain to how you wanted to name this and why all the animals.", "start": 621.819, "speaker": "Thomas"}, {"confidence": 0.96, "end": 645.488, "track": 1, "text": "There's definitely some open rain so you know I don't even know the background behind all the animal names to be honest Pig came about I am told it was already called this by the time I got on the project but originally it was just called the language or something,", "newpara": true, "start": 631.259, "speaker": "Alan"}, {"confidence": 0.92, "end": 655.307, "track": 1, "text": "and one of the research scientist walked in one day and said we need a name and somebody else said we'll call it Pig and it suck you know end.", "start": 645.693, "speaker": "Alan"}, {"confidence": 0.93, "end": 669.002, "track": 1, "text": "So yeah partly it was just having fun and you can still see that right and I with our recent work to add MPP type support where they call it LOL AP which stands for live long and process so.", "start": 655.68, "speaker": "Alan"}, {"confidence": 0.81, "end": 669.572, "track": 3, "text": "Right.", "newpara": true, "start": 667.95, "speaker": "Thomas"}, {"confidence": 0.91, "end": 678.027, "track": 1, "text": "There's still that you know kind of wild when y'all this is I would tell people don't let your engineers name projects this is what you get.", "newpara": true, "start": 669.272, "speaker": "Alan"}, {"confidence": 0.94, "end": 688.441, "track": 1, "text": "There is kind of that but part of it too I would say and I think this is still partly what's going on there was a fair amount of experimentation Pig was a was a question of.", "start": 678.587, "speaker": "Alan"}, {"confidence": 0.99, "end": 690.73, "track": 1, "text": "Do we go back to sequel,", "start": 688.604, "speaker": "Alan"}, {"confidence": 0.92, "end": 701.42, "track": 1, "text": "the Wii is sequel the way and I was the you know was the answer of yes equals away Pig was let's try something else maybe scripting the right answer here maybe.", "start": 690.749, "speaker": "Alan"}, {"confidence": 0.93, "end": 714.346, "track": 1, "text": "Maybe people don't want to think about this only in a sequel leeway and I think one of the things that strong about Hadoop and the kids and I would say now the whole big day to ecosystem not just to do is you can.", "start": 701.577, "speaker": "Alan"}, {"confidence": 0.85, "end": 718.931, "track": 1, "text": "Deal with data in different ways the old school database world.", "start": 714.545, "speaker": "Alan"}, {"confidence": 0.91, "end": 727.127, "track": 1, "text": "There was Sequel and if you didn't like it well you should just get over there a 6 late there weren't a lot of options outside of sequel for you.", "start": 719.118, "speaker": "Alan"}, {"confidence": 0.92, "end": 738.899, "track": 1, "text": "I think one of the Beauties about dude in the Big Data world is if you don't like sequel you can use Pig you can use spark you can use Blink at your doing streaming while or even not streaming,", "start": 727.789, "speaker": "Alan"}, {"confidence": 0.95, "end": 747.889, "track": 1, "text": "you know if there is lots of different ways to look at and think about your data and I actually see that as a strength because different problems,", "start": 738.948, "speaker": "Alan"}, {"confidence": 0.9, "end": 750.052, "track": 1, "text": "really do better with different,", "start": 747.961, "speaker": "Alan"}, {"confidence": 0.96, "end": 764.131, "track": 1, "text": "tools and different people frankly just thinking different paradigms lots of people like sequel it's what they know it's what they use for many years and a lot of people look at sequin go yuck I hate that I don't think and relations I think of data flows and so.", "start": 749.866, "speaker": "Alan"}, {"confidence": 0.89, "end": 766.703, "track": 0, "text": "Yeah but was it was.", "newpara": true, "start": 765.436, "speaker": "Cory"}, {"confidence": 0.87, "end": 767.659, "track": 1, "text": "Air tool.", "newpara": true, "start": 766.403, "speaker": "Alan"}, {"confidence": 0.88, "end": 771.534, "track": 0, "text": "Was a sequel like that the ability to use sequel semantics.", "newpara": true, "start": 767.425, "speaker": "Cory"}, {"confidence": 0.96, "end": 783.985, "track": 0, "text": "With the underlying architecture that was to do to me that felt like one of the kind of the Tipping points in terms of adoption specifically in the Enterprise and more masculine option.", "start": 771.763, "speaker": "Cory"}, {"confidence": 0.88, "end": 789.898, "track": 0, "text": "But you said it financial services. Do you think that's true like that's equal capabilities.", "start": 783.841, "speaker": "Cory"}, {"confidence": 0.95, "end": 803.406, "track": 1, "text": "It's very true I call sequel the English of the data world everybody speaks it right and you may not speak it well if you may have a funny accent but you speak it right.", "newpara": true, "start": 790.097, "speaker": "Alan"}, {"confidence": 0.97, "end": 811.891, "track": 1, "text": "And I think that's what at first that's where I was at it had the funny accent because it was doing it on top of.", "start": 803.677, "speaker": "Alan"}, {"confidence": 0.93, "end": 823.693, "track": 1, "text": "Mapreduce right which was hard now we've gone underneath and rework all that so that it's not so that it's very natural it has has horse park underneath,", "start": 812.078, "speaker": "Alan"}, {"confidence": 0.81, "end": 830.027, "track": 1, "text": "now l a p which can execute those sequel queries in a much more.", "start": 823.651, "speaker": "Alan"}, {"confidence": 0.77, "end": 833.914, "track": 1, "text": "Can a natural fashion butt.", "start": 830.49, "speaker": "Alan"}, {"confidence": 0.96, "end": 844.52, "track": 1, "text": "So I agree it was very much the the Tipping Point but I would also say that that openness the other approaches has I think made.", "start": 834.612, "speaker": "Alan"}, {"confidence": 0.93, "end": 857.458, "track": 1, "text": "Big Data take off because people could do things like machine learning much more easily can you do machine learning and sequin tree can but you know it certainly wouldn't want to ask somebody to have to do.", "start": 844.815, "speaker": "Alan"}, {"confidence": 0.96, "end": 867.511, "track": 3, "text": "So if\nEnglish so it so it's equals the English version you know cuz everybody everybody speaks it to some extent so I guess everything in.", "newpara": true, "start": 857.843, "speaker": "Thomas"}, {"confidence": 0.88, "end": 872.817, "track": 3, "text": "And I do world and how do because system I guess job is kind of like Greeks all kind of derived from there.", "start": 867.47, "speaker": "Thomas"}, {"confidence": 0.91, "end": 885.388, "track": 3, "text": "So what where where we going at with that kind of talk about it a little bit and we had a episode I guess I think was episode 2 you can go back and check it out for our listeners but we we talked about you know when everybody puts out these list and.", "start": 872.685, "speaker": "Thomas"}, {"confidence": 0.91, "end": 896.024, "track": 3, "text": "You wanted one of the languages on there for the big day the world was you know Pig you know it's kind of going away but I mean we were day works I'm at this year you know in San Jose and I know Yahoo would converted all there.", "start": 885.262, "speaker": "Thomas"}, {"confidence": 0.88, "end": 904.725, "track": 3, "text": "You know a lot of their big jobs and majority of those over to Taz and then now I'm seeing support for Pig on spark I mean Pig still around pick still going right or is it.", "start": 895.91, "speaker": "Thomas"}, {"confidence": 0.83, "end": 906.883, "track": 1, "text": "Take is very much still around,", "newpara": true, "start": 904.425, "speaker": "Alan"}, {"confidence": 0.94, "end": 914.917, "track": 1, "text": "hives are sorry Yahoo still uses Pig extensively I know some other company still do in fact,", "start": 906.781, "speaker": "Alan"}, {"confidence": 0.91, "end": 922.861, "track": 1, "text": "we ask ourselves at hortonworks we asking you know do we still need to support Pagan hdp version 3 when it comes out.", "start": 914.785, "speaker": "Alan"}, {"confidence": 0.94, "end": 930.222, "track": 1, "text": "And the answer from our user base came back over sounding yes like plenty of people used it,", "start": 923.402, "speaker": "Alan"}, {"confidence": 0.95, "end": 940.107, "track": 1, "text": "they definitely still want us to support it it's not growing a lot it's not adding a lot of new features it kind of does what it does and people are happy with it,", "start": 930.276, "speaker": "Alan"}, {"confidence": 0.77, "end": 943.724, "track": 1, "text": "but there is definitely still a strong base out there.", "start": 940.137, "speaker": "Alan"}, {"confidence": 0.71, "end": 946.597, "track": 3, "text": "Somewhere there,", "newpara": true, "start": 944.866, "speaker": "Thomas"}, {"confidence": 0.94, "end": 956.974, "track": 3, "text": "talk a little bit about Pig but let's shift over and talk a little bit about the dupe so we've talked about you know some of the shift and some of the different ways that we can do it so you can you know I have your pink jobs words in,", "start": 946.801, "speaker": "Thomas"}, {"confidence": 0.95, "end": 973.866, "track": 3, "text": "Jazwares in mapreduce what's where's the community now specifically to head Dubai me we see a lot of people that you know the kind of taking a dupe and they don't talk about it as much everything about spark kind of where is a community leader do you kind of see that going as far as to dupe and meet us a dupe still remain player.", "start": 956.782, "speaker": "Thomas"}, {"confidence": 0.78, "end": 978.18, "track": 1, "text": "I would definitely say hey dude so mean still a big player.", "newpara": true, "start": 973.866, "speaker": "Alan"}, {"confidence": 0.93, "end": 988.191, "track": 1, "text": "I would say I see several shifts kind of going on in different dimensions one is dupe itself is expanding.", "start": 978.589, "speaker": "Alan"}, {"confidence": 0.95, "end": 999.933, "track": 1, "text": "There's been a lot of work on the hdfs side to add an object store so that for people who want to thinking that objects or Paradigm they can do so.", "start": 988.456, "speaker": "Alan"}, {"confidence": 0.95, "end": 1010.593, "track": 1, "text": "It also actually makes hdfs more scalable in some ways there's on the yarn side they've been doing a lot of work to add container support so that people can run.", "start": 1000.45, "speaker": "Alan"}, {"confidence": 0.98, "end": 1013.057, "track": 1, "text": "General Docker containers on top of.", "start": 1010.762, "speaker": "Alan"}, {"confidence": 0.9, "end": 1026.962, "track": 1, "text": "Yarn cuz once you got all your data someplace it's really nice feel to run all your apps on there not just the ones that are hit each specific and then obviously the big question there is the cloud what what happens when you go into the cloud.", "start": 1013.262, "speaker": "Alan"}, {"confidence": 0.95, "end": 1035.104, "track": 1, "text": "And I would say there's several things one people still want to run Hive and Spark and,", "start": 1027.185, "speaker": "Alan"}, {"confidence": 0.85, "end": 1038.613, "track": 1, "text": "Summit Lakes Park and run natively on the cloud hive,", "start": 1035.141, "speaker": "Alan"}, {"confidence": 0.92, "end": 1051.088, "track": 1, "text": "runs by using still the hdfs API so even though it's in the cloud it's still thinking about us to do so there's still some of it up there and see if ya later even if it's not the execution.", "start": 1038.68, "speaker": "Alan"}, {"confidence": 0.95, "end": 1055.277, "track": 1, "text": "But the bigger thing we're finding with our customers here at work works is.", "start": 1051.233, "speaker": "Alan"}, {"confidence": 0.93, "end": 1062.632, "track": 1, "text": "Everybody's doing something in the clouds but everybody still has stuff on premise right it's really a mixed world so.", "start": 1055.752, "speaker": "Alan"}, {"confidence": 0.83, "end": 1070.119, "track": 1, "text": "Is there going to be a new phone the cloud yeah is there going to be sleep on promise yes definitely for seeing them both places.", "start": 1062.831, "speaker": "Alan"}, {"confidence": 0.91, "end": 1073.22, "track": 0, "text": "So when you say cloud are you are you seeing.", "newpara": true, "start": 1070.011, "speaker": "Cory"}, {"confidence": 0.92, "end": 1090.027, "track": 0, "text": "I mean obviously we know each day AWS was going to the leader in that space for many years but in the Big Data space we've seen a number of other like entrance and that the other big tubing for Microsoft and then I also obviously the Google Cloud platform are you seeing.", "start": 1073.394, "speaker": "Cory"}, {"confidence": 0.9, "end": 1097.364, "track": 0, "text": "Trends One Cloud versus the other sort of winning in your accounts are in the you know as a as a macro in the community.", "start": 1090.154, "speaker": "Cory"}, {"confidence": 0.95, "end": 1110.626, "track": 1, "text": "It's really Regional here in the US you know we see some of each but AWS is definitely the 800-pound gorilla right as you get outside the US.", "newpara": true, "start": 1097.773, "speaker": "Alan"}, {"confidence": 0.72, "end": 1115.361, "track": 1, "text": "Starts the Balance album or we see more Microsoft.", "start": 1110.825, "speaker": "Alan"}, {"confidence": 0.82, "end": 1123.594, "track": 1, "text": "You know there's still plenty of Amazon but we we start seeing more of a sure especially in Europe in Canada and.", "start": 1115.842, "speaker": "Alan"}, {"confidence": 0.92, "end": 1135.383, "track": 1, "text": "Then you get to Asia and that becomes a whole different set of players cuz there's a lot of local players there in the cloud and it's it's a lot of your pictures you'll forgive then,", "start": 1123.871, "speaker": "Alan"}, {"confidence": 0.92, "end": 1141.224, "track": 1, "text": "sad pain but I mean there's lots of different clouds there it's not quite the big three that were used to hear.", "start": 1135.456, "speaker": "Alan"}, {"confidence": 0.97, "end": 1143.219, "track": 0, "text": "So what are the,", "newpara": true, "start": 1140.924, "speaker": "Cory"}, {"confidence": 0.88, "end": 1156.301, "track": 0, "text": "you know at the community level and even if the world Works level what are you seeing as some of the developments that that are required for organizations in 4 platforms like you know HD p&n others from the horse family in frankly in the community,", "start": 1143.022, "speaker": "Cory"}, {"confidence": 0.94, "end": 1160.081, "track": 0, "text": "what are the big sort of developments that have to happen.", "start": 1156.374, "speaker": "Cory"}, {"confidence": 0.94, "end": 1174.563, "track": 0, "text": "To enable this multi-cloud world because we we know I think you know and that if you're a hardware seller right cloud is a bad idea but it's kind of a good idea cuz you're an arms dealer to them but but if we know like Enterprise is there still going to do the majority of their.", "start": 1159.955, "speaker": "Cory"}, {"confidence": 0.92, "end": 1185.884, "track": 0, "text": "Y'all Russian said always but in general we see a large majority of applications data being on premises what are the big things that that you and your team have to do to.", "start": 1174.461, "speaker": "Cory"}, {"confidence": 0.94, "end": 1189.465, "track": 0, "text": "To make your platform relevant in this multi-cloud world.", "start": 1185.992, "speaker": "Cory"}, {"confidence": 0.97, "end": 1197.439, "track": 1, "text": "I think the things we have to do our users don't want to think about where the data is Right mean.", "newpara": true, "start": 1189.94, "speaker": "Alan"}, {"confidence": 0.95, "end": 1210.821, "track": 1, "text": "Think about it from an IT perspective for a moment you want it you're going to have some date on Kramer going to have some on the cloud you don't want it all in one Cloud cuz you don't want to be Hostage to whichever Cloud if they decide to double their rates are.", "start": 1197.548, "speaker": "Alan"}, {"confidence": 0.99, "end": 1212.69, "track": 1, "text": "Whatever right,", "start": 1211.14, "speaker": "Alan"}, {"confidence": 0.93, "end": 1222.821, "track": 1, "text": "and so you're going to spread it around and you're going to be forced by if you're at a big company remedyforce by legal requirements to spread it around anyway cuz even if it's all in the same Cloud if you put it in,", "start": 1212.631, "speaker": "Alan"}, {"confidence": 0.89, "end": 1227.707, "track": 1, "text": "you know if you start some in Germany and start some of us you probably can't mix those streams and.", "start": 1222.618, "speaker": "Alan"}, {"confidence": 0.96, "end": 1232.652, "track": 1, "text": "And all kinds of stuff right so from an IT perspective you're going to have it spread around like you said.", "start": 1228.284, "speaker": "Alan"}, {"confidence": 0.91, "end": 1244.07, "track": 1, "text": "From an end-user perspective I don't want to have to think about that I don't want to have to think about oh that day to that lives in AWS in Germany but this other one lives in as you're in Arkansas.", "start": 1232.767, "speaker": "Alan"}, {"confidence": 0.93, "end": 1253.852, "track": 1, "text": "I just want to go get my data and I want to hear. And govern it and make sure it's secure whatever my job is.", "start": 1244.533, "speaker": "Alan"}, {"confidence": 0.95, "end": 1262.626, "track": 1, "text": "I want to do that so what I think we need to do as a company is make sure we are giving people the tools in Iraq.", "start": 1253.961, "speaker": "Alan"}, {"confidence": 0.92, "end": 1274.229, "track": 1, "text": "Across those systems right is there one paint if you're the security guy is there one pane of glass that you can go to and make sure the security policies are right for all your data sets regardless of where they're living.", "start": 1262.824, "speaker": "Alan"}, {"confidence": 0.91, "end": 1282.972, "track": 1, "text": "If you are an analyst and you need to get to those data sets that you may have to be a little bit of wear that because there may be rules against joining across.", "start": 1274.356, "speaker": "Alan"}, {"confidence": 0.93, "end": 1287.828, "track": 1, "text": "National boundaries or there may just be the laws of physics that say you know moving.", "newpara": true, "start": 1283.508, "speaker": "Alan"}, {"confidence": 0.95, "end": 1293.855, "track": 1, "text": "Terabytes cross-links under the ocean doesn't work out so well so you may have to,", "start": 1288.044, "speaker": "Alan"}, {"confidence": 0.91, "end": 1303.247, "track": 1, "text": "be at least a little wear but you'd still like to be able to say okay I'm at my laptop I can just go find where the date of said is I need to do my work on that I can go there and clear yet.", "start": 1293.951, "speaker": "Alan"}, {"confidence": 0.97, "end": 1309.466, "track": 1, "text": "I don't have to worry about myself knowing that are going to some.", "start": 1303.434, "speaker": "Alan"}, {"confidence": 0.94, "end": 1319.766, "track": 1, "text": "Big long search page somewhere that tells me where everything is it it's that building those tools to make that a smooth experience for the users of things going to be key for us.", "start": 1309.785, "speaker": "Alan"}, {"confidence": 0.93, "end": 1333.851, "track": 0, "text": "So what is hortonworks is there any particular products that are that have been announcer easily her that you guys are going to maybe have some cool code names for them that help bring that together probably an animal if I had to guess.", "newpara": true, "start": 1319.466, "speaker": "Cory"}, {"confidence": 0.93, "end": 1345.659, "track": 1, "text": "It's not an animal actually this is cuz the the marketers name this one instead of the engineers so there is one it's called Data playing and the idea of here is this is the kind of.", "newpara": true, "start": 1333.551, "speaker": "Alan"}, {"confidence": 0.9, "end": 1353.639, "track": 1, "text": "The piece that sits there unless you manage all the different parts and so far it's just released version 1.", "start": 1345.888, "speaker": "Alan"}, {"confidence": 0.94, "end": 1367.424, "track": 1, "text": "In October I believe it was so far it's supports replication of data so if you need to move your data between clusters that will eventually be more sophisticated and allow,", "start": 1353.784, "speaker": "Alan"}, {"confidence": 0.93, "end": 1377.405, "track": 1, "text": "reputation from cluster the cloud and between clouds and such it will be adding in the governance and security pieces and eventually then the,", "start": 1367.484, "speaker": "Alan"}, {"confidence": 0.89, "end": 1384.928, "track": 1, "text": "no babe the stuff to help users find and query their data so they can get all that but it is.", "start": 1377.453, "speaker": "Alan"}, {"confidence": 0.93, "end": 1393.443, "track": 1, "text": "Kind of where we were pushing customers to say here's or not pushing sorry that's the wrong word but giving the customers here's.", "start": 1385.494, "speaker": "Alan"}, {"confidence": 0.88, "end": 1402.679, "track": 1, "text": "If you need to manage all the stuff if you have more than one cluster or data in on Prime in in the cloud here is how we're going to help you.", "start": 1393.648, "speaker": "Alan"}, {"confidence": 0.79, "end": 1406.038, "track": 1, "text": "Facebook you track of all that and and gets all of it.", "start": 1402.884, "speaker": "Alan"}, {"confidence": 0.94, "end": 1419.703, "track": 3, "text": "Did that come about also for streaming analytics and iot and then you have data in about at the edge sometimes and yep you know more more devices that are coming online are you is that where you guys Percy date of playing playing as well.", "newpara": true, "start": 1406.946, "speaker": "Thomas"}, {"confidence": 0.94, "end": 1430.729, "track": 1, "text": "Yeah we do it it's going to be across all your data assets right again you don't want to have to think about oh that date is out on the Edge versus it's in this cluster you just want to do your job.", "newpara": true, "start": 1419.403, "speaker": "Alan"}, {"confidence": 0.95, "end": 1437.73, "track": 1, "text": "Now some of that it's going to have to be somewhat aware of the edginess of things right if it's actually coming out of your car,", "start": 1430.886, "speaker": "Alan"}, {"confidence": 0.95, "end": 1446.191, "track": 1, "text": "your car might not be connected right at the moment so there has to be some awareness but again we want to integrate all that and give people that.", "start": 1437.754, "speaker": "Alan"}, {"confidence": 0.88, "end": 1449.388, "track": 1, "text": "Kind of single single view of things.", "start": 1446.618, "speaker": "Alan"}, {"confidence": 0.82, "end": 1463.118, "track": 0, "text": "So sorry imagine cars and Edge processing the the automated there there since you're the automatic autonomous Car Projects in the big factures in the traditional ones but in the the web.", "newpara": true, "start": 1449.166, "speaker": "Cory"}, {"confidence": 0.86, "end": 1470.672, "track": 0, "text": "The properties that you sent for the end of the beginning places where Big Data started some really interesting challenges on that edge.", "start": 1463.101, "speaker": "Cory"}, {"confidence": 0.95, "end": 1477.186, "track": 0, "text": "Sort of space that I think you know obviously did a plane sort of relevant but are there any big.", "start": 1470.822, "speaker": "Cory"}, {"confidence": 0.78, "end": 1483.886, "track": 0, "text": "Kind of technology advancements you're seeing happened in the community with a no DPI or others that.", "start": 1477.09, "speaker": "Cory"}, {"confidence": 0.86, "end": 1489.3, "track": 0, "text": "But I've been just purely based on and come out of that autonomous vehicles or the trend Racine.", "start": 1483.79, "speaker": "Cory"}, {"confidence": 0.94, "end": 1502.544, "track": 1, "text": "You know I don't know I'm not close enough to that part of it too I've seen what's going on I mean I know a little bit of what's going on there in terms of stairs challenges.", "newpara": true, "start": 1489.757, "speaker": "Alan"}, {"confidence": 0.98, "end": 1508.439, "track": 1, "text": "You know how much the big challenges are around I generate tons and tons of data.", "start": 1502.748, "speaker": "Alan"}, {"confidence": 0.95, "end": 1523.329, "track": 1, "text": "But my Uplink isn't very big what should I send what should I not send what do I keep for later what's important and even how do I do feedback like let me shift the use case a little bit cuz it's a little more extreme but a similar idea.", "start": 1508.589, "speaker": "Alan"}, {"confidence": 0.94, "end": 1537.126, "track": 1, "text": "You getting these jet engines they produce I like on an airplane I don't remember how much it is but it comes per hour but it comes out to a transoceanic flight you can end up generating a couple terabytes worth of data out of that engine.", "start": 1523.606, "speaker": "Alan"}, {"confidence": 0.95, "end": 1550.033, "track": 1, "text": "Obviously you can't upload all that when you're in the air while you're flying you don't have enough space on the satellite link and even when you're on the ground you're not always plugged in long enough to get it all downloading.", "start": 1538.22, "speaker": "Alan"}, {"confidence": 0.93, "end": 1555.982, "track": 1, "text": "So what do you send what do you keep and what do you like say you know.", "start": 1550.575, "speaker": "Alan"}, {"confidence": 0.94, "end": 1570.38, "track": 1, "text": "All that data is just saying engine running normally you probably don't need to send it all but what if one part of the engine is getting a little warmer than it should be does that flip some switch somewhere that says okay now send more data about that particular.", "start": 1556.097, "speaker": "Alan"}, {"confidence": 0.96, "end": 1577.128, "track": 1, "text": "Subsystem because it's heating up do we need to do something\nthose are the kinds of.", "start": 1570.549, "speaker": "Alan"}, {"confidence": 0.93, "end": 1587.344, "track": 1, "text": "Questions that I know they're asking in that space But I I'm not really in-depth knowledgeable on how they're attacking that or or all the changes that are going on now.", "start": 1577.616, "speaker": "Alan"}, {"confidence": 0.87, "end": 1595.522, "track": 0, "text": "No worries the it's funny we've said Hadoop a handful of times in this in this conversation but,", "newpara": true, "start": 1587.044, "speaker": "Cory"}, {"confidence": 0.92, "end": 1604.944, "track": 0, "text": "I find it astonishing how the words are the debrand Hadoop or that name has just absolutely been shuttered by.", "start": 1595.288, "speaker": "Cory"}, {"confidence": 0.94, "end": 1610.641, "track": 0, "text": "A lot of folks in this in this ecosystem in this community why is that why do we say Hadoop anymore.", "start": 1604.969, "speaker": "Cory"}, {"confidence": 0.97, "end": 1618.927, "track": 1, "text": "I don't know I'm not\nI don't know if it's a way to.", "newpara": true, "start": 1611.399, "speaker": "Alan"}, {"confidence": 0.94, "end": 1631.967, "track": 1, "text": "I can think of two reasons and I don't honestly know if either of them are true one is just you know it sounds a little bit Kitty right I do been Pagan olap and all these like as we talked about earlier kind of.", "start": 1619.697, "speaker": "Alan"}, {"confidence": 0.92, "end": 1644.286, "track": 1, "text": "A little bit you know the engine somebody let the engineers play and name all the products does it sound more professional if you can talk about you know ate a plane instead of I do maybe.", "start": 1632.683, "speaker": "Alan"}, {"confidence": 0.92, "end": 1650.776, "track": 1, "text": "Part of it too I think some companies at least really want to.", "start": 1644.581, "speaker": "Alan"}, {"confidence": 0.92, "end": 1661.724, "track": 1, "text": "Talk about what how they're differentiating on top of it since the deep is open-source since there is multiple places to get it so way to talk about it.", "start": 1651.191, "speaker": "Alan"}, {"confidence": 0.95, "end": 1668.214, "track": 1, "text": "Probably actually the the real answer now is as as a technology spreads out.", "start": 1661.839, "speaker": "Alan"}, {"confidence": 0.94, "end": 1674.601, "track": 1, "text": "It's becoming less and less about the technology and more about more about the use cases it's all right.", "start": 1668.455, "speaker": "Alan"}, {"confidence": 0.97, "end": 1680.634, "track": 1, "text": "When was the last time you saw an ad for just oracle's database server.", "start": 1675.371, "speaker": "Alan"}, {"confidence": 0.96, "end": 1693.374, "track": 1, "text": "Probably see it song but a lot more common now is to see ads for all the apps that you can run on top of it right they can do HR programs and they can do your P programs and all these other things.", "start": 1680.911, "speaker": "Alan"}, {"confidence": 0.99, "end": 1694.594, "track": 1, "text": "Because.", "start": 1693.711, "speaker": "Alan"}, {"confidence": 0.9, "end": 1705.927, "track": 1, "text": "They're trying to connect with people that want to that have specific problems to solve their not in a silly Engineers that one particular technology I suspect we're probably.", "start": 1695.628, "speaker": "Alan"}, {"confidence": 0.98, "end": 1709.298, "track": 1, "text": "Maturing into that same space where people.", "newpara": true, "start": 1706.42, "speaker": "Alan"}, {"confidence": 0.94, "end": 1718.678, "track": 1, "text": "Are connecting with customers who have a problem to solve rather than with Engineers who were like who we know this is the latest coolest technology.", "newpara": true, "start": 1710.572, "speaker": "Alan"}, {"confidence": 0.93, "end": 1727.8, "track": 3, "text": "So you talk about how you start off in Pig and you're involved in the hive project are there any other open source projects that you're part of and that you're involved with in the community.", "newpara": true, "start": 1718.42, "speaker": "Thomas"}, {"confidence": 0.93, "end": 1737.366, "track": 1, "text": "Sort of so one of my rolls since I've been in Apache for a while now as I help Mentor new projects when they come into the incubator.", "newpara": true, "start": 1727.5, "speaker": "Alan"}, {"confidence": 0.9, "end": 1747.594, "track": 1, "text": "So I have been a mentor to many many projects playing who's the big top.", "start": 1737.655, "speaker": "Alan"}, {"confidence": 0.92, "end": 1760.044, "track": 1, "text": "A bunch calcified many more but I can't think of and wouldn't remember the names of and that doesn't mean I wrote code on those most of those I've never written the line of code that's about helping them.", "start": 1748.658, "speaker": "Alan"}, {"confidence": 0.95, "end": 1766.931, "track": 1, "text": "Learn the patchy way right when they come in and some of those are brand-new projects that need to.", "start": 1760.279, "speaker": "Alan"}, {"confidence": 0.94, "end": 1772.976, "track": 1, "text": "Get going from the ground up some are already existing projects but they're becoming Apache and they have to learn.", "start": 1767.13, "speaker": "Alan"}, {"confidence": 0.93, "end": 1784.369, "track": 1, "text": "Are the Apache way and how we do things so in that sense I've been involved in a number project side I'm still on their mailing lists and often still and you know a member of the.", "start": 1773.103, "speaker": "Alan"}, {"confidence": 0.91, "end": 1792.271, "track": 1, "text": "The PNC on this project but as far as actually truly contributing code the vast majority of my work spending Pagan High.", "start": 1784.496, "speaker": "Alan"}, {"confidence": 0.87, "end": 1798.959, "track": 0, "text": "So the I want to come back to contributing code because I have a question where there about the Apache community.", "newpara": true, "start": 1792.061, "speaker": "Cory"}, {"confidence": 0.92, "end": 1811.957, "track": 0, "text": "How is it evolved over time cuz obviously some of the projects that you were involved in early on in terms of their development and they're not going to their release into the open source I'm sure Apache was a a different communities then.", "start": 1798.966, "speaker": "Cory"}, {"confidence": 0.92, "end": 1818.987, "track": 0, "text": "That it is that it is now and what what's the what are those changes what's what's different about what it means to be the Apache way.", "newpara": true, "start": 1812.192, "speaker": "Cory"}, {"confidence": 0.98, "end": 1824.997, "track": 1, "text": "Well I would say the big difference that I.", "newpara": true, "start": 1820.232, "speaker": "Alan"}, {"confidence": 0.95, "end": 1836.137, "track": 1, "text": "She is just really size and volume right Apache is really continue to grow especially on the big data side you know when.", "start": 1825.436, "speaker": "Alan"}, {"confidence": 0.91, "end": 1846.052, "track": 1, "text": "At least when I got started with pig we were the second or third Big Data project we didn't even use the word big data back then but what you would Now call Big Data.", "start": 1836.432, "speaker": "Alan"}, {"confidence": 0.93, "end": 1857.295, "track": 1, "text": "And so honestly a lot of the people in Apache didn't really know what we were about cuz they were all from her most of them were from the HTTP Dior Tomcat side and they were thinking more about,", "start": 1846.575, "speaker": "Alan"}, {"confidence": 0.86, "end": 1865.54, "track": 1, "text": "Java servlets and those kinds of things and they were about\ndistributed file systems or whatever.", "start": 1857.32, "speaker": "Alan"}, {"confidence": 0.83, "end": 1868.232, "track": 0, "text": "Look for those are expensive.", "newpara": true, "start": 1865.414, "speaker": "Cory"}, {"confidence": 0.94, "end": 1881.716, "track": 0, "text": "Yes I heard on flank like that is that is that project going to be as big a deal overtime as like the early Buzz was.", "newpara": true, "start": 1869.542, "speaker": "Cory"}, {"confidence": 0.94, "end": 1887.831, "track": 1, "text": "Well if I could tell the future.", "newpara": true, "start": 1883.333, "speaker": "Alan"}, {"confidence": 0.94, "end": 1889.864, "track": 0, "text": "Come on that's why you're here that's how you got to where you are.", "newpara": true, "start": 1887.581, "speaker": "Cory"}, {"confidence": 0.91, "end": 1895.753, "track": 3, "text": "Yeah but we already established the the buying High selling low.", "newpara": true, "start": 1889.943, "speaker": "Thomas"}, {"confidence": 0.87, "end": 1898.518, "track": 0, "text": "So I'm looking for the the anathema of what he's doing.", "newpara": true, "start": 1895.658, "speaker": "Cory"}, {"confidence": 0.91, "end": 1908.12, "track": 1, "text": "Here's what I would say I I think that link has a really great model when it comes to stream processing.", "newpara": true, "start": 1899.239, "speaker": "Alan"}, {"confidence": 0.94, "end": 1917.272, "track": 1, "text": "And I think the interest there is how they can do truly you know not batch not micro batch but.", "start": 1908.283, "speaker": "Alan"}, {"confidence": 0.89, "end": 1920.679, "track": 1, "text": "Down to the record stream processing and handling.", "start": 1917.591, "speaker": "Alan"}, {"confidence": 0.97, "end": 1931.261, "track": 1, "text": "How big is the market or interest for that that's where I don't know the answer well but from a technology perspective I think it's really interesting technology.", "start": 1920.956, "speaker": "Alan"}, {"confidence": 0.94, "end": 1943.141, "track": 0, "text": "Now it's like anything you just said that the use cases seem to be driving more adoption anything else I guess I think from in your seat as a as a guy who's been a yeah really.", "newpara": true, "start": 1930.961, "speaker": "Cory"}, {"confidence": 0.89, "end": 1954.702, "track": 0, "text": "Kind of in a pivotal role of the the early stages of big data in the technologies have you are like what are you and the community doing two shifts to that use case sort of lens.", "start": 1943.231, "speaker": "Cory"}, {"confidence": 0.72, "end": 1958.308, "track": 0, "text": "To grow your relevance and grow your auntie or your adoption.", "start": 1954.847, "speaker": "Cory"}, {"confidence": 0.96, "end": 1967.622, "track": 1, "text": "I would say the big thing is we're trying to spend more time out with the users and try to figure out a what.", "newpara": true, "start": 1958.855, "speaker": "Alan"}, {"confidence": 0.97, "end": 1975.049, "track": 1, "text": "What exactly\nare you going to do with this technology right cuz honestly early on.", "start": 1968.464, "speaker": "Alan"}, {"confidence": 0.94, "end": 1983.444, "track": 1, "text": "Hadoop was here's a cool tool now go find some problems help with it right or.", "start": 1975.38, "speaker": "Alan"}, {"confidence": 0.95, "end": 1991.424, "track": 1, "text": "You know it was Engineers who already knew they had a big problem and knew they couldn't solve it any other way so let's use to do and.", "start": 1983.751, "speaker": "Alan"}, {"confidence": 0.94, "end": 2000.786, "track": 1, "text": "They said you do now have to meet people where they're at and say hey look we built this database state of warehousing solution,", "start": 1991.574, "speaker": "Alan"}, {"confidence": 0.93, "end": 2005.154, "track": 1, "text": "on top of the dude we think I can solve your problem for you and here's how,", "start": 2000.732, "speaker": "Alan"}, {"confidence": 0.92, "end": 2017.293, "track": 1, "text": "so we're we're really out there trying to figure out exactly what it is you're looking at in and really our best feedback there is our existing customers cuz you soon as you give them something there you know there clamoring for something they're like.", "start": 2005.035, "speaker": "Alan"}, {"confidence": 0.94, "end": 2031.498, "track": 1, "text": "We used to do just ETL And Hive now we do all our reporting an eye but I can't hook my cubing engines up to it cuz it doesn't respond to those categories fast enough so why not right so then we're like oh well I guess we should go make it work for,", "start": 2017.816, "speaker": "Alan"}, {"confidence": 0.89, "end": 2039.442, "track": 1, "text": "those cheating type query so we'll work on that it is getting that feedback from them where are they not happy.", "start": 2031.511, "speaker": "Alan"}, {"confidence": 0.88, "end": 2047.963, "track": 1, "text": "If you're at your customers are either complaining at you or they're not using your stuff so if you got to listen to those complaints and see where they're trying to drive it.", "start": 2039.737, "speaker": "Alan"}, {"confidence": 0.94, "end": 2059.428, "track": 3, "text": "Are you able to take those complaints and take those you know optimizations are opportunities back into the community so with it with your roll at you know helping incubate Newell projects in Apache.", "newpara": true, "start": 2048.492, "speaker": "Thomas"}, {"confidence": 0.93, "end": 2072.636, "track": 1, "text": "Definitely mean sometimes it's been launching new project sometimes it's just adding things to existing project sometimes it's figuring out how to make projects work together cuz you realize I have two piece,", "newpara": true, "start": 2059.501, "speaker": "Alan"}, {"confidence": 0.94, "end": 2080.472, "track": 1, "text": "two projects have half which and eating all I have to do is figure out how to hook them up and we can solve this problem.", "start": 2072.727, "speaker": "Alan"}, {"confidence": 0.94, "end": 2089.954, "track": 1, "text": "But yeah I definitely get a lot of chance that well not just me our whole company I I don't not alone at all in that.", "start": 2080.737, "speaker": "Alan"}, {"confidence": 0.87, "end": 2091.048, "track": 0, "text": "There's only like for it that's.", "newpara": true, "start": 2089.654, "speaker": "Cory"}, {"confidence": 0.9, "end": 2097.922, "track": 3, "text": "Now you can you can tell us yeah you can tell if my new you're running the show man this is the way we live right.", "newpara": true, "start": 2090.856, "speaker": "Thomas"}, {"confidence": 0.82, "end": 2103.577, "track": 0, "text": "That's a 4-person shell for four digit of dogs I know.", "newpara": true, "start": 2097.622, "speaker": "Cory"}, {"confidence": 0.92, "end": 2116.947, "track": 0, "text": "Organ works is a big place and the Apache Community is a is a big place but it's it's still very much a technical community are you still are you still getting Hands-On on a weekly basis.", "start": 2103.463, "speaker": "Cory"}, {"confidence": 0.95, "end": 2125.804, "track": 1, "text": "I do so\nit really varies kind of from time and place are times when.", "newpara": true, "start": 2117.537, "speaker": "Alan"}, {"confidence": 0.94, "end": 2135.852, "track": 1, "text": "I'm getting the right code one-day-a-week there's times when I'm doing it for days a week right now I'm in kind of in a 4 days a week mode which actually makes me really happy I.", "start": 2126.039, "speaker": "Alan"}, {"confidence": 0.88, "end": 2141.031, "track": 1, "text": "I really am an engineer top to bottom but.", "start": 2135.996, "speaker": "Alan"}, {"confidence": 0.91, "end": 2156.409, "track": 1, "text": "They are you know what I find that one I want to stay very connected just cuz I like doing it but also pretty soon you don't know what you're talking about if you don't if you're not in a day today right you can.", "start": 2141.825, "speaker": "Alan"}, {"confidence": 0.92, "end": 2165.705, "track": 1, "text": "Resent the slides and you can talk at a high level but somebody ask you a question and if the next level down and you just don't know and the only way to.", "start": 2157.088, "speaker": "Alan"}, {"confidence": 0.86, "end": 2169.539, "track": 1, "text": "I know is to really be a part of it everyday.", "start": 2166.144, "speaker": "Alan"}, {"confidence": 0.93, "end": 2184.627, "track": 1, "text": "And\nalso I think when you when you help start a company you have to figure out what are you good at and the reality is I'm not a business guy and I'm not a manager I'm good at helping build this stuff so that's what I do.", "start": 2170.056, "speaker": "Alan"}, {"confidence": 0.92, "end": 2189.621, "track": 0, "text": "What's funny I always tell ya I've had the chance to Mentor.", "newpara": true, "start": 2184.327, "speaker": "Cory"}, {"confidence": 0.9, "end": 2200.461, "track": 0, "text": "Systems engineers and bookstore, technical pre-sales rolls and capacities of a drive technology adoption right but one is always telling his man you gotta stay Hands-On like you got a car value.", "start": 2189.645, "speaker": "Cory"}, {"confidence": 0.94, "end": 2205.262, "track": 0, "text": "That that time I'd love to hear that you're still doing that even you know I think.", "newpara": true, "start": 2200.75, "speaker": "Cory"}, {"confidence": 0.94, "end": 2219.78, "track": 0, "text": "Most of us have been in and around this community when we hear names like yours out there like they must just be like flying around hanging out cool customers like just being awesome all the time but you're actually doing the fun stuff that you love it it's that you enjoy doing that,", "start": 2205.365, "speaker": "Cory"}, {"confidence": 0.9, "end": 2228.53, "track": 0, "text": "I think is this all it's okay for us to continue to be nerds does that mean like a little pudgy.", "start": 2219.985, "speaker": "Cory"}, {"confidence": 0.93, "end": 2231.486, "track": 0, "text": "Definitely have a beard probably in Mountain Dew somewhere nearby.", "start": 2228.428, "speaker": "Cory"}, {"confidence": 0.9, "end": 2235.246, "track": 1, "text": "Well I'm not touching I actually.", "newpara": true, "start": 2232.033, "speaker": "Alan"}, {"confidence": 0.81, "end": 2237.85, "track": 0, "text": "Abu.", "newpara": true, "start": 2234.996, "speaker": "Cory"}, {"confidence": 0.92, "end": 2245.896, "track": 1, "text": "I enjoy running in my spare time so that times to discourage the way you definitely have well Diet Mountain Dew now I'm not.", "newpara": true, "start": 2236.584, "speaker": "Alan"}, {"confidence": 0.93, "end": 2251.326, "track": 1, "text": "You know I tried to grow a beard off and on but it just doesn't.", "newpara": true, "start": 2247.915, "speaker": "Alan"}, {"confidence": 0.95, "end": 2255.036, "track": 0, "text": "That's alright we have.", "newpara": true, "start": 2253.372, "speaker": "Cory"}, {"confidence": 0.93, "end": 2266.483, "track": 0, "text": "Where to have a new sponsor of our of our podcast in that they're they're awesome they're called beardski so next time you need to go hit the mountains get you a beard ski there these really leaves really red masks.", "start": 2255.054, "speaker": "Cory"}, {"confidence": 0.94, "end": 2275.502, "track": 0, "text": "That look like beards and they are officially a sponsor of RCL and their sponsor if I should only because I had to figure out a way to get some of the dudes that don't have.", "start": 2266.393, "speaker": "Cory"}, {"confidence": 0.86, "end": 2278.345, "track": 0, "text": "Beards won't grow them.", "start": 2275.539, "speaker": "Cory"}, {"confidence": 0.93, "end": 2292.31, "track": 0, "text": "Committed enough I had to get away to get them a good beard so we partnered up with. Ski.com to to get us some to get us some beard so that's it that's awesome that you're still are you going to need a big guy.", "start": 2278.363, "speaker": "Cory"}, {"confidence": 0.96, "end": 2298.12, "track": 0, "text": "The big conferences this year like the data Works conferences and if so are you going to be presenting anything there.", "start": 2292.166, "speaker": "Cory"}, {"confidence": 0.93, "end": 2313.21, "track": 1, "text": "I will I'm sure I'll be going cuz one of my side jobs here is I actually coordinate the technical content of the day to work Scott conferences or help coordinator so from the engineering side.", "newpara": true, "start": 2298.812, "speaker": "Alan"}, {"confidence": 0.81, "end": 2314.928, "track": 1, "text": "Obviously we lied.", "start": 2313.426, "speaker": "Alan"}, {"confidence": 0.96, "end": 2325.168, "track": 1, "text": "Yo Community groups choose the content but you have to do a little bit of editing to make sure you don't get 10 talks on the hottest topic and nothing on anything else and you,", "start": 2315.097, "speaker": "Alan"}, {"confidence": 0.91, "end": 2331.994, "track": 1, "text": "and just so you know somebody has to be out there recruiting the reviewers and and.", "start": 2325.264, "speaker": "Alan"}, {"confidence": 0.87, "end": 2337.126, "track": 1, "text": "Kind of all that finding the replacements for last minute to,", "start": 2332.379, "speaker": "Alan"}, {"confidence": 0.91, "end": 2343.663, "track": 1, "text": "people that can show up and all those things so I I help with that so I'll definitely be involved I.", "start": 2337.204, "speaker": "Alan"}, {"confidence": 0.87, "end": 2351.067, "track": 1, "text": "I usually speak at most of them I have actually quite enjoy doing that,", "start": 2344.03, "speaker": "Alan"}, {"confidence": 0.94, "end": 2361.384, "track": 1, "text": "I don't I haven't gotten around to putting in a talk for the next one which is in Berlin and April which I guess I should get to cuz I think the conference is closes pretty soon.", "start": 2351.043, "speaker": "Alan"}, {"confidence": 0.82, "end": 2363.541, "track": 0, "text": "December I think December 14th and so weird.", "newpara": true, "start": 2361.084, "speaker": "Cory"}, {"confidence": 0.95, "end": 2372.933, "track": 0, "text": "So the collective group at the Big Data beard team would like to officially begin begging for your consideration of are abstracts.", "start": 2363.74, "speaker": "Cory"}, {"confidence": 0.96, "end": 2383.167, "track": 0, "text": "We've all been working really hard to get some some interesting talks going so if you see our names up there we are expecting a preferential treatment if you know what I mean.", "start": 2373.15, "speaker": "Cory"}, {"confidence": 0.91, "end": 2390.48, "track": 3, "text": "Only half of them were actually about beards the other half at we're actually talking big data so I don't know if that helps or hurts us.", "newpara": true, "start": 2384.279, "speaker": "Thomas"}, {"confidence": 0.92, "end": 2395.498, "track": 0, "text": "I'm actually just going to stand up there and drink beer and gets home in the mustache for 30 minutes of Sylvia Browne.", "newpara": true, "start": 2390.889, "speaker": "Cory"}, {"confidence": 0.95, "end": 2407.119, "track": 1, "text": "Well we should get you involved that you know we have a you know some like what is out birds of a feather that's what we should have a beards birds of the feather afterwards.", "newpara": true, "start": 2397.427, "speaker": "Alan"}, {"confidence": 0.86, "end": 2411.638, "track": 0, "text": "Well then I'm pretty sure there's a couple of sparrows hanging out in this Face store South got going on.", "newpara": true, "start": 2406.819, "speaker": "Cory"}, {"confidence": 0.89, "end": 2421.475, "track": 0, "text": "Car so I got to go I got to go she just in general again it's your you if you got the school view of kind of this community,", "newpara": true, "start": 2413.279, "speaker": "Cory"}, {"confidence": 0.92, "end": 2433.944, "track": 0, "text": "what are the you know what's the what's on the horizon for just the general Big Data Community I know we talked to use cases are important but just where do you see this community going and and what do you think or the the kind of the next big things a week.", "start": 2421.241, "speaker": "Cory"}, {"confidence": 0.98, "end": 2438.751, "track": 0, "text": "As participants in the community should either be paying attention to or starting to work on now.", "start": 2434.094, "speaker": "Cory"}, {"confidence": 0.98, "end": 2444.333, "track": 1, "text": "Well it's.", "newpara": true, "start": 2440.079, "speaker": "Alan"}, {"confidence": 0.9, "end": 2450.955, "track": 1, "text": "So what all kind of throw out several directions that I see things going and I don't the thing is.", "start": 2444.82, "speaker": "Alan"}, {"confidence": 0.94, "end": 2463.875, "track": 1, "text": "I get so in the weeds in a section to that it can be hard to know if I'm seeing the whole picture or parts of it but there's several parts on seeing and somebody deleted to which is the connectedness of data.", "start": 2451.34, "speaker": "Alan"}, {"confidence": 0.96, "end": 2476.632, "track": 1, "text": "People should be able to get to operate on use whatever it is they do with their data regardless of its location whether it's in a cluster somewhere Cloud somewhere or out on the edge.", "start": 2464.188, "speaker": "Alan"}, {"confidence": 0.96, "end": 2488.867, "track": 1, "text": "I think the other thing that I'm seeing a lot of them this is a reflection of where I spend part of my time is around security and governance of the data what.", "start": 2477.167, "speaker": "Alan"}, {"confidence": 0.97, "end": 2498.733, "track": 1, "text": "What are the protocols for how you keep data or how long you keep it or who you can present it to who you can share it with what.", "start": 2489.414, "speaker": "Alan"}, {"confidence": 0.95, "end": 2509.922, "track": 1, "text": "When the customer calls and says you know what are you doing with my data or can you please delete it or can you tell me who you've given it to how do you answer those questions or deal with those things,", "start": 2499.166, "speaker": "Alan"}, {"confidence": 0.91, "end": 2518.353, "track": 1, "text": "I think those are going to get more and more important we see that certainly happening in Europe with I don't know if you guys have heard of the gdpr legislation but it.", "start": 2509.911, "speaker": "Alan"}, {"confidence": 0.95, "end": 2520.624, "track": 0, "text": "Oh yeah.", "newpara": true, "start": 2518.053, "speaker": "Cory"}, {"confidence": 0.95, "end": 2529.818, "track": 1, "text": "Okay that's obviously a huge deal for many of our customers even companies that are primarily European is anybody who has any data on any EU citizen is.", "newpara": true, "start": 2519.321, "speaker": "Alan"}, {"confidence": 0.92, "end": 2543.152, "track": 1, "text": "Bound by that but I suspect we'll see how other countries starting to adopt either gdpr itself or you know something similar.", "start": 2530.173, "speaker": "Alan"}, {"confidence": 0.87, "end": 2556.102, "track": 1, "text": "Those and I would say rightfully so I mean people are as companies and governments and others collect lots and lots of data as individuals we want to know.", "start": 2543.718, "speaker": "Alan"}, {"confidence": 0.95, "end": 2568.282, "track": 1, "text": "Who has what information and how secure is it we've obviously seen failures of that recently in terms of you know our information not being properly.", "start": 2556.457, "speaker": "Alan"}, {"confidence": 0.94, "end": 2577.422, "track": 1, "text": "Guarded by those who have it so I think they'll be a lot of focus going forward on that which is something that.", "start": 2569.154, "speaker": "Alan"}, {"confidence": 0.94, "end": 2589.993, "track": 1, "text": "Honestly a bit of a shift for people in this community cuz the community has been really engineering-driven and Engineers tend to think of security and governance is something you have to do not something you want to do.", "start": 2578.048, "speaker": "Alan"}, {"confidence": 0.89, "end": 2592.379, "track": 3, "text": "Will do it later.", "newpara": true, "start": 2591.309, "speaker": "Thomas"}, {"confidence": 0.91, "end": 2605.959, "track": 1, "text": "Yeah it's not interesting right somebody else to come along and do that at night I think that we have to ship that mindset a little bit and think about you it's just a lot to think about security first we have to be asking ourselves okay cool.", "newpara": true, "start": 2592.079, "speaker": "Alan"}, {"confidence": 0.94, "end": 2615.393, "track": 1, "text": "Houses datasafe what are the ways somebody might try to get out of it what what do I need to do to enable my users to.", "start": 2606.176, "speaker": "Alan"}, {"confidence": 0.72, "end": 2617.707, "track": 1, "text": "Note to protect their stuff.", "start": 2616.001, "speaker": "Alan"}, {"confidence": 0.87, "end": 2624.275, "track": 2, "text": "Yeah it said hey I want to roll up a couple of topics that we've we talked about today because I think that you just touched on that something,", "newpara": true, "start": 2617.407, "speaker": "Rob"}, {"confidence": 0.9, "end": 2631.919, "track": 2, "text": "pop a little light on in my head so I'm working with a couple of different Global organizations now where you know like Debbie Gates one.", "start": 2624.419, "speaker": "Rob"}, {"confidence": 0.94, "end": 2646.208, "track": 2, "text": "Holiday to all the time regardless of where it originated from or where it came from but to your point about security and governance some of the state of crosses political boundaries or nation-state boundaries word data has to stay local but that scale at they need to keep,", "newpara": true, "start": 2631.859, "speaker": "Rob"}, {"confidence": 0.89, "end": 2652.728, "track": 2, "text": "In Too Deep archive and many many years retention ill all those things together where I've got.", "start": 2646.293, "speaker": "Rob"}, {"confidence": 0.87, "end": 2661.05, "track": 2, "text": "Nation boundaries and retention and governance an important aspects Force privacy regulations around the data,", "newpara": true, "start": 2652.999, "speaker": "Rob"}, {"confidence": 0.91, "end": 2668.58, "track": 2, "text": "Dole Caesar critical at how do I continue to grow with the scale to the and use the kinds of security governance and data orchestration you're talking about today.", "start": 2660.87, "speaker": "Rob"}, {"confidence": 0.95, "end": 2683.254, "track": 1, "text": "Well so let me just be upfront and say I don't think anyone's answer that question well yet it's not like I can pull a project out of my hat and say here's something that will magically solve your problem.", "newpara": true, "start": 2669.896, "speaker": "Alan"}, {"confidence": 0.95, "end": 2688.752, "track": 1, "text": "I can tell you that there are people working on this problems we have a.", "start": 2683.435, "speaker": "Alan"}, {"confidence": 0.92, "end": 2700.668, "track": 1, "text": "Project Wallace I mean there's an Apache project that we are part of Apache Atlas that tracks data Providence and the rules around,", "start": 2688.945, "speaker": "Alan"}, {"confidence": 0.7, "end": 2705.073, "track": 1, "text": "very state of sides and those sorts of things.", "start": 2700.729, "speaker": "Alan"}, {"confidence": 0.94, "end": 2716.863, "track": 1, "text": "And we are through our collaboration in Otti which is a an industry collaboration group of us an IBM and Sass and some others.", "start": 2705.698, "speaker": "Alan"}, {"confidence": 0.99, "end": 2719.981, "track": 1, "text": "We're working on adding.", "start": 2717.242, "speaker": "Alan"}, {"confidence": 0.96, "end": 2732.859, "track": 1, "text": "Kind of module screw Atlas that would enable it to track some of those sorts of things but it's very early days I mean right now what we have our beautiful set of slides that explain how all this is going to work.", "start": 2721.093, "speaker": "Alan"}, {"confidence": 0.94, "end": 2736.68, "track": 1, "text": "Start like there is a solution that's been found yet.", "start": 2733.075, "speaker": "Alan"}, {"confidence": 0.92, "end": 2751.806, "track": 0, "text": "ODP eyes an interesting one for a lot of us you know it was it created the kind of a rift between you know I think the Marquette General agrees are the two biggest players in the space between you guys at hortonworks in Cloudera in terms of approach,", "newpara": true, "start": 2737.084, "speaker": "Cory"}, {"confidence": 0.91, "end": 2757.436, "track": 0, "text": "what would you think the big benefit of OTP I has been in this in this community.", "start": 2751.619, "speaker": "Cory"}, {"confidence": 0.95, "end": 2760.585, "track": 1, "text": "Well today.", "newpara": true, "start": 2758.079, "speaker": "Alan"}, {"confidence": 0.91, "end": 2771.738, "track": 1, "text": "So deeply I was created to give really with the goal of saying okay there is I don't know her number but there were at the time 5 or 7 or whatever it was they do distributions.", "start": 2760.91, "speaker": "Alan"}, {"confidence": 0.95, "end": 2780.679, "track": 1, "text": "And let's try to bring some kind of uniformity here so that users don't have to worry about the fact that there are.", "start": 2771.888, "speaker": "Alan"}, {"confidence": 0.92, "end": 2793.112, "track": 1, "text": "You know they may have to run on different distributions could have a particular company might buy one or the other distribution but most anybody use building software on top of it is going to want to run on.", "newpara": true, "start": 2782.104, "speaker": "Alan"}, {"confidence": 0.96, "end": 2799.812, "track": 1, "text": "Multiple distributions cuz they don't know what their customers are going to want to use.", "start": 2793.34, "speaker": "Alan"}, {"confidence": 0.94, "end": 2807.257, "track": 1, "text": "There was a lot of consolidation in the market so that actually in that sense Otti,", "start": 2800.149, "speaker": "Alan"}, {"confidence": 0.98, "end": 2815.471, "track": 1, "text": "was very helpful pivotal and IBM ended up consolidating on top of htps.", "start": 2807.342, "speaker": "Alan"}, {"confidence": 0.85, "end": 2820.783, "track": 1, "text": "Distribution and we're kind of down to a point where it's us and Clara and Matt Barr in.", "start": 2815.682, "speaker": "Alan"}, {"confidence": 0.92, "end": 2832.621, "track": 1, "text": "There is and also pen Amazon his tools if you're just thinking here in the US so not a lot of consolidation has been driven now DPI is turning and trying to look at the next problem of OKC.", "start": 2821.349, "speaker": "Alan"}, {"confidence": 0.96, "end": 2835.169, "track": 1, "text": "If we could have like an elevation.", "start": 2832.856, "speaker": "Alan"}, {"confidence": 0.92, "end": 2843.516, "track": 1, "text": "The next thing is let's look at how would we govern and secure the stay there cuz that's kind of one of the next big problems users have.", "start": 2835.44, "speaker": "Alan"}, {"confidence": 0.91, "end": 2855.552, "track": 3, "text": "Alan thanks again for being on the show we're going to be going to roll into a wrap it up before we let you leave we're going to ask you some rapid fire questions so these questions first thing that comes to mind we're just kind of go through saddle right or you ready.", "newpara": true, "start": 2843.564, "speaker": "Thomas"}, {"confidence": 0.91, "end": 2856.958, "track": 1, "text": "You sure fire way.", "newpara": true, "start": 2855.252, "speaker": "Alan"}, {"confidence": 0.97, "end": 2860.6, "track": 3, "text": "What year was Skynet go online.", "newpara": true, "start": 2856.658, "speaker": "Thomas"}, {"confidence": 0.91, "end": 2864.073, "track": 1, "text": "2035.", "newpara": true, "start": 2860.829, "speaker": "Alan"}, {"confidence": 0.99, "end": 2868.592, "track": 3, "text": "If you bought me a book what would it be.", "newpara": true, "start": 2863.881, "speaker": "Thomas"}, {"confidence": 0.97, "end": 2870.597, "track": 1, "text": "Lord of the Rings.", "newpara": true, "start": 2868.923, "speaker": "Alan"}, {"confidence": 0.98, "end": 2871.909, "track": 0, "text": "Which one.", "newpara": true, "start": 2870.497, "speaker": "Cory"}, {"confidence": 0.9, "end": 2874.541, "track": 1, "text": "The hotel it's one book.", "newpara": true, "start": 2871.809, "speaker": "Alan"}, {"confidence": 0.8, "end": 2876.83, "track": 3, "text": "Controversy here.", "newpara": true, "start": 2874.385, "speaker": "Thomas"}, {"confidence": 0.9, "end": 2880.343, "track": 0, "text": "Okay suck I got it not The Hobbit you're saying.", "newpara": true, "start": 2876.53, "speaker": "Cory"}, {"confidence": 0.96, "end": 2882.106, "track": 1, "text": "No no no the real Lord of the Rings.", "newpara": true, "start": 2880.093, "speaker": "Alan"}, {"confidence": 0.9, "end": 2887.172, "track": 3, "text": "What genre of music are you talking to right now.", "newpara": true, "start": 2882.9, "speaker": "Thomas"}, {"confidence": 0.96, "end": 2891.937, "track": 1, "text": "80s rock and roll.", "newpara": true, "start": 2886.872, "speaker": "Alan"}, {"confidence": 0.98, "end": 2896.96, "track": 1, "text": "I'm old man.", "newpara": true, "start": 2894.413, "speaker": "Alan"}, {"confidence": 0.98, "end": 2899.37, "track": 3, "text": "What is your favorite piece of useless Tech.", "newpara": true, "start": 2896.769, "speaker": "Thomas"}, {"confidence": 0.97, "end": 2901.984, "track": 1, "text": "Favorite piece of useless Tech.", "newpara": true, "start": 2899.545, "speaker": "Alan"}, {"confidence": 0.88, "end": 2907.693, "track": 0, "text": "You know like the thing that you bought me is like this is kind of dumb but I kind of love it.", "newpara": true, "start": 2902.802, "speaker": "Cory"}, {"confidence": 0.96, "end": 2913.039, "track": 1, "text": "I don't know I don't buy stuff that's useless actually.", "newpara": true, "start": 2907.903, "speaker": "Alan"}, {"confidence": 0.99, "end": 2915.931, "track": 3, "text": "Spoken like a true engineer.", "newpara": true, "start": 2912.789, "speaker": "Thomas"}, {"confidence": 0.93, "end": 2922.114, "track": 1, "text": "No I don't buy all that just are not the latest junk kind of guy so I'm trying to think what would be my.", "newpara": true, "start": 2914.191, "speaker": "Alan"}, {"confidence": 0.98, "end": 2923.759, "track": 0, "text": "Do you want an Apple watch.", "newpara": true, "start": 2922.193, "speaker": "Cory"}, {"confidence": 0.94, "end": 2925.113, "track": 1, "text": "No I don't.", "newpara": true, "start": 2923.966, "speaker": "Alan"}, {"confidence": 0.86, "end": 2932.859, "track": 0, "text": "Alright see you that's another vote again so cuz we had it but we had suspected as much people like the majority of people like Mom Apple watch.", "newpara": true, "start": 2924.863, "speaker": "Cory"}, {"confidence": 0.85, "end": 2934.824, "track": 3, "text": "Yeah we never get an Apple Watch sponsorship.", "newpara": true, "start": 2932.571, "speaker": "Thomas"}, {"confidence": 0.95, "end": 2937.257, "track": 2, "text": "I love my Apple watch today.", "newpara": true, "start": 2935.059, "speaker": "Rob"}, {"confidence": 0.52, "end": 2938.055, "track": 1, "text": "Okay.", "newpara": true, "start": 2937.007, "speaker": "Alan"}, {"confidence": 0.92, "end": 2946.313, "track": 1, "text": "Okay let me modify that bit I have bought one that is a gift for someone else my son has one in which he loves us so.", "start": 2938.882, "speaker": "Alan"}, {"confidence": 0.96, "end": 2948.771, "track": 3, "text": "What is your biggest Money Pit right now.", "newpara": true, "start": 2945.208, "speaker": "Thomas"}, {"confidence": 0.93, "end": 2951.737, "track": 1, "text": "For me personally or artworks.", "newpara": true, "start": 2949.348, "speaker": "Alan"}, {"confidence": 0.96, "end": 2953.163, "track": 3, "text": "Personally you.", "newpara": true, "start": 2951.944, "speaker": "Thomas"}, {"confidence": 0.89, "end": 2960.464, "track": 1, "text": "Biggest Money Pit my my diesel Volkswagen that I need to get rid of.", "newpara": true, "start": 2952.943, "speaker": "Alan"}, {"confidence": 0.93, "end": 2967.092, "track": 0, "text": "Is it like a cool like cool old diesel Volkswagen or just like a 95 Passat that this is beat up.", "newpara": true, "start": 2960.327, "speaker": "Cory"}, {"confidence": 0.96, "end": 2969.887, "track": 1, "text": "No it's it's just.", "newpara": true, "start": 2966.793, "speaker": "Alan"}, {"confidence": 0.97, "end": 2983.593, "track": 1, "text": "It's a 2014 Jetta it's just I ordered a new car and it keeps getting delayed and I keep having to put like small things keep breaking on my Jetta and it's driving me nuts.", "start": 2970.265, "speaker": "Alan"}, {"confidence": 0.84, "end": 2987.491, "track": 0, "text": "Oh that's the one that it puts out more smoke than 18 wheeler.", "newpara": true, "start": 2983.636, "speaker": "Cory"}, {"confidence": 0.97, "end": 2988.725, "track": 1, "text": "Yeah exactly.", "newpara": true, "start": 2987.554, "speaker": "Alan"}, {"confidence": 0.9, "end": 2989.687, "track": 0, "text": "Perfect love it.", "newpara": true, "start": 2988.475, "speaker": "Cory"}, {"confidence": 0.99, "end": 2994.061, "track": 3, "text": "Are you going anywhere interesting soon.", "newpara": true, "start": 2989.387, "speaker": "Thomas"}, {"confidence": 0.98, "end": 2998.676, "track": 1, "text": "I'm going to Disneyland over Christmas that's about it.", "newpara": true, "start": 2993.857, "speaker": "Alan"}, {"confidence": 0.92, "end": 3001.963, "track": 3, "text": "Oh wow\nwhat show are you benching on right now.", "newpara": true, "start": 2996.393, "speaker": "Thomas"}, {"confidence": 0.95, "end": 3009.168, "track": 1, "text": "Tinker Tailor Soldier Spy but the old Alec Guinness version not the the recent one.", "newpara": true, "start": 3002.655, "speaker": "Alan"}, {"confidence": 0.95, "end": 3010.46, "track": 0, "text": "Very good.", "newpara": true, "start": 3009.084, "speaker": "Cory"}, {"confidence": 0.93, "end": 3022.514, "track": 3, "text": "What thanks again Alan that's all for today show want to thank you for being a part of the show make sure that you subscribe to the big date of beer podcast said that you never miss an episode make sure you rate US on iTunes thanks again.", "newpara": true, "start": 3010.304, "speaker": "Thomas"}, {"confidence": 0.98, "end": 3025.699, "track": 1, "text": "Alright well thank you for having me.", "newpara": true, "start": 3022.562, "speaker": "Alan"}]