[{"confidence": 0.93, "end": 8.617, "track": 0, "text": "Thomas anthem of the big date of your podcast I'll be your host today for our episode but it will just be me I have another co-host Corey how are you doing today.", "newpara": true, "start": 0.006, "speaker": "Thomas"}, {"confidence": 0.97, "end": 10.762, "track": 2, "text": "Man I'm awesome.", "newpara": true, "start": 9.218, "speaker": "Cory"}, {"confidence": 0.89, "end": 18.688, "track": 0, "text": "Then we also have our guest today so I guess is going to be built schmarzo the Dina Big Data built to say hey to the audience.", "newpara": true, "start": 10.774, "speaker": "Thomas"}, {"confidence": 0.92, "end": 25.622, "track": 1, "text": "Hey audience under thanks for having me on the podcast I'm I'm very eager for the kinds of questions you're going to throw at me.", "newpara": true, "start": 18.977, "speaker": "Bill"}, {"confidence": 0.92, "end": 38.686, "track": 0, "text": "Will try to be gentle there but first a couple different news items so we've got a couple news topic that we want to jump in and then one after that talk about all the things that you're doing as the dean of big day.", "newpara": true, "start": 26.062, "speaker": "Thomas"}, {"confidence": 0.91, "end": 47.556, "track": 0, "text": "So the first news topic item that we got for the day is comes in from Katy nuggets it's.", "newpara": true, "start": 41.361, "speaker": "Thomas"}, {"confidence": 0.94, "end": 57.657, "track": 0, "text": "It's an article about the demand for data scientist is pretty much asking how we hit PCAT and kind of where is the we see the Pete for demand so you don't any bubble that we have,", "newpara": true, "start": 47.604, "speaker": "Thomas"}, {"confidence": 0.96, "end": 69.783, "track": 0, "text": "you know there's always a time where you know what swells up really fast but then it you kind of deflates and so what they were trying to do is about 1200 different voters and vote on when they think the peak will happen so it's some people there in the industry,", "start": 57.465, "speaker": "Thomas"}, {"confidence": 0.9, "end": 76.519, "track": 0, "text": "or maybe I've been in the industry for a little bit longer to its okay,", "start": 69.615, "speaker": "Thomas"}, {"confidence": 0.86, "end": 81.927, "track": 0, "text": "ICP anywhere between the next 4 to 10 years just from this pole here.", "start": 76.652, "speaker": "Thomas"}, {"confidence": 0.94, "end": 90.142, "track": 0, "text": "Cory how do you feel about the Pete for data scientist and kind of machine learning and you know how big the market is for you know it's been the sexiest career since.", "newpara": true, "start": 82.511, "speaker": "Thomas"}, {"confidence": 0.79, "end": 95.604, "track": 0, "text": "2012 and then seem to be dying what what do you think about the pecan for the interest is for machine learning.", "newpara": true, "start": 90.244, "speaker": "Thomas"}, {"confidence": 0.92, "end": 109.347, "track": 2, "text": "Well I think it's like anything I don't think humans are very good at looking out past about 4-5 Years anyway so we're kind of the putting that fence out there something that we're going to comfortable if we think we can understand I think the.", "newpara": true, "start": 96.326, "speaker": "Cory"}, {"confidence": 0.91, "end": 120.638, "track": 2, "text": "Another thing I like about titties I could say I was cracking up on the duties poles like it's you can tell it's run by a bunch of statisticians cuz they're they're really not only curious about the responses that they get,", "newpara": true, "start": 109.618, "speaker": "Cory"}, {"confidence": 0.91, "end": 132.722, "track": 2, "text": "what's really dig into the underlying meaning of the responses and how they're connected and I think that you know that the connection between how long somebody thinks the peak is a way,", "start": 120.698, "speaker": "Cory"}, {"confidence": 0.93, "end": 135.276, "track": 2, "text": "versus how long they've been in data science,", "start": 132.765, "speaker": "Cory"}, {"confidence": 0.85, "end": 143.022, "track": 2, "text": "it's kind of an interesting correlation is I think that those folks that have been in it for a long time for me I did a size perspective.", "start": 135.24, "speaker": "Cory"}, {"confidence": 0.91, "end": 149.331, "track": 2, "text": "I think they're probably a little bit more even I'd the date I think kind of back to sub but they were like.", "newpara": true, "start": 143.521, "speaker": "Cory"}, {"confidence": 0.93, "end": 159.829, "track": 2, "text": "I think that they believe it's going to happen faster by the folks that are just into it or still very excited that it's that it's out there that there's a long tail before they start to see the decline but Bill are you still,", "start": 149.253, "speaker": "Cory"}, {"confidence": 0.91, "end": 164.708, "track": 2, "text": "I mean you're clearly still very highly in demand do you think this is findings are accurate.", "start": 159.649, "speaker": "Cory"}, {"confidence": 0.74, "end": 167.016, "track": 1, "text": "I know I.", "newpara": true, "start": 164.511, "speaker": "Bill"}, {"confidence": 0.93, "end": 179.358, "track": 1, "text": "Don't think we're going to see demand drop off for good data scientist I think I think one of the way I look at this article one of the things that kind of struck me as this there's an underlying belief that the tools are going to bail us out,", "start": 167.311, "speaker": "Bill"}, {"confidence": 0.95, "end": 188.979, "track": 1, "text": "that we're seeing you know I creasing number of tools out there that are designed to make that his term citizen data scientist and I think that's a false prophet.", "start": 179.251, "speaker": "Bill"}, {"confidence": 0.95, "end": 198.9, "track": 1, "text": "I think we're trying to do is create citizens of data science and that the demand for good data scientists will continue to grow because they're the people who know how to monetize a data.", "start": 189.154, "speaker": "Bill"}, {"confidence": 0.89, "end": 208.917, "track": 1, "text": "So while this term data scientist can Encompass anything from people who are doing bi many cases are in Ojai level b i to people who are really doing data science work,", "start": 199.087, "speaker": "Bill"}, {"confidence": 0.92, "end": 218.381, "track": 1, "text": "I think if you really bored this curve down and look at what are the people who are really leveraging data science to monetize my data I think I'm going to see that curve girlfriend is really low today.", "start": 208.948, "speaker": "Bill"}, {"confidence": 0.94, "end": 223.609, "track": 1, "text": "I need the number of people who do that today for effectively is very low and I think that's going to grow over time.", "start": 218.49, "speaker": "Bill"}, {"confidence": 0.96, "end": 231.307, "track": 2, "text": "Does not just about the quantity it's about the quality I get it okay so being good is a good thing.", "newpara": true, "start": 224.289, "speaker": "Cory"}, {"confidence": 0.84, "end": 231.577, "track": 0, "text": "Yeah\nyeah.", "newpara": true, "start": 228.82, "speaker": "Thomas"}, {"confidence": 0.87, "end": 233.674, "track": 1, "text": "Be good to good thing and being better is even better.", "newpara": true, "start": 231.277, "speaker": "Bill"}, {"confidence": 0.93, "end": 246.33, "track": 0, "text": "I kind of look at it a different way I don't think we've scratched the surface and I think that even if you're a bad data scientist out there and you're listening I'm glad that you're listening to show we're going to try to give you some tools and help you be a better day to scientist at some point,", "newpara": true, "start": 233.753, "speaker": "Thomas"}, {"confidence": 0.82, "end": 255.313, "track": 0, "text": "but I also think I think that there's so much to me and we haven't even scratched the surface.", "start": 246.084, "speaker": "Thomas"}, {"confidence": 0.86, "end": 260.162, "track": 2, "text": "Yeah there's a lot of employers spend a lot of money but I figure out who's going and who's not.", "newpara": true, "start": 255.602, "speaker": "Cory"}, {"confidence": 0.93, "end": 270.216, "track": 1, "text": "I think I think the tools out there aren't going to take and make more great data scientist I think the great data scientist or doing it today with leather and Stone.", "newpara": true, "start": 260.133, "speaker": "Bill"}, {"confidence": 0.91, "end": 279.59, "track": 1, "text": "I think with the tools can do with some of these data science workbenches for example will take an average data scientist and make them good.", "start": 270.372, "speaker": "Bill"}, {"confidence": 0.9, "end": 284.133, "track": 1, "text": "But I got to be honest with you for the bad data scientist there's no help because I think.", "start": 279.849, "speaker": "Bill"}, {"confidence": 0.92, "end": 290.082, "track": 1, "text": "I think there's a real mindset there were some people just don't get it and that's okay.", "start": 284.295, "speaker": "Bill"}, {"confidence": 0.94, "end": 303.314, "track": 1, "text": "But you're not everybody can be the shorts up on the team so we got to play left field and play catcher so it it's it's a specializations task and some people who won't be good data scientist might end up being very good you know data visualization people,", "start": 290.208, "speaker": "Bill"}, {"confidence": 0.84, "end": 306.36, "track": 1, "text": "or data Engineers or data architect so.", "start": 303.32, "speaker": "Bill"}, {"confidence": 0.91, "end": 318.426, "track": 1, "text": "The people who are really good at quantifying cause and effect to a really really good at be able to figure out what variables are actually driving performance those are the ones who are going to continue to be in demand for the End of Time.", "start": 306.607, "speaker": "Bill"}, {"confidence": 0.86, "end": 320.307, "track": 2, "text": "That's actually kind of.", "newpara": true, "start": 319.058, "speaker": "Cory"}, {"confidence": 0.91, "end": 334.026, "track": 2, "text": "Funny Segway said that said that we we started looking at the there was an article posted informationweek about the the highest paid jobs in Tech and if you if you're going to go down the list all the things that we.", "start": 320.206, "speaker": "Cory"}, {"confidence": 0.88, "end": 339.825, "track": 2, "text": "Thomas starts talking about this it's it's really awesome it's my blowing the number like the the top.", "start": 333.906, "speaker": "Cory"}, {"confidence": 0.97, "end": 344.992, "track": 2, "text": "Paid like top paying job in Tech that is an individual contributor.", "newpara": true, "start": 340.282, "speaker": "Cory"}, {"confidence": 0.9, "end": 351.687, "track": 2, "text": "Is a big data engineer which I think they kind of throw some of the data science parts of that job there like in the top.", "newpara": true, "start": 345.39, "speaker": "Cory"}, {"confidence": 0.94, "end": 365.369, "track": 2, "text": "Paying jobs in Tech you get a bunch of dudes with season they're tight alright c i o c t o c s o then you get the v's the VP of it but the next guy down number 5 is literally the Big Data engineer salt.", "start": 351.567, "speaker": "Cory"}, {"confidence": 0.9, "end": 373.379, "track": 2, "text": "What I think Bill what you were saying is if you've got good if they're good at finding those cause and effect could make a whole lot of money doing this stuff.", "start": 365.262, "speaker": "Cory"}, {"confidence": 0.72, "end": 377.562, "track": 1, "text": "Yeah they took the best day to sign just said at Google.", "newpara": true, "start": 374.588, "speaker": "Bill"}, {"confidence": 0.89, "end": 387.951, "track": 1, "text": "Make tons of money because they're the best day to sign it so that end in Google is an expert at monetizing data by the way I thought that I thought that article really.", "start": 377.953, "speaker": "Bill"}, {"confidence": 0.91, "end": 393.618, "track": 1, "text": "I'm in Lost credibility for me immediately when I didn't even have the chief data officer on the list.", "start": 388.144, "speaker": "Bill"}, {"confidence": 0.87, "end": 404.128, "track": 1, "text": "But how do you how do you miss that role of a chick or as we think about organizations who are chartering that role to become more efficient at.", "start": 393.931, "speaker": "Bill"}, {"confidence": 0.95, "end": 411.531, "track": 1, "text": "Monetizing data blogs on the chief data officer role because it's the wrong title.", "start": 404.26, "speaker": "Bill"}, {"confidence": 0.95, "end": 426.421, "track": 1, "text": "It's it's not a cheap date officers not like a mini CIO it should be called the chief data monetization officer the job of the CDO is in monetize data and that's probably the single most important rule of all the rules air in doesn't make the list,", "start": 411.79, "speaker": "Bill"}, {"confidence": 0.96, "end": 440.567, "track": 1, "text": "so this this article sort of I already did already kind of skewed my perspective because you're missing the single most important role in organizations care about which is the the guy or the gal who was charted with monetizing the data,", "start": 426.512, "speaker": "Bill"}, {"confidence": 0.96, "end": 441.702, "track": 1, "text": "so anyway.", "start": 440.657, "speaker": "Bill"}, {"confidence": 0.91, "end": 456.401, "track": 2, "text": "Yeah brother are there that many people that actually doing that job right now that's the cuz I get that right I get that at Chief did officers I think is an important pivotal function in an organization to help them along that that curve of monetization.", "newpara": true, "start": 441.643, "speaker": "Cory"}, {"confidence": 0.94, "end": 466.556, "track": 2, "text": "What are there that many people doing it that we would in a study like this we're studying you know high paying jobs are there enough of them and are they just not are they not paid as well as some of these other jobs.", "start": 456.353, "speaker": "Cory"}, {"confidence": 0.89, "end": 473.136, "track": 1, "text": "Well I think it's I think it's reflects the misnomer when a chief data officer is,", "newpara": true, "start": 466.755, "speaker": "Bill"}, {"confidence": 0.87, "end": 481.218, "track": 1, "text": "I think they pulley missed it most organizations have brought in and they taken somebody who is it who is basically you know in the CIO.", "start": 473.221, "speaker": "Bill"}, {"confidence": 0.9, "end": 490.256, "track": 1, "text": "Ladder for the path and they they put more of the CDL roll and said your job is a manager data will no no no there Joshua to monetize a date.", "start": 481.717, "speaker": "Bill"}, {"confidence": 0.91, "end": 495.88, "track": 1, "text": "And if you look at digital media companies they have a roll call Chief Revenue officer,", "start": 490.473, "speaker": "Bill"}, {"confidence": 0.86, "end": 504.131, "track": 1, "text": "whose job is to attend Google's going to Chief Revenue officer in Facebook doesn't Yahoo does in their job is to figure out how do I make money off this data,", "start": 495.923, "speaker": "Bill"}, {"confidence": 0.92, "end": 516.684, "track": 1, "text": "why don't we have people like that shouldn't every organization who has this growing wealth of data who's been asked they're all they're all from in and around how do I monetize my data what you don't have any organization who owns that,", "start": 504.143, "speaker": "Bill"}, {"confidence": 0.96, "end": 518.667, "track": 1, "text": "you want what you want magic to happen,", "start": 516.756, "speaker": "Bill"}, {"confidence": 0.94, "end": 530.096, "track": 1, "text": "so it's to me it's just it's reflective of the fact that people are missing the bigger picture it is not just about grabbing and maintaining data that the end is how do I monetize it.", "start": 518.751, "speaker": "Bill"}, {"confidence": 0.92, "end": 540.666, "track": 0, "text": "Yeah I know I agree I think part of it too and one of the things that stuck out to me in this and so just give credit up there it's an article from informationweek weekly and it's called the 15 highest paid.", "newpara": true, "start": 530.126, "speaker": "Thomas"}, {"confidence": 0.91, "end": 549.553, "track": 0, "text": "Tech jobs in so I think part of it isn't the tech because I didn't see data scientist on there any either too and I and I think we can get the big data engineer on their number five,", "start": 540.684, "speaker": "Thomas"}, {"confidence": 0.94, "end": 556.566, "track": 0, "text": "12 is the data architect and you have a DBA in there 14 but I think part of the problem is they don't see the.", "start": 549.367, "speaker": "Thomas"}, {"confidence": 0.92, "end": 562.948, "track": 0, "text": "Monetization officer or chief data officer maybe that's not really registering as a tech job just cuz like we're not seeing them.", "start": 556.494, "speaker": "Thomas"}, {"confidence": 0.93, "end": 571.613, "track": 0, "text": "Data scientist on here but we know since 2012 has been one of the sexiest careers out there right and we know that it's in huge demand so I wonder I wonder kind of looking.", "newpara": true, "start": 563.056, "speaker": "Thomas"}, {"confidence": 0.93, "end": 579.719, "track": 0, "text": "You know if we were ever to look under the covers of some of this technology kind of what jobs did they see that weren't specifically a tech job which and you know it.", "start": 571.559, "speaker": "Thomas"}, {"confidence": 0.95, "end": 592.572, "track": 0, "text": "The ones really skewed and whatever you know what what tech jobs are cuz I think everything involves technology that we do you need to make the taste even your Chief marketing officer has to be you have a technical skills and.", "start": 579.707, "speaker": "Thomas"}, {"confidence": 0.99, "end": 595.949, "track": 1, "text": "Agreed agreed.", "newpara": true, "start": 592.332, "speaker": "Bill"}, {"confidence": 0.93, "end": 599.194, "track": 2, "text": "Yeah it sucks it's one of those the.", "newpara": true, "start": 595.854, "speaker": "Cory"}, {"confidence": 0.93, "end": 613.249, "track": 2, "text": "The truth is the tech is so ingrained in business that it's hard it's hard to decouple the two but I think Thomas I see we're headed like this is like the puretech operator rolls rather than the connected to business which Kindle is a great.", "newpara": true, "start": 599.687, "speaker": "Cory"}, {"confidence": 0.83, "end": 622.113, "track": 2, "text": "Conversation for my bills doing so he's so busy is cuz he has so many conversations about Mary in the tube between business and Tech.", "start": 613.136, "speaker": "Cory"}, {"confidence": 0.92, "end": 628.753, "track": 2, "text": "So Bill maybe we maybe we jump into it and let you talk about who you are and what you up to these days.", "start": 622.053, "speaker": "Cory"}, {"confidence": 0.9, "end": 631.108, "track": 1, "text": "Sure thanks so.", "newpara": true, "start": 629.312, "speaker": "Bill"}, {"confidence": 0.91, "end": 643.86, "track": 1, "text": "Well I'm the that the chief technology officer for Dell EMC big data and i r t Consulting practice which really means it's fancy way of saying I spend all my time on the road talking to and working with customers.", "start": 631.283, "speaker": "Bill"}, {"confidence": 0.96, "end": 656.869, "track": 1, "text": "By far the best job in Industry cuz I get a chance to work with people who are wrestling with these questions all the time I also have the advantage that I I teach part-time at University of San Francisco School of Management.", "start": 644.431, "speaker": "Bill"}, {"confidence": 0.9, "end": 664.266, "track": 1, "text": "Teacher class are called the big day to NBA and the and the purpose of the charter of that classes how do we.", "start": 657.41, "speaker": "Bill"}, {"confidence": 0.96, "end": 670.342, "track": 1, "text": "Teach tomorrow's Business Leaders to embrace analytics as a business discipline that is.", "start": 664.429, "speaker": "Bill"}, {"confidence": 0.92, "end": 683.598, "track": 1, "text": "The analytics is no longer the realm of what I T does that for they successful organizations of they're going to Business Leaders need to embrace and likes to the business discipline to become citizens of data science.", "start": 670.552, "speaker": "Bill"}, {"confidence": 0.86, "end": 691.566, "track": 1, "text": "Almond understand how data science helps him make more money history wise I've been in the data analytics space for.", "start": 683.814, "speaker": "Bill"}, {"confidence": 0.88, "end": 700.76, "track": 1, "text": "God knows how long I got started back in the 1980s doing data warehousing by I had one of those so you know Forrest Gump moments in your life,", "start": 691.903, "speaker": "Bill"}, {"confidence": 0.91, "end": 713.385, "track": 1, "text": "we're in the right place right time. Because I'm tall or good looking or from Iowa you every time sometimes in life you just get lucky right place right time and in 8788 I was lucky I was wearing the project at Procter & Gamble will be brought in,", "start": 700.736, "speaker": "Bill"}, {"confidence": 0.89, "end": 721.455, "track": 1, "text": "Walmart's Point of Sales data for the first time in to do analysis on it which really sort of launched the whole day to warehouse and bi space.", "start": 713.367, "speaker": "Bill"}, {"confidence": 0.71, "end": 725.739, "track": 1, "text": "So I spent 27 years in a bi did warehouse space know it very well.", "newpara": true, "start": 721.533, "speaker": "Bill"}, {"confidence": 0.94, "end": 735.408, "track": 1, "text": "I'm a star schema guy work close to Ralph Kimball for many years and then about 14 years ago I was recruited out of business objects where I was the vice president of analytic applications.", "start": 726.106, "speaker": "Bill"}, {"confidence": 0.94, "end": 744.866, "track": 1, "text": "I was recruited by Yahoo to build out their Advertiser analytics which was designed to how do we help advertisers optimize or spend across the Yahoo ad Network.", "start": 735.655, "speaker": "Bill"}, {"confidence": 0.94, "end": 753.345, "track": 1, "text": "And that was a that was a water\nstone moment for me are you know ah ah a milestone moment in the sense that.", "start": 745.251, "speaker": "Bill"}, {"confidence": 0.94, "end": 762.497, "track": 1, "text": "Everything that I had learned about bi and data warehousing was now wrong and everything and how I approach Beyond data warehouse and I had to unlearn,", "start": 753.568, "speaker": "Bill"}, {"confidence": 0.91, "end": 768.794, "track": 1, "text": "do I move into a world where I wasn't dealing with gigabytes of data I was dealing with petabytes of data and I wasn't dealing with you know,", "start": 762.587, "speaker": "Bill"}, {"confidence": 0.91, "end": 779.1, "track": 1, "text": "100 dimensions of dealing with a million dimensions and and so you know 500 million customers a day coming to Yahoo and understanding what add to show them what time,", "start": 768.855, "speaker": "Bill"}, {"confidence": 0.9, "end": 788.738, "track": 1, "text": "everything I knew about their porch light done before the whole idea of slice and dice just didn't scale so if the last several almost last decade a half and I've been spending time,", "start": 779.046, "speaker": "Bill"}, {"confidence": 0.93, "end": 803.424, "track": 1, "text": "working in this world of big data and data science now it's all machine learning artificial intelligence and deep learning neural networks in to pick your favorite technology but it's really all has always boil down to one one conversation.", "start": 788.751, "speaker": "Bill"}, {"confidence": 0.98, "end": 812.594, "track": 1, "text": "Which is how do I make money out of my data how do I use my data to make me more money so.", "start": 804.044, "speaker": "Bill"}, {"confidence": 0.94, "end": 820.905, "track": 1, "text": "That's kind of the role that I do and I'm like I said I'm very fortunate because I spend all my time with customers who are at various stages in their big data business model maturity,", "newpara": true, "start": 812.607, "speaker": "Bill"}, {"confidence": 0.9, "end": 828.482, "track": 1, "text": "I'm going to give me a chance and I understand where they are and their challenges would also give me a chance to work with them to help Advance them along that maturity index.", "start": 820.755, "speaker": "Bill"}, {"confidence": 0.9, "end": 839.906, "track": 0, "text": "That's awesome bill and I know we've had some different conversations before in the past about you know some of your time at Yahoo but just just for the listeners out there I mean it's so cool I mean you are you are at Yahoo.", "newpara": true, "start": 828.795, "speaker": "Thomas"}, {"confidence": 0.95, "end": 845.776, "track": 0, "text": "Don't people how to make more money right out of the data that you had at the same time that Hadoop was me and you know,", "newpara": true, "start": 840.002, "speaker": "Thomas"}, {"confidence": 0.93, "end": 856.154, "track": 0, "text": "mainstream to incubated in open sores can you give us a little background on what that was like to be a part of Amina versus so many smart people Yahoo at that time and all the things that came out of there I mean it's just.", "start": 845.591, "speaker": "Thomas"}, {"confidence": 0.87, "end": 857.38, "track": 0, "text": "Just so amazing.", "start": 856.082, "speaker": "Thomas"}, {"confidence": 0.83, "end": 863.101, "track": 1, "text": "Yeah there was a group of yahuah call STS and think it was for strategic Data Solutions.", "newpara": true, "start": 857.903, "speaker": "Bill"}, {"confidence": 0.96, "end": 869.704, "track": 1, "text": "And when that group kind of got disbanded there's about 40 people in that group and they were amazing,", "start": 863.504, "speaker": "Bill"}, {"confidence": 0.92, "end": 874.38, "track": 1, "text": "twister it was the best brightest bunch of people I've ever worked with,", "start": 869.597, "speaker": "Bill"}, {"confidence": 0.93, "end": 887.792, "track": 1, "text": "in that group disbanded you can see across in a Cloudera and map are and hortonworks and all these other big data analytics companies you can see no Green Plumbing sucks you can see all these different people should have went out and they,", "start": 874.308, "speaker": "Bill"}, {"confidence": 0.81, "end": 892.707, "track": 1, "text": "and they seated this whole big data conversion is whole big data craze,", "start": 887.648, "speaker": "Bill"}, {"confidence": 0.92, "end": 902.226, "track": 1, "text": "preceded by what was going on at Yahoo and how when they decide that group how all these really smart people landed and spots and started a growing on tree started growing everywhere.", "start": 892.6, "speaker": "Bill"}, {"confidence": 0.92, "end": 911.528, "track": 1, "text": "As a as a user I am not a technology guy but the things that I could do with Hadoop and the analytics we had around that.", "start": 902.418, "speaker": "Bill"}, {"confidence": 0.87, "end": 917.122, "track": 1, "text": "To me were staggering and I could build detail profiles on every visitor.", "start": 911.63, "speaker": "Bill"}, {"confidence": 0.92, "end": 925.246, "track": 1, "text": "I could know you know work sites they've been to what they were most interested in what they clicked on what keywords they searched I knew so much about them.", "start": 917.393, "speaker": "Bill"}, {"confidence": 0.84, "end": 929.194, "track": 1, "text": "And if and when you know so much about every individual customer.", "start": 925.487, "speaker": "Bill"}, {"confidence": 0.93, "end": 938.16, "track": 1, "text": "Then your ability to make really strong recommendations like what add you think that person is most likely to want to see cuz if I can make that if I can improve that by .1%.", "start": 929.333, "speaker": "Bill"}, {"confidence": 0.95, "end": 949.932, "track": 1, "text": "It's worth tens of millions of dollars of the organization so the the lot of the concepts that I had brought to Yahoo about how bi and data warehousing work were wrong.", "start": 938.274, "speaker": "Bill"}, {"confidence": 0.92, "end": 957.004, "track": 1, "text": "In this new world but the ideas about how you monetize we're still spot on so while I lost a lot of the,", "newpara": true, "start": 950.052, "speaker": "Bill"}, {"confidence": 0.88, "end": 966.859, "track": 1, "text": "my technology footing for many years before I finally understood the whole the concept behind data science and Big Data the monetization concepts became even more,", "start": 956.818, "speaker": "Bill"}, {"confidence": 0.88, "end": 971.967, "track": 1, "text": "convincing I was even more convinced of the ability to monetize that data and unique ways.", "start": 966.799, "speaker": "Bill"}, {"confidence": 0.75, "end": 978.349, "track": 0, "text": "So in your soil Bill and your roll out there and you you're talking about your kind of.", "newpara": true, "start": 972.388, "speaker": "Thomas"}, {"confidence": 0.93, "end": 983.624, "track": 0, "text": "Broke the way that you saw the world as bi and data warehouse and so you've been involved.", "start": 978.295, "speaker": "Thomas"}, {"confidence": 0.93, "end": 994.351, "track": 0, "text": "You know when this part for at least 10 years when you're out there talking to customers do you do find yourself having to evangelize to some extent I know you know about the monetization but saying hey the way that we look at you know.", "newpara": true, "start": 983.763, "speaker": "Thomas"}, {"confidence": 0.93, "end": 1009.878, "track": 0, "text": "Business intelligence Armada warehouses think about it differently now you can have vast amounts of data and process if you find yourself you know kind of having to break that mold and kind of new show people hate you know I was I was in your feet but the way that you're so vastly different kind of Angeles,", "newpara": true, "start": 994.664, "speaker": "Thomas"}, {"confidence": 0.8, "end": 1010.888, "track": 0, "text": "for that some extent.", "start": 1009.638, "speaker": "Thomas"}, {"confidence": 0.9, "end": 1014.667, "track": 1, "text": "Clearly in fact what I would I like to do is I like to,", "newpara": true, "start": 1011.116, "speaker": "Bill"}, {"confidence": 0.91, "end": 1028.957, "track": 1, "text": "with a customer sort of talked about you want to talk about their environment first and more times not to talk about your behind data warehouse environments and their analytics environment you're really no Trend reports and then very loose term Analytics,", "start": 1014.644, "speaker": "Bill"}, {"confidence": 0.91, "end": 1033.404, "track": 1, "text": "little paws and I say do you want a report or do you want to predict.", "start": 1028.891, "speaker": "Bill"}, {"confidence": 0.93, "end": 1038.914, "track": 1, "text": "Do you want a report on what customers left or do you want to predict them which ones are likely to leave.", "start": 1033.831, "speaker": "Bill"}, {"confidence": 0.88, "end": 1044.917, "track": 1, "text": "Do you want a report on what products are like in the breakdown or do you want to predict which ones are so you can prevent them,", "start": 1039.089, "speaker": "Bill"}, {"confidence": 0.95, "end": 1055.217, "track": 1, "text": "and you start the mindset this whole concept of how do I get people how do we get people to think like a data scientist to stop thinking about reporting on what happened.", "start": 1044.941, "speaker": "Bill"}, {"confidence": 0.93, "end": 1059.952, "track": 1, "text": "Predicting what's likely to happen so I can prescribe action so I can prevent.", "start": 1055.391, "speaker": "Bill"}, {"confidence": 0.89, "end": 1068.472, "track": 1, "text": "Best there's it's a mindset changed it if you can get people to make that mind shift that change in mind shift.", "start": 1060.271, "speaker": "Bill"}, {"confidence": 0.94, "end": 1078.562, "track": 1, "text": "The Technologies are all out there to help them move along their technology to help you better predictors Technologies to help you better prescribed and there's technology help you better prevent.", "start": 1068.87, "speaker": "Bill"}, {"confidence": 0.9, "end": 1088.218, "track": 1, "text": "But if you don't have that mindshift first if you're still thinking that data and analytics about reporting on what happened and you're going to run your company using a rear view mirror.", "start": 1078.707, "speaker": "Bill"}, {"confidence": 0.88, "end": 1091.998, "track": 1, "text": "No no you get in so that's by far.", "start": 1088.525, "speaker": "Bill"}, {"confidence": 0.92, "end": 1103.253, "track": 1, "text": "I take is by far the biggest challenges hydrated organization to make that my shift because once they do it and I've seen this happen with the light bulbs go off and then go oh my gosh I get it.", "start": 1092.215, "speaker": "Bill"}, {"confidence": 0.92, "end": 1107.67, "track": 1, "text": "I'm not I'm not I'm not trying to report on,", "newpara": true, "start": 1103.392, "speaker": "Bill"}, {"confidence": 0.92, "end": 1116.84, "track": 1, "text": "the time of my 6-year graduation rate I'm trying to predict what my 6-year graduation will be next year and understand the data and the variables that might impact at so I can actually,", "start": 1107.532, "speaker": "Bill"}, {"confidence": 0.93, "end": 1125.318, "track": 1, "text": "prevent students from dropping out prevent students from staying longer it's just that once you can make that mind shift everything else Falls in place.", "start": 1116.6, "speaker": "Bill"}, {"confidence": 0.97, "end": 1132.295, "track": 2, "text": "So it's a mindset shift obviously amongst the people in the organization.", "newpara": true, "start": 1125.211, "speaker": "Cory"}, {"confidence": 0.92, "end": 1135.474, "track": 2, "text": "But there's there's something I feel like might be sort of.", "start": 1132.223, "speaker": "Cory"}, {"confidence": 0.92, "end": 1148.483, "track": 2, "text": "Missing and I think I think that's where it where you spent probably a lot of time as high as a business practitioner of you know whether I'm up you know a college counselor and you talk about graduation rates are high school whatever I'm trying to figure out how to improve that.", "start": 1135.444, "speaker": "Cory"}, {"confidence": 0.93, "end": 1153.903, "track": 2, "text": "Shifting from hey I can tell somebody in it that I want to report.", "newpara": true, "start": 1148.49, "speaker": "Cory"}, {"confidence": 0.84, "end": 1161.535, "track": 2, "text": "Just so I can look at it is it is a much simpler Argus more Jermaine thing that I T and R and R.", "newpara": true, "start": 1154.036, "speaker": "Cory"}, {"confidence": 0.87, "end": 1175.29, "track": 2, "text": "Are even our data being are dbas if I have been they've been skilled to to achieve right but to shift and start to say hey I need to understand how to predict these things.", "newpara": true, "start": 1161.535, "speaker": "Cory"}, {"confidence": 0.94, "end": 1186.437, "track": 2, "text": "That's that's organizationally a very big challenge to go from Pam and I have business Acumen that I think right hypotheses about like I think this is might be influencers,", "newpara": true, "start": 1175.609, "speaker": "Cory"}, {"confidence": 0.91, "end": 1197.253, "track": 2, "text": "how do you like it's besides just the mindset that somebody says have want to predict versus go over the review mirror what are the what are the big things that organizationally they have to do to,", "start": 1186.245, "speaker": "Cory"}, {"confidence": 0.8, "end": 1201.027, "track": 2, "text": "actually an able when they had the light bulbs go off.", "start": 1197.121, "speaker": "Cory"}, {"confidence": 0.94, "end": 1210.076, "track": 2, "text": "How do you get them organization to be able to respond to those new kinds of requests as new kinds of your ways of running a business.", "newpara": true, "start": 1201.141, "speaker": "Cory"}, {"confidence": 0.89, "end": 1218.97, "track": 1, "text": "Remind me to explain to you is so simple that it's really hard to understand why every doesn't do it cuz it companies who do this.", "newpara": true, "start": 1210.377, "speaker": "Bill"}, {"confidence": 0.94, "end": 1229.834, "track": 1, "text": "What's a made that this this shift execution is simple and what we focus in on his what are your company's key business initiative the next 12 to 18 months.", "start": 1219.259, "speaker": "Bill"}, {"confidence": 0.93, "end": 1238.8, "track": 1, "text": "Are you focused on increasing stamps for sale his focus on improving quality of care in a hospital you report trying to improve on-time delivery if your logistics company.", "start": 1230.207, "speaker": "Bill"}, {"confidence": 0.9, "end": 1248.348, "track": 1, "text": "What are you trying to achieve in the business I might that's a starting point in the reason why that's an important turning point because because there's money attached to that if I can reduce.", "start": 1238.938, "speaker": "Bill"}, {"confidence": 0.85, "end": 1254.784, "track": 1, "text": "L does late deliveries by 10% to some company that may be worth 100 to 200 million dollars a year.", "start": 1248.775, "speaker": "Bill"}, {"confidence": 0.91, "end": 1264.344, "track": 1, "text": "But that's a lot of money that's a lot of money so it has to start with the business conversation of what's important to business cuz if you don't have that.", "start": 1255.037, "speaker": "Bill"}, {"confidence": 0.89, "end": 1274.145, "track": 1, "text": "It's nearly impossible to figure out how to monetize your data analytics if you don't know what problem trying to solve\nwe take it one step further let's see your problem is.", "start": 1264.549, "speaker": "Bill"}, {"confidence": 0.95, "end": 1283.91, "track": 1, "text": "Customer customer retention you got a backup retention problem and you're trying to find a way to improve attention by 5% and it's worth something dollar amount the organization.", "start": 1274.656, "speaker": "Bill"}, {"confidence": 0.96, "end": 1293.771, "track": 1, "text": "What we then do is we work with the business stakeholders to identify the decisions they need to make in order to support customer retention.", "newpara": true, "start": 1284.613, "speaker": "Bill"}, {"confidence": 0.94, "end": 1302.928, "track": 1, "text": "It's so for example they will say we got to make decisions regarding which customers are at risk and oh by the way now that you saw the flag what customers are at risk.", "newpara": true, "start": 1294.534, "speaker": "Bill"}, {"confidence": 0.93, "end": 1310.987, "track": 1, "text": "What's the predicted value of each of those customers if I have a customer who is at risk who's predicted value to the organization is negative I might want to let them go.", "start": 1303.235, "speaker": "Bill"}, {"confidence": 0.95, "end": 1326.37, "track": 1, "text": "I need to make a decision about what what kind of offers do I give them in what channels do I reach them through and what time of day and how do I retarget at right so all the sudden if you focus on the decisions if you focus on the decisions.", "start": 1311.432, "speaker": "Bill"}, {"confidence": 0.94, "end": 1336.117, "track": 1, "text": "The data science team knows how to optimize decisions you want to flag at risk customers the data science he will help you do it.", "start": 1326.689, "speaker": "Bill"}, {"confidence": 0.96, "end": 1347.997, "track": 1, "text": "They will help you figure out and buy the business takeovers have to be involved in that process throughout cuz it's a very key aspect of that process and it's built on this very simple definition of what is data science.", "start": 1336.249, "speaker": "Bill"}, {"confidence": 0.84, "end": 1354.252, "track": 1, "text": "Here's my definition data science I share with my students and the exactly so I get into these workshops.", "start": 1348.339, "speaker": "Bill"}, {"confidence": 0.97, "end": 1363.578, "track": 1, "text": "Data science is about identifying those variables in metrics that might be better predictors of performance.", "start": 1354.529, "speaker": "Bill"}, {"confidence": 0.94, "end": 1366.577, "track": 1, "text": ". that's it.", "newpara": true, "start": 1364.744, "speaker": "Bill"}, {"confidence": 0.93, "end": 1378.727, "track": 1, "text": "What are using machine learning supervisor on supervised or neural networks or whatever that's all I'm trying to do is to find variables and metrics that might be better predictions performance if I know.", "start": 1367.112, "speaker": "Bill"}, {"confidence": 0.92, "end": 1387.68, "track": 1, "text": "What decisions are trying to support and I've got a data scientist in collaboration with the business team to brainstorm what day that they might need I've got a winning combination.", "start": 1378.908, "speaker": "Bill"}, {"confidence": 0.87, "end": 1393.509, "track": 1, "text": "Let me let me kind of rooster going to log on this topic let me take you to an exercise to take my students,", "start": 1387.933, "speaker": "Bill"}, {"confidence": 0.92, "end": 1403.664, "track": 1, "text": "destroyed that the power of thinking like a data scientist so I take my my MBA students I say okay you've been hired by United Airlines sorry it was only job available it was either that or be homeless.", "start": 1393.54, "speaker": "Bill"}, {"confidence": 0.96, "end": 1413.333, "track": 1, "text": "So and your first job your first job is to forecast how many passengers are going to fly from San Francisco to Paris next month.", "start": 1403.929, "speaker": "Bill"}, {"confidence": 0.87, "end": 1419.108, "track": 1, "text": "And then I say what date of mind you need might be in the key phrase not playing might in a second here,", "newpara": true, "start": 1414.103, "speaker": "Bill"}, {"confidence": 0.95, "end": 1431.547, "track": 1, "text": "what day did Mike Zunino to make that forecast this I break them into groups of three or four and they they break off and they kicked there Post-it notes in there and their chart there and their brainstorming data on there in about 10 minutes or so I bring them all back,", "start": 1419.108, "speaker": "Bill"}, {"confidence": 0.86, "end": 1439.376, "track": 1, "text": "share with me what data you might need to know to make that forecast and always start talking the same way well how many people flew last month,", "start": 1431.481, "speaker": "Bill"}, {"confidence": 0.94, "end": 1451.917, "track": 1, "text": "for the last 12 months into the same month a year ago same month two years ago and I flew by day by time of day but in all the kind of transactional foundational stuff by the way most that transaction the foundations of his phone here.", "start": 1439.311, "speaker": "Bill"}, {"confidence": 0.94, "end": 1461.28, "track": 1, "text": "Sorry that you already have it been doing reports on it for 4 years if not decades then there's this kind of this pause and you can literally start seeing the light bulbs go off.", "start": 1452.17, "speaker": "Bill"}, {"confidence": 0.91, "end": 1470.509, "track": 1, "text": "And some of those say well what's the exchange rate hasn't changed in the last 12 months and somebody will say well you know how many weekends in a month how many days in a month early holidays in the month.", "start": 1461.574, "speaker": "Bill"}, {"confidence": 0.91, "end": 1476.296, "track": 1, "text": "Are there any special events going on in Paris it somebody else will say are there any strikes,", "start": 1470.654, "speaker": "Bill"}, {"confidence": 0.91, "end": 1488.41, "track": 1, "text": "plan in Paris in and what was the last terrorist attack and how many Google searches were there on price of the tickets at how many Pinterest pins were there on hotels of all these different data sources,", "start": 1476.122, "speaker": "Bill"}, {"confidence": 0.94, "end": 1497.64, "track": 1, "text": "that might be useful might be in the key phrase you want to capture as many ideas as possible cuz we don't know for certain which variables might be the most predictive.", "start": 1488.387, "speaker": "Bill"}, {"confidence": 0.92, "end": 1506.311, "track": 1, "text": "The people who will then tell you which data sources are the most valuable are the most predictive are the ones that you're going to give you the most insides of a data scientist.", "start": 1498.146, "speaker": "Bill"}, {"confidence": 0.94, "end": 1519.303, "track": 1, "text": "And I'll go through the do all their magic to figure out which of 50 different neural network Technologies me using to mine too deep learn this technology mildew machine right and they will come back and say all these are the five or six most predictive variables.", "newpara": true, "start": 1506.612, "speaker": "Bill"}, {"confidence": 0.92, "end": 1532.836, "track": 1, "text": "That's what they do so when you combine the business stakeholders let them brainstorm what day that they might need with a date of society will tell you which data source attraction was predictive you have a winning combination.", "newpara": true, "start": 1520.391, "speaker": "Bill"}, {"confidence": 0.91, "end": 1545.719, "track": 1, "text": "And you have results not on you have better results but you have the most difficult thing to achieve in the big day today to science conversation is you now have business stakeholder buy-in.", "start": 1533.269, "speaker": "Bill"}, {"confidence": 0.9, "end": 1553.038, "track": 0, "text": "No that's that's that's amazing but that's great stuff there it sounds like it what you're saying is.", "newpara": true, "start": 1546.645, "speaker": "Thomas"}, {"confidence": 0.95, "end": 1567.724, "track": 0, "text": "It's a team sport right data science and you know coming together to find out okay what the business problem is and then one of these factors I mean it's not it's not just a hey we need to salt and you give it to your data scientist and they go off in a room don't talk to anybody and close the door I mean is that,", "start": 1552.978, "speaker": "Thomas"}, {"confidence": 0.28, "end": 1568.571, "track": 0, "text": "show me nuts.", "start": 1567.538, "speaker": "Thomas"}, {"confidence": 0.9, "end": 1577.693, "track": 0, "text": "That's kind of what we've said about Developers for a long time you know where we started getting into this more Agile development and you'll get everybody in a room and talking together and really trying to figure these things out together.", "start": 1568.56, "speaker": "Thomas"}, {"confidence": 0.89, "end": 1583.786, "track": 1, "text": "Yeah it's it's it is certainly a team sport the client we see that have the most success.", "newpara": true, "start": 1578.036, "speaker": "Bill"}, {"confidence": 0.93, "end": 1589.561, "track": 1, "text": "And by the way the date that the marginal Improvement is dramatic,", "start": 1584.219, "speaker": "Bill"}, {"confidence": 0.88, "end": 1596.387, "track": 1, "text": "3 to 5% were talking 3 to 5x are the organizations were the business and the data scientist collaborate close,", "start": 1589.52, "speaker": "Bill"}, {"confidence": 0.96, "end": 1604.5, "track": 1, "text": "and the under and by the way that's the real key is it can we get the business stakeholders to really understand that analytics is a business discipline,", "start": 1596.292, "speaker": "Bill"}, {"confidence": 0.86, "end": 1608.724, "track": 1, "text": "episode discipline as accounting and Finance in economics are.", "start": 1604.362, "speaker": "Bill"}, {"confidence": 0.93, "end": 1626.15, "track": 1, "text": "We're not going to make you learn you know it's how to program an inmail parole or job RR python no we're not going to make you do that but we want to be part of this process because we need to understand the decisions you're making a bag of those decisions we need to understand what data source are most valuable if you don't understand in the date,", "start": 1608.851, "speaker": "Bill"}, {"confidence": 0.9, "end": 1629.756, "track": 1, "text": "these are the models were coming up with effective enough for you to act on.", "start": 1625.995, "speaker": "Bill"}, {"confidence": 0.91, "end": 1632.243, "track": 0, "text": "Also.", "newpara": true, "start": 1630.249, "speaker": "Thomas"}, {"confidence": 0.93, "end": 1644.039, "track": 0, "text": "I follow I follow a lot of kind of what you're saying and I chill more to the data engineer side so you know I'm on the technologist kind of working with the check and that's where I start off in my career but one of the things that I've always.", "start": 1632.19, "speaker": "Thomas"}, {"confidence": 0.81, "end": 1653.522, "track": 0, "text": "Don't really really great about what you're saying is like you even for an engineer you need to understand what the business value is it so we can all see a lot of the content I followed you know the blocks that you put in.", "start": 1644.04, "speaker": "Thomas"}, {"confidence": 0.94, "end": 1667.024, "track": 0, "text": "You really publishing a lot but I mean it's just it's really helpful for the data engineer to say how you even need to know how to explain the problems right so you want you want to use all these cool Technologies you want to be apart you know what's going on with her be with it,", "start": 1653.408, "speaker": "Thomas"}, {"confidence": 0.92, "end": 1674.782, "track": 0, "text": "Community but to be able to get your project sold and get your project sign off on you have to explain why this business value to it so.", "start": 1667.006, "speaker": "Thomas"}, {"confidence": 0.89, "end": 1683.94, "track": 1, "text": "Yeah you said it really wants is a team sport right I got to have a data engineer and a data architect and knows how to go get the data and put it into an architecture allows me to go,", "newpara": true, "start": 1674.782, "speaker": "Bill"}, {"confidence": 0.89, "end": 1696.402, "track": 1, "text": "Hazel E access it if my data science thing I did decide to do that then they're not doing it with it but they need to do and what is a data science they decide to do the single most important thing they do is they quantify cause and effect,", "start": 1683.856, "speaker": "Bill"}, {"confidence": 0.92, "end": 1704.394, "track": 1, "text": "are they build the analytic models that basically tell you which variables are most predictive they quantify cause-and-effect they measure goodness of fit the only do two things right,", "start": 1696.397, "speaker": "Bill"}, {"confidence": 0.93, "end": 1713.829, "track": 1, "text": "to really hard thing to do but they do it I want I want my data engineers and Architects helping to build the right platform getting the right data for more data visualization people they're using,", "start": 1704.311, "speaker": "Bill"}, {"confidence": 0.93, "end": 1728.31, "track": 1, "text": "pop tools like Tableau and you're my favorite ggplot2 and trying to figure out what date is moving together I want a human-centered design person involved in the team who is going to help me understand how the analytic results are going to be rendered to my users to make an actionable,", "start": 1713.595, "speaker": "Bill"}, {"confidence": 0.98, "end": 1729.789, "track": 1, "text": "it's a team sport.", "start": 1728.077, "speaker": "Bill"}, {"confidence": 0.95, "end": 1745.629, "track": 1, "text": "And so when I start thinking about that it's just like a baseball team right I can't have my short stop playing first base pitching and catching it isn't going to work right different skill sets different people so it's no different for the data science team it's a team sport of which the business people,", "start": 1729.933, "speaker": "Bill"}, {"confidence": 0.86, "end": 1751.968, "track": 1, "text": "have to be on the team as well as any other business constituents God have them on the team.", "start": 1745.455, "speaker": "Bill"}, {"confidence": 0.9, "end": 1763.458, "track": 0, "text": "Yeah I know and like I was saying you know a lot of the stuff that you put you know you're with your blogs and everything you know I try to encourage people whenever I'm talking to you what can I do know a lot of people ask you know how.", "newpara": true, "start": 1752.221, "speaker": "Thomas"}, {"confidence": 0.92, "end": 1773.871, "track": 0, "text": "Other developers are dating Engineers they're saying okay what should I do what kind of my role and I kind of basically put it down to three different roles if we think about you everyday,", "start": 1763.35, "speaker": "Thomas"}, {"confidence": 0.92, "end": 1783.486, "track": 0, "text": "scientist in each one has their own lane or some weed over but I still think there's value and I think you're for the date engineer you do need to know and understand.", "start": 1773.98, "speaker": "Thomas"}, {"confidence": 0.92, "end": 1785.595, "track": 0, "text": "The Y of the project.", "newpara": true, "start": 1783.594, "speaker": "Thomas"}, {"confidence": 0.93, "end": 1795.143, "track": 0, "text": "Did you continue to have some somewhat of an understanding about what that data scientist is going to do and then also the data visualization person too but I mean you know a lot of the content that you're.", "start": 1785.517, "speaker": "Thomas"}, {"confidence": 0.87, "end": 1800.882, "track": 0, "text": "That you're doing with your blog and stuff I mean.", "newpara": true, "start": 1795.204, "speaker": "Thomas"}, {"confidence": 0.9, "end": 1809.95, "track": 1, "text": "Haha well I understand that God gave me two ears and one mouth I listen to our customers.", "newpara": true, "start": 1800.582, "speaker": "Bill"}, {"confidence": 0.92, "end": 1816.524, "track": 1, "text": "Today they tell me my steps only only interesting because of my customers are interested.", "start": 1810.299, "speaker": "Bill"}, {"confidence": 0.94, "end": 1828.133, "track": 1, "text": "I will be honest with you anymore almost all of the topics that I can come up with come from customer conversations questions they ask problems I've got it sits if you if you stay close to the customers.", "start": 1816.638, "speaker": "Bill"}, {"confidence": 0.97, "end": 1834.046, "track": 1, "text": "And you're really trying to help them and by the way sincerely in my heart I want my customer be successful.", "start": 1828.65, "speaker": "Bill"}, {"confidence": 0.91, "end": 1842.315, "track": 1, "text": "I want to have success with it be successful and you know I am by the way I want to be late to that success let them know that hey Bill schmarzo help me be successful.", "start": 1834.329, "speaker": "Bill"}, {"confidence": 0.94, "end": 1850.673, "track": 1, "text": "I want if you listen to your customers they will tell you what they need to also tell you what they want and I'm less interested in what they want.", "start": 1842.568, "speaker": "Bill"}, {"confidence": 0.95, "end": 1857.962, "track": 1, "text": "I want to focus on what you need so you'll get a lot of cuz I think this is what happened in the early days of big data right you went out and you went out and bought her do.", "start": 1850.86, "speaker": "Bill"}, {"confidence": 0.94, "end": 1870.503, "track": 1, "text": "And you threw some data on it and you hired some data scientist righty put on some stories and some servers because that's what the customer wanted to do and the technology committee was more than happy to blindly follow along and do that.", "start": 1858.125, "speaker": "Bill"}, {"confidence": 0.94, "end": 1877.984, "track": 1, "text": "That's not that's what they wanted but not what they needed what they needed was somebody to come in and help them figure out how my going to monetize estate.", "start": 1870.93, "speaker": "Bill"}, {"confidence": 0.94, "end": 1890.561, "track": 1, "text": "Holiday I take this data to you to make better decisions how am I going to improve retention and attribution and acquisition how am I going to improve the business we we we didn't listen.", "start": 1878.243, "speaker": "Bill"}, {"confidence": 0.92, "end": 1897.208, "track": 1, "text": "Well because we we we listen to what they wanted and we blindly fell alongside them instead of taking the time to be a,", "newpara": true, "start": 1890.748, "speaker": "Bill"}, {"confidence": 0.8, "end": 1900.933, "track": 1, "text": "business partner and say no you said that you just may be what you want.", "start": 1897.268, "speaker": "Bill"}, {"confidence": 0.93, "end": 1914.508, "track": 1, "text": "Right here is what you need is this and we focus on what they need and what they're trying to accomplish the whole thing the whole conversation changes my my relations with most of my clients are wonderful because we talk about their business.", "start": 1901.168, "speaker": "Bill"}, {"confidence": 0.9, "end": 1925.973, "track": 2, "text": "They also makes me laugh because of what you just said there's made me think of one of my favorite Henry Ford quotes which is if it asked my customers what they wanted they would have told me a faster horse.", "newpara": true, "start": 1914.244, "speaker": "Cory"}, {"confidence": 0.88, "end": 1933.947, "track": 2, "text": "Bright-eyed science and it's it's kind of it right so you had these customers that you know because everybody the norm was.", "newpara": true, "start": 1926.514, "speaker": "Cory"}, {"confidence": 0.94, "end": 1939.673, "track": 2, "text": "Hey Technologies going to solve the problem just invest in the latest new technology you know that's what the weird,", "start": 1933.803, "speaker": "Cory"}, {"confidence": 0.95, "end": 1951.974, "track": 2, "text": "we were asking for him that's what the technology Community gave them was basically Faster Horses right you could with Hadoop you could handle larger data sets and you could ever Handle With Us sequel database right but I like where you're going.", "start": 1939.512, "speaker": "Cory"}, {"confidence": 0.98, "end": 1957.256, "track": 2, "text": "It wasn't necessarily what they needed which was how do you connect.", "start": 1951.89, "speaker": "Cory"}, {"confidence": 0.91, "end": 1972.826, "track": 2, "text": "Using the technology to dry the business outcomes I got to ask you work in a Consulting organization right that goes out and then I'm guessing right part of what Consulting does you have smart people can come in and deliver on the things that you're evangelizing,", "newpara": true, "start": 1957.293, "speaker": "Cory"}, {"confidence": 0.98, "end": 1981.443, "track": 2, "text": "what are the what are the specific sort of like offerings and Consulting like how do they how does.", "start": 1972.67, "speaker": "Cory"}, {"confidence": 0.9, "end": 1993.269, "track": 2, "text": "How does a customer engage with you like what is an engagement look like in terms of specific like always with you and what's the process for.", "newpara": true, "start": 1981.551, "speaker": "Cory"}, {"confidence": 0.94, "end": 1998.803, "track": 2, "text": "Taking advantage of what you're talking about in as it relates to actual Consulting offers.", "start": 1993.143, "speaker": "Cory"}, {"confidence": 0.79, "end": 2000.948, "track": 1, "text": "Sure so.", "newpara": true, "start": 1999.65, "speaker": "Bill"}, {"confidence": 0.94, "end": 2010.827, "track": 1, "text": "Customers come to us in with one of two problems then this isn't this is generally speaking there is little more to this the customers have one or two problems.", "start": 2001.333, "speaker": "Bill"}, {"confidence": 0.93, "end": 2018.452, "track": 1, "text": "Either they're trying to do data monetization and they have no idea what the hell they're doing or their data Lakes are not performing.", "start": 2011.086, "speaker": "Bill"}, {"confidence": 0.76, "end": 2023.182, "track": 1, "text": "Invited over to someone related fact they're very relatable they're coming from two different perspectives.", "start": 2018.789, "speaker": "Bill"}, {"confidence": 0.95, "end": 2036.63, "track": 1, "text": "And so it was the second I hit first as we have a lot of organizations that have built data Lakes Mobile Data lakes and they're not get any value out of it and the first thing I say is that I hear the word I hear the word data Lakes I see you got a problem.", "start": 2023.386, "speaker": "Bill"}, {"confidence": 0.93, "end": 2049.838, "track": 1, "text": "Cuz you're replicating the same problem we had with data warehouses we didn't have one day to Warehouse we have multiple data warehouses in data Marts and spread Martin we created this this environment with the business we taught the business users to trust a data,", "start": 2036.793, "speaker": "Bill"}, {"confidence": 0.93, "end": 2059.08, "track": 1, "text": "the biggest the biggest flaw in data warehousing is it we taught users not to trust the data because the data was dependent upon which it came from.", "start": 2049.892, "speaker": "Bill"}, {"confidence": 0.85, "end": 2065.486, "track": 1, "text": "Huge mistake right we set we sent data warehousing back a decade because we couldn't standardize and by the way,", "start": 2059.531, "speaker": "Bill"}, {"confidence": 0.78, "end": 2072.6, "track": 1, "text": "we couldn't respond quick enough in a data warehouse the customers business data needs we just quit here to build a schema first,", "start": 2065.45, "speaker": "Bill"}, {"confidence": 0.92, "end": 2083.879, "track": 1, "text": "Hina architected for trying to make a stupid thing one on on databases that were designed for transactional systems like analytical systems but that's a topic for another series of beers and podcast but so,", "start": 2072.528, "speaker": "Bill"}, {"confidence": 0.96, "end": 2093.812, "track": 1, "text": "problem number one is customers have a data Lake and they don't know what to do with it. It doesn't scale it doesn't meet their business needs and so we have a whole series of offerings are really guides.", "start": 2083.82, "speaker": "Bill"}, {"confidence": 0.85, "end": 2101.119, "track": 1, "text": "Advisory service and assessment a proof of technology did really design a take and their data Lake from a.", "newpara": true, "start": 2093.807, "speaker": "Bill"}, {"confidence": 0.83, "end": 2109.352, "track": 1, "text": "Stack of technology to an elastic data platform to a Clarity value creation platform I call that last one day too late 3.0.", "start": 2101.33, "speaker": "Bill"}, {"confidence": 0.85, "end": 2113.216, "track": 1, "text": "We are data Lake now is a collaborative value creation plate platform,", "start": 2109.49, "speaker": "Bill"}, {"confidence": 0.93, "end": 2124.512, "track": 1, "text": "that's a repository for your data and analytics digital assets but I can reuse across multiple use cases that I can monetize across multiple use cases so entry point number one is the data light.", "start": 2113.276, "speaker": "Bill"}, {"confidence": 0.92, "end": 2128.389, "track": 1, "text": "They got a data Lake it's not working how do we help.", "start": 2124.639, "speaker": "Bill"}, {"confidence": 0.89, "end": 2136.278, "track": 1, "text": "We got some you got some verses to help them do that we can take them from where they are to where they need to be in order to be able to drive no monetization opportunities.", "start": 2128.744, "speaker": "Bill"}, {"confidence": 0.92, "end": 2147.455, "track": 1, "text": "The other conversation is really around monetization how do I monetize my data and this is an interesting one guys because we're typically starts off with his I'm trying to sell my data.", "newpara": true, "start": 2137.084, "speaker": "Bill"}, {"confidence": 0.97, "end": 2148.981, "track": 1, "text": "Wrong approach.", "start": 2147.714, "speaker": "Bill"}, {"confidence": 0.93, "end": 2159.588, "track": 1, "text": "And I'm going to go old-school back on you and when I go back to Adam Smith in his book Wealth of Nations written in 1776 they have a Smith and that book talks about value Creation in two ways.", "newpara": true, "start": 2149.655, "speaker": "Bill"}, {"confidence": 0.93, "end": 2168.12, "track": 1, "text": "One way he talks about his called value in exchange that is what is an asset worth in my ability to sell it or barter or somebody else.", "start": 2160.008, "speaker": "Bill"}, {"confidence": 0.88, "end": 2173.09, "track": 1, "text": "And when people start thinking data monetization the first thing they're thinking about it what can I sell my data for.", "start": 2168.379, "speaker": "Bill"}, {"confidence": 0.93, "end": 2188.72, "track": 1, "text": "Companies are in the date of business most companies are you just got to come he's not a database that you want to scare the pants off just say one word you say Equifax right and they turn all pale white know you don't want to be in the business of monetizing of value through through Exchange.", "newpara": true, "start": 2174.503, "speaker": "Bill"}, {"confidence": 0.95, "end": 2197.096, "track": 1, "text": "Adam Smith also talked about creating value through use how do you use your data to drive better business outcomes.", "start": 2189.267, "speaker": "Bill"}, {"confidence": 0.84, "end": 2203.886, "track": 1, "text": "That's what we focus in on in order to do that to have that data monetization conversation around value in use.", "start": 2197.583, "speaker": "Bill"}, {"confidence": 0.95, "end": 2212.648, "track": 1, "text": "It has to start with key business initiatives it has to start with use cases it has to start with what decisions are you trying to make what business outcomes you trying to optimize.", "start": 2204.061, "speaker": "Bill"}, {"confidence": 0.83, "end": 2217.893, "track": 1, "text": "So I can fold them from his ability to take to take either one of those tracks.", "start": 2212.865, "speaker": "Bill"}, {"confidence": 0.94, "end": 2230.555, "track": 1, "text": "But you all are designed to get us to a point where we can take and monetize our data on a platform of data like platform it's elastic scale-out and allows it to create this value this cloudy value creation platform.", "start": 2218.11, "speaker": "Bill"}, {"confidence": 0.94, "end": 2243.865, "track": 1, "text": "By the way that turned out cloudy value creation platform isn't my term that came from the series a conversation with the IMF against smart customers asking SmartThings demanding SmartThings we all get a chance to learn from them.", "start": 2231.09, "speaker": "Bill"}, {"confidence": 0.94, "end": 2252.572, "track": 2, "text": "That's awesome yeah actually it's interesting you said that that one of the things that organizations find out is that their data may actually be.", "newpara": true, "start": 2243.661, "speaker": "Cory"}, {"confidence": 0.92, "end": 2266.621, "track": 2, "text": "Less valuable than they think in terms of when they think in terms of exchange I was blown away I spent the last three weeks and in Asia and and and the southeast and Southeast Asian in Australia where was a ton of customers.", "start": 2252.434, "speaker": "Cory"}, {"confidence": 0.96, "end": 2275.815, "track": 2, "text": "That had that exact thing in mind which is the the value exchange conversation do you actually see other companies that are making money.", "start": 2266.471, "speaker": "Cory"}, {"confidence": 0.94, "end": 2282.509, "track": 2, "text": "And that sort of their value of the data is in the exchange of where they're selling it cuz I get asked that.", "newpara": true, "start": 2276.056, "speaker": "Cory"}, {"confidence": 0.86, "end": 2286.553, "track": 2, "text": "Constantly by cool if I collected the state of how who can I sell it to.", "start": 2282.365, "speaker": "Cory"}, {"confidence": 0.94, "end": 2301.077, "track": 1, "text": "Selling data is a very specialized business and companies like you know AC Nielsen and and Axiom and Equifax and such they they they are geared to do that.", "newpara": true, "start": 2287.593, "speaker": "Bill"}, {"confidence": 0.82, "end": 2305.764, "track": 1, "text": "They have processes for bringing date in cleansing at a line in it.", "start": 2301.234, "speaker": "Bill"}, {"confidence": 0.92, "end": 2319.284, "track": 1, "text": "Packaging acting at Salesforce in and out of cell data they got markings on a market data they know how to do Version Control and upgrades and got in most cases they have Security in in in a liability coverage and things like that regulatory coverage and such,", "start": 2305.939, "speaker": "Bill"}, {"confidence": 0.86, "end": 2322.307, "track": 1, "text": "that's not something your average company give it a pickup.", "start": 2319.345, "speaker": "Bill"}, {"confidence": 0.92, "end": 2337.053, "track": 1, "text": "Killer special ice companies in when a company talk about one of my toys my data is like will give a Salesforce you know how you're going to price it how you going to what kind of upgrade you going to have right what were some Main and stream look like and they have no idea because they're not in that business so so.", "start": 2322.885, "speaker": "Bill"}, {"confidence": 0.91, "end": 2346.133, "track": 1, "text": "End of the day your data is actually worth a lot more to you than it is to them because I thought time you remove all the pii and HIPAA information on your data,", "start": 2337.162, "speaker": "Bill"}, {"confidence": 0.95, "end": 2355.549, "track": 1, "text": "it's interesting but it's more interesting you before I know what behaviors Bill schmarzo is doing let's just sit in Amazon's world for a second.", "start": 2346.224, "speaker": "Bill"}, {"confidence": 0.96, "end": 2366.077, "track": 1, "text": "Amazon has done a masterful job of learning everything they can about every individual customer I just masterful and.", "newpara": true, "start": 2356.289, "speaker": "Bill"}, {"confidence": 0.94, "end": 2375.764, "track": 1, "text": "They they lie bridge that to be able to predict what products you might want so I can show you when you're on my side what products you might also want to buy.", "newpara": true, "start": 2366.733, "speaker": "Bill"}, {"confidence": 0.92, "end": 2386.664, "track": 1, "text": "Great right thing they've done that collaborative filtering if there was a match for that for a long time but they've gone one step further like the one of the things that they do and now they have these Depots in certain zip codes.", "start": 2376.203, "speaker": "Bill"}, {"confidence": 0.92, "end": 2396.321, "track": 1, "text": "And they can put products in those Depots with a high degree of confidence is somebody in that zip codes going to buy that product how do they do that.", "start": 2386.935, "speaker": "Bill"}, {"confidence": 0.92, "end": 2410.67, "track": 1, "text": "The forecast at every individual customer level what products you might want in an aggregate that up and when the air condition gets to a certain level they can safely say that zip code there's enough people there they're going to want to have HP printer ink.", "start": 2396.459, "speaker": "Bill"}, {"confidence": 0.91, "end": 2420.057, "track": 1, "text": "I'm going to put printer HP printer ink into that Depot so when you order it it's going to show up you know 2 or 4 hours later or where drones are going to show up 30 minutes later right so,", "start": 2410.875, "speaker": "Bill"}, {"confidence": 0.9, "end": 2434.352, "track": 1, "text": "that that very detail profiles is something organizations can do themselves that they can't give to somebody else without violating pie and HIPAA and other sort of rules so the real value in their data isn't the overall market trends.", "start": 2419.913, "speaker": "Bill"}, {"confidence": 0.86, "end": 2438.715, "track": 1, "text": "It's the bat individual level I got like to see the big date is not about big.", "start": 2434.503, "speaker": "Bill"}, {"confidence": 0.92, "end": 2454.068, "track": 1, "text": "Big data is about small it's about as learning as much as possible about each individual customer their behaviors are Tennessee's repent cities are in collisions are interest or passions relations or associations learn as much as possible about them so I can better serve them.", "start": 2439.088, "speaker": "Bill"}, {"confidence": 0.95, "end": 2461.844, "track": 0, "text": "No that's great bill I mean that's what you're talking about really when you're talking about you know being able to make sure that you have,", "newpara": true, "start": 2454.651, "speaker": "Thomas"}, {"confidence": 0.92, "end": 2471.614, "track": 0, "text": "the weather be printer ink or wherever you need it in that Regional location because there might be a run on it it's what we talked about a long time ago you know when your business classes with Just in Time Manufacturing right but,", "start": 2461.61, "speaker": "Thomas"}, {"confidence": 0.86, "end": 2479.486, "track": 0, "text": "to the suppliers and so you're one of the big things in the last 2 or 3 years is not hey man I want a drone to be able to deliver things right you know.", "start": 2471.633, "speaker": "Thomas"}, {"confidence": 0.91, "end": 2491.925, "track": 0, "text": "How's the regulations going to happen you know that they going to allow for drones to deliver your my Amazon packages all the way from Seattle to where I live in Alabama.", "start": 2479.517, "speaker": "Thomas"}, {"confidence": 0.38, "end": 2492.424, "track": 1, "text": "Yeah yeah.", "newpara": true, "start": 2489.672, "speaker": "Bill"}, {"confidence": 0.8, "end": 2499.328, "track": 0, "text": "They're right in my minivan other Concepts and you take out the drones other Concepts were they have.", "newpara": true, "start": 2492.521, "speaker": "Thomas"}, {"confidence": 0.89, "end": 2508.967, "track": 0, "text": "You know these kiosks or Mobile kiosk is where you're able to go and see you going to be able to pick up your packages you know in your city especially least dense cities.", "start": 2499.191, "speaker": "Thomas"}, {"confidence": 0.89, "end": 2517.452, "track": 0, "text": "New York City for example you know they would almost kind of like how you have food trucks that have Amazon trucks right know what to put on there if nobody needs.", "newpara": true, "start": 2509.099, "speaker": "Thomas"}, {"confidence": 0.91, "end": 2528.785, "track": 0, "text": "The printer ink are nobody needs new headphones why would you put that on the you're wasting that product space and it's more than the competitiveness that you see you know when they talk about shelf space in.", "start": 2517.458, "speaker": "Thomas"}, {"confidence": 0.92, "end": 2538.598, "track": 0, "text": "Grocery store supermarkets or whatever they are so you have to be able to know what that what to put on the product Jeff know the business value right for it to.", "newpara": true, "start": 2528.972, "speaker": "Thomas"}, {"confidence": 0.9, "end": 2551.012, "track": 2, "text": "So was going to what are the what are things when you talk about like that connecting the\nthe business value in that Consulting process.", "newpara": true, "start": 2541.086, "speaker": "Cory"}, {"confidence": 0.87, "end": 2552.214, "track": 2, "text": "How are you.", "newpara": true, "start": 2551.019, "speaker": "Cory"}, {"confidence": 0.92, "end": 2570.524, "track": 2, "text": "Are you seeing that the students that come through your MBA program are they like are they are best like your Best Contacts whenever you'd like are they going out into the industry and that you know you're creating like this this this Army folks that are connecting business value or you seeing other folks like besides just the ones you talk to help get the light ball go off,", "start": 2552.088, "speaker": "Cory"}, {"confidence": 0.98, "end": 2572.573, "track": 2, "text": "how are people starting to.", "start": 2570.278, "speaker": "Cory"}, {"confidence": 0.95, "end": 2582.085, "track": 2, "text": "Learn the stuff like how are they like what organizations is there some sort of like unifying Trend that you see across the people in the company that you deal with.", "start": 2572.483, "speaker": "Cory"}, {"confidence": 0.78, "end": 2584.254, "track": 2, "text": "There are actually getting this quicker.", "start": 2581.977, "speaker": "Cory"}, {"confidence": 0.9, "end": 2592.451, "track": 1, "text": "Hi man I am trying to create schmarzo private Army there's no doubt about that.", "newpara": true, "start": 2585.583, "speaker": "Bill"}, {"confidence": 0.88, "end": 2605.689, "track": 1, "text": "Tutu evangelized is the value of data in organizations in unfortunately Dave and I talk to my students after they've gone to the real world now they run into the Quagmire of the,", "start": 2592.782, "speaker": "Bill"}, {"confidence": 0.9, "end": 2614.24, "track": 1, "text": "bureaucracy of large organizations right in and to serviced and this may sound overly harsh but I've I've given up on my generation.", "start": 2605.78, "speaker": "Bill"}, {"confidence": 0.87, "end": 2622.448, "track": 1, "text": "I think that the My Generation has and my generation is the is the bi data warehouse generation.", "start": 2614.745, "speaker": "Bill"}, {"confidence": 0.94, "end": 2626.991, "track": 1, "text": "Where we were more than happy to report on what happened and thought we had achieved success.", "start": 2622.683, "speaker": "Bill"}, {"confidence": 0.9, "end": 2637.284, "track": 1, "text": "The next generation is demanding more and the Millennials and part of that is a Millennials have experienced what and what is it about,", "start": 2627.532, "speaker": "Bill"}, {"confidence": 0.91, "end": 2641.677, "track": 1, "text": "think about how their lives are driven by recommendations whether it's,", "start": 2637.381, "speaker": "Bill"}, {"confidence": 0.94, "end": 2653.599, "track": 1, "text": "Amazon or Netflix or Spotify or eHarmony or ways whatever they like their entire their entire life is now built around very detailed analytics helps them live their life better.", "start": 2641.653, "speaker": "Bill"}, {"confidence": 0.98, "end": 2662.589, "track": 1, "text": "That those experiences have changed their expectations of what they want out of a corporation and I think as those people,", "newpara": true, "start": 2654.591, "speaker": "Bill"}, {"confidence": 0.88, "end": 2669.487, "track": 1, "text": "has his Millennial start to progress up in the organization they're going to bring that to the business many cios I talk to,", "start": 2662.517, "speaker": "Bill"}, {"confidence": 0.87, "end": 2679.835, "track": 1, "text": "you're hopeless they are just marking time until I can retire now they've they rode the wave of data Rawson bi gotten and now they're more concerned about blocking,", "start": 2669.349, "speaker": "Bill"}, {"confidence": 0.89, "end": 2687.923, "track": 1, "text": "data lakes and data science and they are about promoting it sorry to be so harsh but we there's too many cios who have outlived their usefulness,", "start": 2679.685, "speaker": "Bill"}, {"confidence": 0.94, "end": 2696.48, "track": 1, "text": "in my hope is at the Millennials I pry won't be here to see an experience that but the Millennials are going to because they have a different experience a different mindset,", "start": 2687.797, "speaker": "Bill"}, {"confidence": 0.96, "end": 2702.898, "track": 1, "text": "are going to be able to really understand about the power of analytics to really help their customers be more successful.", "start": 2696.318, "speaker": "Bill"}, {"confidence": 0.95, "end": 2714.183, "track": 2, "text": "That's really I wanted to hear that the Millennials were the the best the best the best ones to help you drive it for that's that's going to make a handful of folks that are part of the show very very happy that you just said that.", "newpara": true, "start": 2702.808, "speaker": "Cory"}, {"confidence": 0.85, "end": 2720.618, "track": 2, "text": "So I got to ask someone you're teaching these classes at the exit that you said the University of San Francisco right.", "start": 2714.045, "speaker": "Cory"}, {"confidence": 0.94, "end": 2721.934, "track": 1, "text": "Yep that's right go down.", "newpara": true, "start": 2720.553, "speaker": "Bill"}, {"confidence": 0.7, "end": 2723.941, "track": 2, "text": "Yeah they got the Danse what is that.", "newpara": true, "start": 2721.634, "speaker": "Cory"}, {"confidence": 0.96, "end": 2730.323, "track": 1, "text": "Dominicans I don't know that's a good question I should know that shouldn't I.", "newpara": true, "start": 2723.671, "speaker": "Bill"}, {"confidence": 0.87, "end": 2732.24, "track": 2, "text": "The hardest question you had on the entire.", "newpara": true, "start": 2729.11, "speaker": "Cory"}, {"confidence": 0.8, "end": 2741.756, "track": 1, "text": "I got to look it up now my friend you're not going to let the dogs out I think that's like I have some sort of religious thing I got to look it up on Google really quick.", "newpara": true, "start": 2731.94, "speaker": "Bill"}, {"confidence": 0.77, "end": 2745.748, "track": 2, "text": "So I got to ask how did you so.", "newpara": true, "start": 2743.195, "speaker": "Cory"}, {"confidence": 0.91, "end": 2757.46, "track": 2, "text": "How did you how did you end up teaching that's that's an interesting I think for a lot of us at our in and technology and said if if you have a proclivity towards you know dealing with customers and speaking and.", "newpara": true, "start": 2746.127, "speaker": "Cory"}, {"confidence": 0.93, "end": 2762.406, "track": 2, "text": "Concentration lot of things that you're doing I think that a lot of a lot of us are kind of into.", "start": 2757.334, "speaker": "Cory"}, {"confidence": 0.93, "end": 2775.133, "track": 2, "text": "It feels like a it feels like a one while simultaneously a natural progression also a very weird and like almost backward one I don't know how did you how did you end up doing that.", "newpara": true, "start": 2762.664, "speaker": "Cory"}, {"confidence": 0.93, "end": 2778.738, "track": 1, "text": "Well I was I was trying to do guest lectures,", "newpara": true, "start": 2775.776, "speaker": "Bill"}, {"confidence": 0.92, "end": 2787.703, "track": 1, "text": "I'm a lot of different universities across the u.s. might my books have been adopted by many universities as part of their,", "start": 2778.756, "speaker": "Bill"}, {"confidence": 0.81, "end": 2793.046, "track": 1, "text": "both MBA programs and some of the action part of engineering program so I had sort of a natural,", "start": 2787.596, "speaker": "Bill"}, {"confidence": 0.92, "end": 2805.1, "track": 1, "text": "way to speak to people for the first book in particular kind of open the door and then I did a guest lecture at USF had a chance to meet the the fellow who is ahead of the business and,", "start": 2792.98, "speaker": "Bill"}, {"confidence": 0.96, "end": 2813.044, "track": 1, "text": "I analytics College there we hit it off well he wanted me to do a class we did a class it was very successful,", "start": 2804.968, "speaker": "Bill"}, {"confidence": 0.71, "end": 2815.658, "track": 1, "text": "Tom and desconto coffin there.", "start": 2812.918, "speaker": "Bill"}, {"confidence": 0.86, "end": 2824.924, "track": 1, "text": "It's it's been a marvelous relationship because it allows me to no no it's forces me to simplify.", "start": 2816.247, "speaker": "Bill"}, {"confidence": 0.91, "end": 2832.189, "track": 1, "text": "The students when I asked the students in the class how many people here no data warehouse is no one raises their hands.", "start": 2825.309, "speaker": "Bill"}, {"confidence": 0.95, "end": 2841.521, "track": 1, "text": "No one cares no one cares and we start asking questions about you know what is your most.", "start": 2832.514, "speaker": "Bill"}, {"confidence": 0.84, "end": 2846.274, "track": 1, "text": "Impressive experience on the internet they love how how,", "start": 2841.75, "speaker": "Bill"}, {"confidence": 0.93, "end": 2851.977, "track": 1, "text": "Amazon can tell me what I need to do or what Netflix will pick movies for me or no they they talk about there,", "start": 2846.166, "speaker": "Bill"}, {"confidence": 0.93, "end": 2863.406, "track": 1, "text": "experiences from organizations that have mastered leveraging data and analytics really improve the customer experience they understand that so they it's it's force me to think very hard about what's really important.", "start": 2851.893, "speaker": "Bill"}, {"confidence": 0.96, "end": 2869.667, "track": 1, "text": "And how do I take Concepts and simplify them to the point of an executable.", "start": 2863.899, "speaker": "Bill"}, {"confidence": 0.86, "end": 2879.949, "track": 1, "text": "Like my definition of data science right did Ida simplify that cuz of students that say what is data science and I don't want to spend 3 hours explain what data Sciences I want to explain it in 15 words or less.", "newpara": true, "start": 2869.818, "speaker": "Bill"}, {"confidence": 0.95, "end": 2888.091, "track": 1, "text": "What's supervised vs. unsupervised machine learning right I can explain that forward so you know what that's that's what I,", "start": 2880.184, "speaker": "Bill"}, {"confidence": 0.94, "end": 2895.831, "track": 1, "text": "it forces me to simplify and when you do that I think all the BS it gets in our way as technicians fall to the Wayside,", "start": 2887.977, "speaker": "Bill"}, {"confidence": 0.89, "end": 2898.553, "track": 1, "text": "and now we're focused on the heart of what's important.", "start": 2895.891, "speaker": "Bill"}, {"confidence": 0.91, "end": 2901.864, "track": 2, "text": "That's awesome bill.", "newpara": true, "start": 2898.794, "speaker": "Cory"}, {"confidence": 0.58, "end": 2904.646, "track": 0, "text": "I know and I just.", "newpara": true, "start": 2902.363, "speaker": "Thomas"}, {"confidence": 0.94, "end": 2917.884, "track": 0, "text": "Was going to read right I mean I think that's that's great it's crazy to me that you're saying that you're in these classes and you're teaching them and people don't know what a data warehouse is so I mean on the edge of a penny.", "start": 2904.599, "speaker": "Thomas"}, {"confidence": 0.88, "end": 2925.215, "track": 0, "text": "XO so just kind of wrapping up I know we're getting close to the top of the hour.", "start": 2917.752, "speaker": "Thomas"}, {"confidence": 0.84, "end": 2928.153, "track": 1, "text": "Yes sorry you got it your fault.", "newpara": true, "start": 2924.915, "speaker": "Bill"}, {"confidence": 0.85, "end": 2932.78, "track": 2, "text": "Yes it was supposed to shift gears in a rapid fire they'll be awesome.", "newpara": true, "start": 2927.854, "speaker": "Cory"}, {"confidence": 0.93, "end": 2948.705, "track": 0, "text": "Yeah so but before we didn't want to ask one just give you one more opportunity so to the big day the beard Army out there you talking about you didn't get your big date MBA Army so we got to be date of beard Army lot of focus really on the date Engineers nanotechnologist yesterday to scientist,", "newpara": true, "start": 2933.034, "speaker": "Thomas"}, {"confidence": 0.93, "end": 2955.699, "track": 0, "text": "what what would what would your core message be to tell them why it's so important in their roles to be connected to these business outcomes.", "start": 2948.513, "speaker": "Thomas"}, {"confidence": 0.93, "end": 2960.765, "track": 1, "text": "So I'm going to make a very gratuitous plug of my book Bengay to NBA.", "newpara": true, "start": 2955.85, "speaker": "Bill"}, {"confidence": 0.91, "end": 2970.139, "track": 1, "text": "I brought the bigger the NBA as my textbooks my class doesn't read like a textbook it reads a little hope a little better than a textbook but it was really designed to really help.", "start": 2961.276, "speaker": "Bill"}, {"confidence": 0.97, "end": 2984.825, "track": 1, "text": "People and organizations figure out how do I take advantage of data scientist data science as a as a monetization platform and I start with that and I think what you'll see very quickly is that when you focus in on the business outcomes.", "start": 2970.524, "speaker": "Bill"}, {"confidence": 0.89, "end": 2992.457, "track": 1, "text": "All the technology decisions you need to make architecture decisions you need to make data scientist need to make sure they all become self evident.", "start": 2985.204, "speaker": "Bill"}, {"confidence": 0.9, "end": 2998.532, "track": 1, "text": "I like to say no somebody walked me to the Haitian Mars do I need to have spark my interest going to be I don't know.", "start": 2992.722, "speaker": "Bill"}, {"confidence": 0.85, "end": 3006.067, "track": 1, "text": "What are you trying to do right do I need to have this I need to have wyota do I need to have cough cut right I don't know,", "start": 3000.113, "speaker": "Bill"}, {"confidence": 0.9, "end": 3014.894, "track": 1, "text": "what are you trying to do and if we don't know we're trying to do but we don't begin with an end in mind is still from Stephen Colby then we're going to wander lost in the desert,", "start": 3006.056, "speaker": "Bill"}, {"confidence": 0.9, "end": 3025.519, "track": 1, "text": "so it's it the understand the business outcome for trying to drive now it doesn't make our technology did data and data science jobs easier.", "start": 3014.955, "speaker": "Bill"}, {"confidence": 0.95, "end": 3039.652, "track": 1, "text": "It makes it more relevant to the business and it by the way as a data engineer also you become important to the business you're not just some guy buried in the balls organization playing with technology you're now a key aspect of the company's ability to drive,", "start": 3025.747, "speaker": "Bill"}, {"confidence": 0.94, "end": 3042.47, "track": 1, "text": "revenue and to monetize what they've got his assets.", "start": 3039.478, "speaker": "Bill"}, {"confidence": 0.95, "end": 3050.318, "track": 1, "text": "So make the shift and I think you will find the conversations you get involved in will change dramatically and they'll be a lot more fun.", "start": 3042.585, "speaker": "Bill"}, {"confidence": 0.94, "end": 3058.184, "track": 0, "text": "No I agree I mean I read the book but I can I can attest that you know as it engineer Reza developer of any kind.", "newpara": true, "start": 3050.427, "speaker": "Thomas"}, {"confidence": 0.87, "end": 3065.437, "track": 0, "text": "Once you can start explaining the problems and talking to you know the people above your paygrade you become really more important so that's a great book.", "start": 3058.064, "speaker": "Thomas"}, {"confidence": 0.92, "end": 3075.37, "track": 0, "text": "You know check it check it out specially if you're in a date Into Your Role so we're going to transition to the year and were rolling into our rapid fire questions and so these these questions we just have a set of questions,", "start": 3065.311, "speaker": "Thomas"}, {"confidence": 0.83, "end": 3081.199, "track": 0, "text": "first thing that comes to your mind and other they're meant to be fun and kind of give us a little more background you too so.", "start": 3075.214, "speaker": "Thomas"}, {"confidence": 0.94, "end": 3087.616, "track": 0, "text": "The first one is what year will Skynet go online so what year will the machines take over.", "start": 3081.103, "speaker": "Thomas"}, {"confidence": 0.94, "end": 3101.317, "track": 1, "text": "So I'm I'm dubious a Skynet Kik say never but I would say if there was a point in time it would be earlier versus later because we be no more naive and we,", "newpara": true, "start": 3090.633, "speaker": "Bill"}, {"confidence": 0.91, "end": 3107.44, "track": 1, "text": "have built lesson so I think we're most vulnerable probably from the years 2020 to 2022.", "start": 3101.215, "speaker": "Bill"}, {"confidence": 0.79, "end": 3112.53, "track": 0, "text": "Okay there you go man while it's specific conference all I'll be on the lookout.", "newpara": true, "start": 3107.855, "speaker": "Thomas"}, {"confidence": 0.91, "end": 3122.98, "track": 0, "text": "So if you're able to buy me one book what would it be like what you know what book would you recommend buy for somebody just any book that have to be technology book just where's your head at.", "newpara": true, "start": 3113.474, "speaker": "Thomas"}, {"confidence": 0.93, "end": 3134.097, "track": 1, "text": "Seven Habits of Highly Effective People book changed my life and it really helped me to understand what it was was important to me which by the way led me to teaching.", "newpara": true, "start": 3123.155, "speaker": "Bill"}, {"confidence": 0.9, "end": 3145.328, "track": 0, "text": "Craigslist\nwhat genre of music are you rocking out to so when it when you're on the plane when you're you know I know you're at I think you're a runner right with what kind of music do you listen to right now what genre.", "newpara": true, "start": 3134.517, "speaker": "Thomas"}, {"confidence": 0.93, "end": 3159.13, "track": 1, "text": "So I I like jazz by like big band jazz on a Maynard Ferguson nut but I kind of like it all go everything from Jerry Reed to Aerosmith to ZZ Top I like a wide range of music.", "newpara": true, "start": 3145.514, "speaker": "Bill"}, {"confidence": 0.92, "end": 3163.913, "track": 0, "text": "Okay what's your favorite piece of useless Tech.", "newpara": true, "start": 3160.074, "speaker": "Thomas"}, {"confidence": 0.92, "end": 3169.839, "track": 1, "text": "Oh God my at my my Apple watch.", "newpara": true, "start": 3164.972, "speaker": "Bill"}, {"confidence": 0.91, "end": 3178.63, "track": 2, "text": "So there's been a lot of is it a lot of votes for the Apple watch on this thing and I'll be honest it's the whole reason why I haven't bought one yet.", "newpara": true, "start": 3170.031, "speaker": "Cory"}, {"confidence": 0.95, "end": 3180.745, "track": 0, "text": "I want one so bad.", "newpara": true, "start": 3178.87, "speaker": "Thomas"}, {"confidence": 0.91, "end": 3190.023, "track": 1, "text": "You'll struggle to find a good use for it does measure steps very well at tells you the temperature outside in case you don't want to step outside but.", "newpara": true, "start": 3180.495, "speaker": "Bill"}, {"confidence": 0.89, "end": 3198.243, "track": 0, "text": "Yeah I'm a Runner 2 and so have a Garmin but I might call if I had that but watching and maybe you know okay what's your biggest Money Pit right now.", "newpara": true, "start": 3189.086, "speaker": "Thomas"}, {"confidence": 0.93, "end": 3202.045, "track": 1, "text": "My house.", "newpara": true, "start": 3199.77, "speaker": "Bill"}, {"confidence": 0.81, "end": 3203.237, "track": 0, "text": "House.", "newpara": true, "start": 3202.137, "speaker": "Thomas"}, {"confidence": 0.87, "end": 3209.096, "track": 1, "text": "Yeah we got it fixed the kitchen and the roof needs to be repaired and I don't want talk about it.", "newpara": true, "start": 3203.059, "speaker": "Bill"}, {"confidence": 0.94, "end": 3211.661, "track": 2, "text": "And it's and it's and it's in California.", "newpara": true, "start": 3208.796, "speaker": "Cory"}, {"confidence": 0.98, "end": 3215.002, "track": 1, "text": "Next question please next question.", "newpara": true, "start": 3211.458, "speaker": "Bill"}, {"confidence": 0.91, "end": 3223.415, "track": 0, "text": "Okay are you going anywhere interesting soon so I know you know I know you got a leg in a boot right now but do you have any trips or anything you're going to see do anything interesting.", "newpara": true, "start": 3211.74, "speaker": "Thomas"}, {"confidence": 0.95, "end": 3233.126, "track": 1, "text": "Yeah I got it I got a really cool end of the month I'm going to Sacramento I've been asked to speak to the state of California senior legislators about Big Data.", "newpara": true, "start": 3223.404, "speaker": "Bill"}, {"confidence": 0.8, "end": 3237.867, "track": 1, "text": "I'm in artificial intelligence and ramifications going to have in the state of California so I want to know.", "start": 3233.24, "speaker": "Bill"}, {"confidence": 0.92, "end": 3250.552, "track": 1, "text": "2 hour Workshop there for and I really jazzed about it because it's it's giving me a chance to really rethink some aspects of the Big Data aai machine learning conversation from a from a,", "start": 3238.144, "speaker": "Bill"}, {"confidence": 0.86, "end": 3253.905, "track": 1, "text": "different perspective so I'm totally Jazz about that.", "start": 3250.445, "speaker": "Bill"}, {"confidence": 0.93, "end": 3258.358, "track": 0, "text": "Okay great and then last question what show are you been doing right now.", "newpara": true, "start": 3254.14, "speaker": "Thomas"}, {"confidence": 0.9, "end": 3264.986, "track": 1, "text": "Game of Thrones season 5 season 5 not sure if how are you watching Game of Thrones.", "newpara": true, "start": 3258.665, "speaker": "Bill"}, {"confidence": 0.96, "end": 3268.303, "track": 0, "text": "Yeah I'm caught up right now so I won't I won't give you any spoilers or anything like.", "newpara": true, "start": 3264.764, "speaker": "Thomas"}, {"confidence": 0.92, "end": 3282.815, "track": 1, "text": "I don't know but I guess you know season 5 the first you know first 7 episodes were so boring and so depressing I kept turn off halfway through and kick it back on and then the last episode was you know the seed episode 8 I'm going to pay for any more detail I would spoil it,", "newpara": true, "start": 3268.003, "speaker": "Bill"}, {"confidence": 0.94, "end": 3289.137, "track": 1, "text": "but the whole season turned around and I by the way I have a man crush on Jon Snow.", "start": 3282.641, "speaker": "Bill"}, {"confidence": 0.54, "end": 3291.762, "track": 0, "text": "Alright.", "newpara": true, "start": 3289.179, "speaker": "Thomas"}, {"confidence": 0.88, "end": 3296.652, "track": 1, "text": "By the way you asked me for earlier but my Kane is really special in it I got a Valyrian sword in there.", "newpara": true, "start": 3291.463, "speaker": "Bill"}, {"confidence": 0.76, "end": 3297.561, "track": 2, "text": "Alright y'all.", "newpara": true, "start": 3296.456, "speaker": "Cory"}, {"confidence": 0.87, "end": 3301.425, "track": 1, "text": "The white walkers are going to get me.", "newpara": true, "start": 3299.09, "speaker": "Bill"}, {"confidence": 0.95, "end": 3311.1, "track": 2, "text": "Walt hey Bill thanks so much for being on it was awesome to have you folks wanted to catch up with you on social what's the best places for us to follow you.", "newpara": true, "start": 3300.464, "speaker": "Cory"}, {"confidence": 0.87, "end": 3317.638, "track": 1, "text": "So on Twitter I'm at schmarzo SCH marzo easy to find me there,", "newpara": true, "start": 3311.515, "speaker": "Bill"}, {"confidence": 0.93, "end": 3329.854, "track": 1, "text": "I buy post quite a bit on LinkedIn all the blogs I write a right first appear on the Dell EMC sites but I always transfer them over to LinkedIn so you can also follow me there,", "start": 3317.542, "speaker": "Bill"}, {"confidence": 0.95, "end": 3336.296, "track": 1, "text": "those are probably the two best places I try to avoid Facebook because it's too political but I do like LinkedIn and I do like Twitter.", "start": 3329.776, "speaker": "Bill"}, {"confidence": 0.94, "end": 3350.405, "track": 0, "text": "Great well everybody got their follow me always get great stuff is always post a lot of different blog post that help you learn you know the reason and the business behind big data so make sure you subscribe to the big date of your podcast never miss an episode.", "newpara": true, "start": 3337.198, "speaker": "Thomas"}, {"confidence": 0.91, "end": 3358.866, "track": 0, "text": "Make sure you like us a radius on iTunes and then also follow us on Twitter and a big data beer.com for all the show notes and all your big date of beard information.", "start": 3350.423, "speaker": "Thomas"}, {"confidence": 0.97, "end": 3367.26, "track": 1, "text": "That was fun thanks guys it was a blast.", "newpara": true, "start": 3365.188, "speaker": "Bill"}]