[{"confidence": 0.93, "end": 9.278, "track": 0, "text": "We're back with another episode of the big date of beer podcast where we explore the trends technology and talented people making big data a big deal just want to make it clear I do not,", "newpara": true, "start": 0.006, "speaker": "Erin Banks"}, {"confidence": 0.94, "end": 16.429, "track": 0, "text": "have a beard and my name is iron banks and we have on the podcast with us today at Brett Roberts.", "start": 9.068, "speaker": "Erin Banks"}, {"confidence": 0.89, "end": 20.497, "track": 1, "text": "Hey how's it going\ndoing great.", "newpara": true, "start": 16.597, "speaker": "Brett Roberts"}, {"confidence": 0.76, "end": 22.478, "track": 0, "text": "Good and you\nawesome and Rob Howe.", "newpara": true, "start": 18.286, "speaker": "Erin Banks"}, {"confidence": 0.98, "end": 23.802, "track": 3, "text": "How's it going.", "newpara": true, "start": 22.234, "speaker": "Rob Hout"}, {"confidence": 0.81, "end": 25.893, "track": 0, "text": "Good how's it going with you.", "newpara": true, "start": 24.104, "speaker": "Erin Banks"}, {"confidence": 0.89, "end": 29.306, "track": 3, "text": "Perfect a grey rainy skies in Seattle that's just what you ask for.", "newpara": true, "start": 25.599, "speaker": "Rob Hout"}, {"confidence": 0.89, "end": 38.626, "track": 0, "text": "Doesn't get any better than that and our guest on the show is Carey James who's the VP alliances at Blue Talon I carry.", "newpara": true, "start": 29.553, "speaker": "Erin Banks"}, {"confidence": 0.96, "end": 40.519, "track": 2, "text": "Hey Aaron how are you today.", "newpara": true, "start": 38.518, "speaker": "Carey James"}, {"confidence": 0.93, "end": 60.577, "track": 0, "text": "I hope everyone's getting ready for Thanksgiving and having a lovely lovely holiday if I forgot to mention it even though this will be posted after the holiday hopefully everyone's back at the gym hanging out and visit so that way I know I'll need to but before we start that process I just want to bring up a couple of news Topix,", "newpara": true, "start": 40.664, "speaker": "Erin Banks"}, {"confidence": 0.92, "end": 63.335, "track": 0, "text": "that have caught my eye recently one of them.", "start": 60.361, "speaker": "Erin Banks"}, {"confidence": 0.95, "end": 81.146, "track": 0, "text": "As I start working on my own job as part of a doing some messaging for AI and machine learning and deep-learning and a lot of the concepts are the concerns over privacy associate so there was a really great video that I saw and it was just talking about the fact of.", "newpara": true, "start": 63.69, "speaker": "Erin Banks"}, {"confidence": 0.96, "end": 102.106, "track": 0, "text": "I can come up with the concept of whether or not we understand the implications of privacy and what a i and how it's being used and the impact it will have on our lives in general I don't just was curious about everyone's kind of thought on that about where they kind of feel if they're kind of concerned about the AI and privacy and all those different aspects are up there like totally fine with it and,", "newpara": true, "start": 81.483, "speaker": "Erin Banks"}, {"confidence": 0.93, "end": 104.137, "track": 0, "text": "I think that the benefit outweighs the risk.", "start": 101.848, "speaker": "Erin Banks"}, {"confidence": 0.9, "end": 118.505, "track": 2, "text": "So there is a couple things there in time so the first one is his with a I write a lot of the artificial intelligence and deep learning functions were built to generate information and so it's not so much about.", "newpara": true, "start": 105.069, "speaker": "Carey James"}, {"confidence": 0.88, "end": 126.983, "track": 2, "text": "The they weren't designed for privacy rights and now we're actually trying to get deep learning and understand context around,", "start": 118.763, "speaker": "Carey James"}, {"confidence": 0.84, "end": 130.09, "track": 2, "text": "the customer and their relationship with that customer with the data,", "start": 126.894, "speaker": "Carey James"}, {"confidence": 0.89, "end": 142.427, "track": 2, "text": "I think that's where that the big pieces going to come into play is do we have contacts around how we're actually trying to protect the privacy of information so an algorithm that's designed to do population Health Care,", "start": 130.085, "speaker": "Carey James"}, {"confidence": 0.92, "end": 156.35, "track": 2, "text": "is one thing versus a that same deep learning algorithm now aimed at a specific individual such as myself or personalized care you now have a different level of privacy writing anonymity.", "start": 142.319, "speaker": "Carey James"}, {"confidence": 0.9, "end": 163.945, "track": 2, "text": "In that to be taken care of all the algorithms are very similar so then that's the big piece we got to come down to it,", "start": 156.476, "speaker": "Carey James"}, {"confidence": 0.97, "end": 172.568, "track": 2, "text": "understanding the context of the information understanding the context of the use and then how do we protect the Privacy inside of that context.", "start": 163.862, "speaker": "Carey James"}, {"confidence": 0.96, "end": 187.405, "track": 0, "text": "So do you think that's actually going to happen though do you think that privacy is going to be you know taken care of after the fact that I feel like security has always been an afterthought and I still have this concern that it's going to continue to be an afterthought even after we start implementing AI.", "newpara": true, "start": 172.917, "speaker": "Erin Banks"}, {"confidence": 0.71, "end": 189.748, "track": 2, "text": "Well I agree right solace,", "newpara": true, "start": 187.147, "speaker": "Carey James"}, {"confidence": 0.91, "end": 202.728, "track": 2, "text": "meet me on another topic I think we'll talk about it later the European Union right in their data protection act acts and the new one that they're putting out gdpr it's around that event right it's around trying to put data,", "start": 189.586, "speaker": "Carey James"}, {"confidence": 0.89, "end": 213.724, "track": 2, "text": "home security in the Forefront analytics as you know where it's near and dear to you're in my heart you know analytics The Last 5 Years you know up to really the last year,", "start": 202.734, "speaker": "Carey James"}, {"confidence": 0.92, "end": 227.846, "track": 2, "text": "analytics was about free reign the information right go look at the daytime if you wanted to do protection of data what you did is you built sideload little PODS of information only gave one or two people access to data so you were using.", "start": 213.635, "speaker": "Carey James"}, {"confidence": 0.97, "end": 231.836, "track": 2, "text": "You know basically almost personal security measures.", "start": 227.918, "speaker": "Carey James"}, {"confidence": 0.93, "end": 241.162, "track": 2, "text": "However we still had access to all the data that was inside of there so you know if I was going to be nefarious I was going to be nefarious and I had access to all the information.", "start": 231.92, "speaker": "Carey James"}, {"confidence": 0.94, "end": 249.713, "track": 2, "text": "So that's one of the things were looking at now in the analytics space is is how you actually unlock analytics while protecting.", "start": 241.349, "speaker": "Carey James"}, {"confidence": 0.82, "end": 252.843, "track": 2, "text": "The consumer Intel there are more and more companies.", "start": 249.899, "speaker": "Carey James"}, {"confidence": 0.91, "end": 260.0, "track": 2, "text": "We're seeing it in financial services drastically Healthcare another big one Robbie scene in,", "start": 252.892, "speaker": "Carey James"}, {"confidence": 0.9, "end": 268.437, "track": 2, "text": "Europe right lower also seen an Asian Pacific so what that tells me is It's Going Global it's being led by certain places,", "start": 260.097, "speaker": "Carey James"}, {"confidence": 0.96, "end": 276.91, "track": 2, "text": "but at the moment security still is the afterthought right but more and more companies are shifting now to how do I protect my data.", "start": 268.564, "speaker": "Carey James"}, {"confidence": 0.93, "end": 279.163, "track": 2, "text": "While still allowing.", "newpara": true, "start": 277.319, "speaker": "Carey James"}, {"confidence": 0.94, "end": 287.876, "track": 2, "text": "You know these machine learning algorithms even data scientist Business Report how do I make sure that you know Carrie,", "start": 279.272, "speaker": "Carey James"}, {"confidence": 0.94, "end": 295.478, "track": 2, "text": "doesn't get access to Social Security numbers cuz he's inari's a CSR and not a financial services rep.", "start": 287.859, "speaker": "Carey James"}, {"confidence": 0.95, "end": 308.662, "track": 3, "text": "Pictures of a cousin to that topic cry so there's a security to the data and access to the data does also ethics and use of the data so I might have rights to it or might be the right person to access that but.", "newpara": true, "start": 295.436, "speaker": "Rob Hout"}, {"confidence": 0.94, "end": 309.791, "track": 3, "text": "There's going to be a.", "newpara": true, "start": 308.608, "speaker": "Rob Hout"}, {"confidence": 0.91, "end": 323.654, "track": 3, "text": "Governance around how I use it like the old don't be creepy with data right even if it is secure.", "newpara": true, "start": 309.714, "speaker": "Rob Hout"}, {"confidence": 0.98, "end": 325.271, "track": 3, "text": "And I'm the only one that has access to it.", "newpara": true, "start": 323.553, "speaker": "Rob Hout"}, {"confidence": 0.92, "end": 335.234, "track": 1, "text": "Yeah I also you make a great point where where is it ethical thing on the part of the organization versus a regular Tory singing and I think.", "newpara": true, "start": 325.794, "speaker": "Brett Roberts"}, {"confidence": 0.83, "end": 337.884, "track": 1, "text": "How do we Inspire no more.", "newpara": true, "start": 335.246, "speaker": "Brett Roberts"}, {"confidence": 0.92, "end": 348.814, "track": 1, "text": "Cool thought of as cold habits versus using regulations to Define everything across the board cuz when you over regulate you stifle Innovation you stifle the ability to progress.", "newpara": true, "start": 337.986, "speaker": "Brett Roberts"}, {"confidence": 0.84, "end": 355.797, "track": 1, "text": "To appoint so how do we do use ethics as a way of ensuring privacy versus regulations.", "newpara": true, "start": 348.695, "speaker": "Brett Roberts"}, {"confidence": 0.95, "end": 367.424, "track": 0, "text": "Yes that's interesting so that brings me up to the second topic that I thought was really great article and it was titled how to collect worker data without creeping out your employees and I love this cuz,", "newpara": true, "start": 355.911, "speaker": "Erin Banks"}, {"confidence": 0.91, "end": 371.559, "track": 0, "text": "recently the company they work for it had a survey and sometimes I get nervous about,", "start": 367.202, "speaker": "Erin Banks"}, {"confidence": 0.95, "end": 378.667, "track": 0, "text": "answering those they say that they're not a mess but it was a question whether or not they are not a mess and I know as we're in this new realm of,", "start": 371.337, "speaker": "Erin Banks"}, {"confidence": 0.95, "end": 387.495, "track": 0, "text": "filling out Health surveys and you know asking questions about how often I drink or smoke or how often I work out and they said it's for your benefit but I just wonder what they're doing,", "start": 378.5, "speaker": "Erin Banks"}, {"confidence": 0.9, "end": 397.392, "track": 0, "text": "with the data after the fact and you know are they using it against me and therefore increasing you know Premier as we know that they increase prices.", "start": 387.699, "speaker": "Erin Banks"}, {"confidence": 0.9, "end": 406.874, "track": 0, "text": "Trident based on the device that you're logging into or how long you stood in front of a device in the numbers and prices can change depending on how much time you spend with it so.", "start": 397.266, "speaker": "Erin Banks"}, {"confidence": 0.84, "end": 408.809, "track": 0, "text": "Me know if there's any one of my thoughts about.", "start": 406.76, "speaker": "Erin Banks"}, {"confidence": 0.93, "end": 422.696, "track": 0, "text": "You don't work or date of your company grabbing date about you and what they're using in tracking all of your information like again like how often you're on the Internet or surfing the web versus doing work like do you guys think about that when you're working and filling out these forms and his health kind of things.", "start": 408.899, "speaker": "Erin Banks"}, {"confidence": 0.93, "end": 429.594, "track": 3, "text": "I think the topic came up pretty clear recently wasn't initially an employee thing but the whole Twitter verification Fiasco pit.", "newpara": true, "start": 422.492, "speaker": "Rob Hout"}, {"confidence": 0.81, "end": 433.638, "track": 3, "text": "8 light year we're going to start looking at your behavior outside of Twitter.", "newpara": true, "start": 429.703, "speaker": "Rob Hout"}, {"confidence": 0.93, "end": 443.74, "track": 3, "text": "What are you doing and your offline life that might affect you having a little verification tekmark right to know if an employer am I looking at my employees activities outside of the job.", "newpara": true, "start": 433.543, "speaker": "Rob Hout"}, {"confidence": 0.91, "end": 450.578, "track": 3, "text": "That my might affect my opinion of them or what kind of service is I give them or allow them to do that's pretty frightening.", "newpara": true, "start": 443.89, "speaker": "Rob Hout"}, {"confidence": 0.86, "end": 459.405, "track": 2, "text": "Yeah great right inside to that point to inside and outside the organization's right so you guys remember this the little,", "newpara": true, "start": 451.36, "speaker": "Carey James"}, {"confidence": 0.88, "end": 471.213, "track": 2, "text": "ride share service Ben and all of a sudden that that use of privacy right the context that back to the ethical comment,", "start": 459.237, "speaker": "Carey James"}, {"confidence": 0.81, "end": 477.15, "track": 2, "text": "another gathering data to understand you know the drivers of patterns excetera,", "start": 471.298, "speaker": "Carey James"}, {"confidence": 0.97, "end": 486.386, "track": 2, "text": "but now are you using that outside the context we've agreed for it to be used in and now privacy comes into play right so that's I think,", "start": 477.0, "speaker": "Carey James"}, {"confidence": 0.93, "end": 495.976, "track": 2, "text": "is the conversation there in like most things in human nature is going to come down to his is there a benefit you know for me it is the individual.", "start": 486.308, "speaker": "Carey James"}, {"confidence": 0.96, "end": 505.645, "track": 2, "text": "I'm with my company doing this and how how are they using it information and are they using it in the context of the agreement right that's going to be,", "start": 496.091, "speaker": "Carey James"}, {"confidence": 0.9, "end": 515.344, "track": 2, "text": "choudrant as Rob said earlier right what's the ethical use that information that ethical use all the data in context of why it was being captured,", "start": 505.537, "speaker": "Carey James"}, {"confidence": 0.96, "end": 524.105, "track": 2, "text": "is definitely one of the big things Paramount to as much as am I authorized to see it am I authorized to use it for this context.", "start": 515.242, "speaker": "Carey James"}, {"confidence": 0.93, "end": 534.675, "track": 1, "text": "Yeah I completely agree and have a example of an organization I used to work for where they realized how valuable the data was in.", "newpara": true, "start": 523.985, "speaker": "Brett Roberts"}, {"confidence": 0.95, "end": 536.051, "track": 1, "text": "Auditing expenses.", "newpara": true, "start": 534.675, "speaker": "Brett Roberts"}, {"confidence": 0.94, "end": 550.629, "track": 1, "text": "And they started scoping out all these really interesting ideas and how can we ensure that everyone's playing by the rules with expenses but they got to the point where they can take a setback is this ethical is this too big brothers that too creepy.", "newpara": true, "start": 536.081, "speaker": "Brett Roberts"}, {"confidence": 0.92, "end": 557.858, "track": 1, "text": "Too far into our employees lies and and what they do to try and limit.", "newpara": true, "start": 550.557, "speaker": "Brett Roberts"}, {"confidence": 0.93, "end": 569.798, "track": 1, "text": "Potentially bad apples write a huge role in how do we get into a creepy Factor 100.", "newpara": true, "start": 557.99, "speaker": "Brett Roberts"}, {"confidence": 0.96, "end": 576.72, "track": 1, "text": "Yeah I mean I've seen it before and I was part of some of those conversations where they were all ready to go into new implementing this.", "newpara": true, "start": 569.726, "speaker": "Brett Roberts"}, {"confidence": 0.86, "end": 583.264, "track": 1, "text": "Hey how's this going to impact our employer please perception of us as an organization so I think that's another big thing as well.", "newpara": true, "start": 576.691, "speaker": "Brett Roberts"}, {"confidence": 0.91, "end": 598.233, "track": 0, "text": "Yeah yeah I mean that was it was really I don't know I just find it fascinating and I hope that companies are thinking about that right as they collect all the state and that they're protecting it correctly which again leads to the second third topic which I care you have brought up earlier is.", "newpara": true, "start": 583.481, "speaker": "Erin Banks"}, {"confidence": 0.93, "end": 608.887, "track": 0, "text": "Is the Uno gdpr right to the general data protection regulation what's happening in the EU we have a couple years to get through it but it's obviously discussion that's come up a lot recently.", "start": 598.149, "speaker": "Erin Banks"}, {"confidence": 0.9, "end": 616.23, "track": 0, "text": "In my world right it when we talk about security we talk about dating get in their hands and and I just we were doing a.", "start": 608.755, "speaker": "Erin Banks"}, {"confidence": 0.91, "end": 625.099, "track": 0, "text": "Hello about this I was doing I don't know what work event that I was on a panel and you know it was interesting because they were bringing up.", "start": 616.2, "speaker": "Erin Banks"}, {"confidence": 0.88, "end": 631.138, "track": 0, "text": "What are the people in the panel were just saying that regulation is really great and then I just feel like will regulation.", "start": 625.082, "speaker": "Erin Banks"}, {"confidence": 0.95, "end": 645.031, "track": 0, "text": "It has its good things and it's bad things but the point is regulation if if a company is going to get fine because my day to get stolen the fact is I'm the one that really has the biggest impact and I'm the one that gets hurt in the long run and does regulation.", "start": 631.091, "speaker": "Erin Banks"}, {"confidence": 0.94, "end": 651.425, "track": 0, "text": "Is it going to eventually stop that or people going to really do with it like they do with all risk and they said well it's it's worth.", "start": 644.954, "speaker": "Erin Banks"}, {"confidence": 0.92, "end": 666.424, "track": 0, "text": "You know paying that fine versus doing all the protection because I just keep question whether or not gdpr is actually possible are we going to be able to you know delete every single amount of data about me that a company has said I feel safe along those lines.", "newpara": true, "start": 651.72, "speaker": "Erin Banks"}, {"confidence": 0.65, "end": 668.341, "track": 0, "text": "What do you guys think.", "newpara": true, "start": 667.368, "speaker": "Erin Banks"}, {"confidence": 0.94, "end": 681.819, "track": 2, "text": "Well I mean if you tell the right to be forgotten is a useful piece right but to your to the what we were talking about how do we use the information in the context of it if everyone elects to be forgotten.", "newpara": true, "start": 668.972, "speaker": "Carey James"}, {"confidence": 0.84, "end": 687.203, "track": 2, "text": "ITunes data been anonymize to a point that you can no longer you know.", "start": 682.132, "speaker": "Carey James"}, {"confidence": 0.93, "end": 699.227, "track": 2, "text": "Understand who's in who's in the group or there's no data there to utilize right so then how do you manage that relationship so there is that that balance I know,", "start": 687.516, "speaker": "Carey James"}, {"confidence": 0.86, "end": 703.962, "track": 2, "text": "yeah the right to be forgotten probably the easiest part of the GDP are to be taken care of.", "start": 699.083, "speaker": "Carey James"}, {"confidence": 0.91, "end": 713.733, "track": 2, "text": "You know that actually clean out the information from the user is that how you keep transaxle information about a person but have no you know.", "start": 704.095, "speaker": "Carey James"}, {"confidence": 0.92, "end": 729.291, "track": 2, "text": "Information about who the individual is so there's they're still pieces that puzzle the other big portion of that is going to be as how how do we actually take and do the somebody nomination pieces under regulations in in one of the countries.", "newpara": true, "start": 714.527, "speaker": "Carey James"}, {"confidence": 0.96, "end": 735.684, "track": 2, "text": "I'm ready to gdpr is the fact that if there are less than 20 transactions in a postal code.", "start": 729.483, "speaker": "Carey James"}, {"confidence": 0.87, "end": 743.19, "track": 2, "text": "Then the postal code might be thrown away because it's considered to be here too small you cannot anonymize 20 individuals.", "start": 735.901, "speaker": "Carey James"}, {"confidence": 0.83, "end": 748.718, "track": 2, "text": "Or 20 transactions right so that's that's a big piece of it too it's not only.", "start": 743.376, "speaker": "Carey James"}, {"confidence": 0.92, "end": 761.908, "track": 2, "text": "You know the privacy of information but it really does get down the Privacy can you you know can you reverse engineer who the person is it so that's going to be a big portion of that the gdpr is that.", "start": 748.899, "speaker": "Carey James"}, {"confidence": 0.82, "end": 767.917, "track": 2, "text": "Protecting the privacy of the image will not disappearing the data yes there's any masking there's any filtering.", "start": 762.155, "speaker": "Carey James"}, {"confidence": 0.88, "end": 777.766, "track": 2, "text": "But it's going to be that how do I understand the use of this information and in one transaction I can use a popsicle that has 20 events in it and the other transaction I cannot.", "start": 768.062, "speaker": "Carey James"}, {"confidence": 0.91, "end": 782.381, "track": 2, "text": "Because it now breaks that privacy barrier.", "start": 778.079, "speaker": "Carey James"}, {"confidence": 0.85, "end": 787.518, "track": 0, "text": "So I know I will I just got also find it interesting because I keep thinking like.", "newpara": true, "start": 782.537, "speaker": "Erin Banks"}, {"confidence": 0.92, "end": 802.962, "track": 0, "text": "Is it has to be an iteration where they're going to have to play with it they're going up to see if it works and then recover you know it almost come back to it and revamp it because there can't be a single answer for this like there can't be a single way of solving this problem because it's a large problem that again I feel like.", "newpara": true, "start": 788.072, "speaker": "Erin Banks"}, {"confidence": 0.93, "end": 813.213, "track": 0, "text": "Once again we're trying to solve a problem security aspect of a problem after the fact that we've already implemented all these capabilities with her our business and now it too.", "start": 803.088, "speaker": "Erin Banks"}, {"confidence": 0.92, "end": 825.334, "track": 0, "text": "Almost try to reinvent the wheel and I don't know if I mean only time will tell whether or not this regulation really protect the people and what it protects them from cuz there's always a debate always fun and interesting.", "start": 813.087, "speaker": "Erin Banks"}, {"confidence": 0.89, "end": 834.323, "track": 0, "text": "I don't know sometimes as much as I try to be pretty protective and quiet and to believe it or not and got to stay home you know.", "newpara": true, "start": 825.67, "speaker": "Erin Banks"}, {"confidence": 0.93, "end": 845.163, "track": 0, "text": "Characteristics about me there's also the point of will maybe if we just shared everything then there wouldn't really be anything the Steeler wouldn't be getting the wick worry about there just leave it all open and then just see what happens after the fact and,", "start": 834.348, "speaker": "Erin Banks"}, {"confidence": 0.9, "end": 854.922, "track": 0, "text": "put all of us on equal playing field I don't know how I feel about it I just I just a question it and I think in or like I said only time will tell but I think it's a it's an interesting.", "start": 844.996, "speaker": "Erin Banks"}, {"confidence": 0.48, "end": 855.956, "track": 0, "text": "Tactic.", "newpara": true, "start": 855.115, "speaker": "Erin Banks"}, {"confidence": 0.9, "end": 866.345, "track": 2, "text": "And there is a different pieces there right in the the levels of information and we are doing a project about 3 years ago with one of the people on our team was a millennial.", "newpara": true, "start": 856.154, "speaker": "Carey James"}, {"confidence": 0.91, "end": 876.663, "track": 2, "text": "On for a retail or you know on e-commerce retail and they looked at the person across the table to the person so I can buy the privacy and pieces and says if you don't already know this about me.", "start": 866.58, "speaker": "Carey James"}, {"confidence": 0.94, "end": 882.426, "track": 2, "text": "Why do I want to do business with you right I'm not a millennial you know.", "start": 876.856, "speaker": "Carey James"}, {"confidence": 0.98, "end": 885.166, "track": 0, "text": "Oh I think you are.", "newpara": true, "start": 883.003, "speaker": "Erin Banks"}, {"confidence": 0.9, "end": 897.232, "track": 2, "text": "I'm not right but for me I don't want that and then when it comes there and again or the context of the data maybe my retail transactions I'm okay with that right but my personal hell,", "newpara": true, "start": 884.872, "speaker": "Carey James"}, {"confidence": 0.87, "end": 905.765, "track": 2, "text": "information I don't want you know out in the marketplace that's going to be the piece to I think right now into your point by GDP are kind of a blanket.", "start": 897.118, "speaker": "Carey James"}, {"confidence": 0.92, "end": 911.45, "track": 2, "text": "But you know where do we look at is there going to be restart you already have it in United States right we have HIPAA.", "start": 905.988, "speaker": "Carey James"}, {"confidence": 0.92, "end": 926.622, "track": 2, "text": "We have you know pii we have PCI personal Credit in your pipes that we have different regulations around specific types of information so that's going to be the the big piece it again yeah I keep harping on it coming back to it but he's the context of the information,", "start": 911.696, "speaker": "Carey James"}, {"confidence": 0.86, "end": 935.065, "track": 2, "text": "the context of a relationship with a data and then now you know what was what was I intending the company to do with that information when they collected it.", "start": 926.455, "speaker": "Carey James"}, {"confidence": 0.86, "end": 943.91, "track": 1, "text": "Yes so speaking as a millennial or maybe maybe on the line of the money I don't actually know but I'm okay with.", "newpara": true, "start": 935.27, "speaker": "Brett Roberts"}, {"confidence": 0.91, "end": 953.561, "track": 1, "text": "Certain parts of of my life being open I have nothing really to hide in for the audience out there don't Google me you won't have you want anything great but.", "newpara": true, "start": 943.935, "speaker": "Brett Roberts"}, {"confidence": 0.95, "end": 964.293, "track": 1, "text": "I'm always reminded of the If You Give a Mouse a Cookie type of analogy right how far does it go to the point where there's certain things that I don't want out in the open so I think.", "newpara": true, "start": 953.94, "speaker": "Brett Roberts"}, {"confidence": 0.9, "end": 966.673, "track": 1, "text": "There there certain amount that needs to be.", "newpara": true, "start": 964.498, "speaker": "Brett Roberts"}, {"confidence": 0.93, "end": 976.906, "track": 1, "text": "He'll regulated but with a blanket regulation like this I also like the other side of the of the story where if you go all-in how easy is it to recalibrate.", "newpara": true, "start": 966.709, "speaker": "Brett Roberts"}, {"confidence": 0.93, "end": 981.972, "track": 1, "text": "Tickets that sweet spot where you're protecting but also allowing companies to.", "newpara": true, "start": 976.841, "speaker": "Brett Roberts"}, {"confidence": 0.93, "end": 993.425, "track": 1, "text": "Progressed and I don't know if a blank regulation does that and I don't know how hard it is to change that regulation versus trying to do an act so maybe lighter type of things to to get to wear that sweet spot is.", "newpara": true, "start": 981.96, "speaker": "Brett Roberts"}, {"confidence": 0.92, "end": 1006.994, "track": 0, "text": "Which is interesting to that point of iCarly will the Millennials vs not right to eat is expectation as these rules regulations every create are created by you know old stodgy people or you know down the road it'll start.", "newpara": true, "start": 993.42, "speaker": "Erin Banks"}, {"confidence": 0.89, "end": 1012.606, "track": 0, "text": "You know being not as important or not necessary to be really interesting to see where it goes cuz I do.", "start": 1007.187, "speaker": "Erin Banks"}, {"confidence": 0.94, "end": 1030.327, "track": 0, "text": "Agree that the expectation for others that have grown up in a digital environment within an iPhone in their hand it's just a different expectation of what you're getting from your business I'm from your life from your restaurants in a company's like that so I think it'll be really,", "start": 1012.613, "speaker": "Erin Banks"}, {"confidence": 0.93, "end": 1034.251, "track": 0, "text": "interesting to see where that goes\nso.", "start": 1030.171, "speaker": "Erin Banks"}, {"confidence": 0.9, "end": 1041.492, "track": 0, "text": "On that note, I wanted to get some of your input I love for you to tell us a little bit about yourself and about blue Talon and and what you do.", "start": 1034.311, "speaker": "Erin Banks"}, {"confidence": 0.97, "end": 1046.353, "track": 2, "text": "Sure I'm so myself as you guys guess I'm not a millennial.", "newpara": true, "start": 1042.177, "speaker": "Carey James"}, {"confidence": 0.95, "end": 1053.84, "track": 2, "text": "I've been in I've been in and around information for over 30 years right so we are background.", "start": 1046.516, "speaker": "Carey James"}, {"confidence": 0.91, "end": 1065.035, "track": 2, "text": "I'm started out as a EDP auditor for those of you who don't electronic data processing auditor for CPA firms I loved the combination of information,", "start": 1053.979, "speaker": "Carey James"}, {"confidence": 0.91, "end": 1073.502, "track": 2, "text": "how to protect the data and how to actually use the data in the business right so that translated it to me and Cheryl Long Consulting career.", "start": 1064.898, "speaker": "Carey James"}, {"confidence": 0.94, "end": 1084.114, "track": 2, "text": "And now I've spent the last 7 years really focus on analytics right before they were really the cool thing to be doing in the tools that we had.", "start": 1073.701, "speaker": "Carey James"}, {"confidence": 0.9, "end": 1096.98, "track": 2, "text": "I'm in a really limited are the ability for us to do things unless you had you know one of the crazy super computer is where you actually had to HPC right those only exist in lab,", "start": 1084.289, "speaker": "Carey James"}, {"confidence": 0.77, "end": 1100.387, "track": 2, "text": "interior today we change that model and.", "start": 1096.914, "speaker": "Carey James"}, {"confidence": 0.93, "end": 1113.048, "track": 2, "text": "In that that space of analytics I really saw that you know the move towards self-service the drive to Ward's you know you delete a free utilization of information and in there.", "start": 1100.784, "speaker": "Carey James"}, {"confidence": 0.82, "end": 1116.563, "track": 2, "text": "You know as a product manager for a sweet in that.", "start": 1113.18, "speaker": "Carey James"}, {"confidence": 0.92, "end": 1129.344, "track": 2, "text": "Environment I noticed that the real key to unlocking this was you know the bility to allow people to have access to the date of their authorized to protect that the sensitive in private data were talking about.", "start": 1116.732, "speaker": "Carey James"}, {"confidence": 0.88, "end": 1135.9, "track": 2, "text": "That's what blue Talon does right so we do something called Data Access Control we work with authorization.", "start": 1129.477, "speaker": "Carey James"}, {"confidence": 0.91, "end": 1141.687, "track": 2, "text": "And we work with him in crypto tools to let you know do some protection of data but encryption,", "newpara": true, "start": 1135.901, "speaker": "Carey James"}, {"confidence": 0.89, "end": 1148.664, "track": 2, "text": "you know it's really good for about 3 to 5% of your data on your database is right and get beyond that the,", "start": 1141.615, "speaker": "Carey James"}, {"confidence": 0.93, "end": 1160.333, "track": 2, "text": "the policy of creeks near maintaining encryption and decryption and even the policies around how to drive it gets very much like the old views and they are dbms is anybody ever did of you base security.", "start": 1148.514, "speaker": "Carey James"}, {"confidence": 0.88, "end": 1168.578, "track": 2, "text": "You know you may wind up if you had 10 groups you wanted up with 10 views in the system and you're actually physically maintaining these views even if they're materialize.", "start": 1160.544, "speaker": "Carey James"}, {"confidence": 0.88, "end": 1178.991, "track": 2, "text": "So that became a bottleneck but that didn't even exist in the outside of the house Rachel how did you do this without creating files you basically.", "start": 1169.005, "speaker": "Carey James"}, {"confidence": 0.94, "end": 1189.309, "track": 2, "text": "Nina perpetuated a a bad practice of copying data protecting data by creating individual silos of it and that did not really.", "start": 1179.202, "speaker": "Carey James"}, {"confidence": 0.89, "end": 1199.038, "track": 2, "text": "Allow for freedom of you straight so now I can actually go in with blue Talon and we do we turn this into policy so we're policy enforcement model,", "start": 1189.574, "speaker": "Carey James"}, {"confidence": 0.94, "end": 1210.683, "track": 2, "text": "so you write policy centralized and we have enforcement Point based on the syntax of the different data platform so high then Paula you know greenplum postgres oracle.", "start": 1198.99, "speaker": "Carey James"}, {"confidence": 0.88, "end": 1219.865, "track": 2, "text": "We're in the progress process of developing one for teradata what this allows people to do is actually do their definition of their policies once.", "start": 1210.87, "speaker": "Carey James"}, {"confidence": 0.89, "end": 1227.484, "track": 2, "text": "In a central space of the enforcement of those policies and inconsistent enforcement of those policies across the different data platform.", "start": 1219.992, "speaker": "Carey James"}, {"confidence": 0.93, "end": 1234.948, "track": 2, "text": "So now you actually do get the freedom from a data scientist data analyst I troll to be able to.", "newpara": true, "start": 1227.677, "speaker": "Carey James"}, {"confidence": 0.93, "end": 1242.525, "track": 2, "text": "You access information that is relevant to me I want to answer my question but still protect the sensitive information,", "start": 1235.026, "speaker": "Carey James"}, {"confidence": 0.92, "end": 1252.897, "track": 2, "text": "it is a company in an organization we talked about data Mobility right putting data on the right platform for its ability in a right fit right cost right analysis,", "start": 1242.376, "speaker": "Carey James"}, {"confidence": 0.91, "end": 1262.187, "track": 2, "text": "well you didn't have that before right so now we actually allow that to happen as well so the key to self service the key today to Mobility is Access Control.", "start": 1252.753, "speaker": "Carey James"}, {"confidence": 0.95, "end": 1263.731, "track": 2, "text": "And that's where we play.", "start": 1262.464, "speaker": "Carey James"}, {"confidence": 0.94, "end": 1276.23, "track": 3, "text": "Another Billy Idol log in with that data catalog by policy I can now restrict your view at the particular content at that later as opposed to having to give you access an individual data piece.", "newpara": true, "start": 1264.182, "speaker": "Rob Hout"}, {"confidence": 0.8, "end": 1277.576, "track": 2, "text": "Correct.", "newpara": true, "start": 1274.722, "speaker": "Carey James"}, {"confidence": 0.88, "end": 1281.614, "track": 0, "text": "Yes it what are some of the projects that you guys have been working on it through town.", "newpara": true, "start": 1277.276, "speaker": "Erin Banks"}, {"confidence": 0.89, "end": 1292.923, "track": 2, "text": "I'm so broke in a couple of different project some very recently I'm too here in the United States with big financial institutions and one across actually in in Europe.", "newpara": true, "start": 1281.993, "speaker": "Carey James"}, {"confidence": 0.9, "end": 1301.204, "track": 2, "text": "I'm with a financial institution as well so it said earlier right financial services are you know really being pushed heavily.", "start": 1293.152, "speaker": "Carey James"}, {"confidence": 0.91, "end": 1310.692, "track": 2, "text": "With the privacy and protection of information but they are struggling to allow you access to this information cuz they want to beat The Hobbit,", "start": 1301.336, "speaker": "Carey James"}, {"confidence": 0.86, "end": 1315.493, "track": 2, "text": "I hope you know I treasure Trove of information about customer transactions events,", "start": 1310.56, "speaker": "Carey James"}, {"confidence": 0.94, "end": 1328.918, "track": 2, "text": "but they are really at the Forefront even ahead of the regulation of how do we use this information but protect you know cup company sensitive information or pii type data PC data,", "start": 1315.614, "speaker": "Carey James"}, {"confidence": 0.86, "end": 1337.054, "track": 2, "text": "so I can think of it as a you know a model and it's a protection model across my environment,", "start": 1328.768, "speaker": "Carey James"}, {"confidence": 0.92, "end": 1342.594, "track": 2, "text": "versus having to go in and say okay we're going to remove credit card numbers from this field are we going to remove,", "start": 1337.109, "speaker": "Carey James"}, {"confidence": 0.91, "end": 1352.816, "track": 2, "text": "Social Security numbers were going to create you know five different views of social security number for this table and the 10 different tables that exists and I got 50 different views across my data system.", "start": 1342.625, "speaker": "Carey James"}, {"confidence": 0.93, "end": 1361.625, "track": 2, "text": "Now I can go in and say no I want to write a policy that says when I see social security number I do know for a CSR going to mass call with the last four,", "start": 1352.996, "speaker": "Carey James"}, {"confidence": 0.85, "end": 1368.319, "track": 2, "text": "for this organization for management that they're completely you know denied access to Social Security number.", "start": 1361.661, "speaker": "Carey James"}, {"confidence": 0.95, "end": 1377.934, "track": 2, "text": "And so again and based on policy based on who I am what I'm doing in the context of what I'm trying to do with the data we can apply policies.", "start": 1368.458, "speaker": "Carey James"}, {"confidence": 0.88, "end": 1382.567, "track": 2, "text": "That control that sensitive in private information.", "newpara": true, "start": 1378.108, "speaker": "Carey James"}, {"confidence": 0.92, "end": 1395.913, "track": 0, "text": "No I went to the last time I saw you I think was I want to say strata data conference which was here in New York City like it was this year and when we were talking and we were discussing everything you introduced me know if it was like,", "newpara": true, "start": 1382.868, "speaker": "Erin Banks"}, {"confidence": 0.95, "end": 1399.795, "track": 0, "text": "DeKalb I think it was her dcap can you give me like more.", "start": 1395.757, "speaker": "Erin Banks"}, {"confidence": 0.92, "end": 1402.643, "track": 2, "text": "Yeah so it's a Gartner,", "newpara": true, "start": 1399.813, "speaker": "Carey James"}, {"confidence": 0.95, "end": 1419.096, "track": 2, "text": "one of the Gartner quadrants right so data-centric access and protection so what is focusing on what we were talking about today right so there's multiple layers of security right so there is security from a network perception perception I went to prevent people from getting,", "start": 1402.445, "speaker": "Carey James"}, {"confidence": 0.93, "end": 1421.962, "track": 2, "text": "into my network well you know we,", "start": 1419.132, "speaker": "Carey James"}, {"confidence": 0.92, "end": 1430.645, "track": 2, "text": "the richest we've seen recently we all know people are in the network so that's no longer you know ballot then we had views where,", "start": 1422.185, "speaker": "Carey James"}, {"confidence": 0.91, "end": 1440.26, "track": 2, "text": "what we're going to create all these years I'm going to maintain these different types of security places in you were going to encrypt data Albright you can encrypt certain pieces of information,", "start": 1430.495, "speaker": "Carey James"}, {"confidence": 0.93, "end": 1449.388, "track": 2, "text": "but if it's stolen credentials right then even once I had that I can actually get to the encryption keys and I can now decrypt data.", "start": 1440.374, "speaker": "Carey James"}, {"confidence": 0.91, "end": 1460.558, "track": 2, "text": "So yep going credentials it's a bad thing right so what D cap focuses on is how do you actually focus on protecting the information and not access.", "start": 1449.713, "speaker": "Carey James"}, {"confidence": 0.75, "end": 1466.477, "track": 2, "text": "You know my taxes to not be no connection to body actually for sex,", "start": 1460.667, "speaker": "Carey James"}, {"confidence": 0.94, "end": 1479.926, "track": 2, "text": "access to the data so in the case of you know for our system if we deny you access to the Social Security number there is no option key to steal if I'm asked for the last four it is actually an in-flight mask.", "start": 1466.4, "speaker": "Carey James"}, {"confidence": 0.93, "end": 1489.564, "track": 2, "text": "So we are actually you're protecting that data we allow you to know that a equals a but we don't you would not you don't know what a is so.", "start": 1480.052, "speaker": "Carey James"}, {"confidence": 0.93, "end": 1499.341, "track": 2, "text": "That's how we protected information so we're focused on protecting the use of the daytime that's Roadie can't really focus is on his protection of the data at the point of views.", "start": 1489.721, "speaker": "Carey James"}, {"confidence": 0.9, "end": 1508.511, "track": 0, "text": "So what does that mean like technically from like an analytics perspective right so how do I know it's always that question or that debate about Will and.", "newpara": true, "start": 1499.203, "speaker": "Erin Banks"}, {"confidence": 0.95, "end": 1520.913, "track": 0, "text": "You know the millennial brought that up even a little bit before like there's a there's so much more that you want to know about me but then also maybe in some cases I want to protect it so how does a company find that like almost that's fine line,", "newpara": true, "start": 1508.764, "speaker": "Erin Banks"}, {"confidence": 0.96, "end": 1537.312, "track": 0, "text": "between the data analytics and utilizing data so that there are no restrictions and making sure you know I appreciate the concept of Ethics right and that they're going to do the right thing but you can't always guarantee that people are going to do that right so how where is that fine line and how do you protect and how do you,", "start": 1520.752, "speaker": "Erin Banks"}, {"confidence": 0.82, "end": 1541.338, "track": 0, "text": "how do you use those think that certainly have that analytics perspective so I can still.", "start": 1537.114, "speaker": "Erin Banks"}, {"confidence": 0.91, "end": 1547.642, "track": 0, "text": "Make sure that my business is growing then I'm creating new products and services I don't understand what my consumers are looking for in those capabilities.", "start": 1541.303, "speaker": "Erin Banks"}, {"confidence": 0.95, "end": 1552.93, "track": 2, "text": "Sure so let's take an example like an account system right so I'm,", "newpara": true, "start": 1548.243, "speaker": "Carey James"}, {"confidence": 0.94, "end": 1568.523, "track": 2, "text": "pick any company retail in a telecommunications carrier whatever I'm going to have information about the customer might have information about what they're doing inside that customer information I also have do we'll have things like credit card number I will have social security number,", "start": 1553.104, "speaker": "Carey James"}, {"confidence": 0.97, "end": 1572.886, "track": 2, "text": "or some type of identifier I have street address different types of information.", "start": 1568.368, "speaker": "Carey James"}, {"confidence": 0.92, "end": 1582.08, "track": 2, "text": "About that user so I do want to know who you are you know who Terry James is why does he doing you know how the interacting with my organization.", "start": 1573.085, "speaker": "Carey James"}, {"confidence": 0.92, "end": 1588.449, "track": 2, "text": "But what I don't want to do is you know have a breach of where I am,", "start": 1582.273, "speaker": "Carey James"}, {"confidence": 0.94, "end": 1596.508, "track": 2, "text": "allowing Carey James is private information credit card number street address social security number again back as examples to be,", "start": 1588.414, "speaker": "Carey James"}, {"confidence": 0.9, "end": 1599.32, "track": 2, "text": "you know out on the open market place and so,", "start": 1596.43, "speaker": "Carey James"}, {"confidence": 0.94, "end": 1612.684, "track": 2, "text": "again the way to do that in the past was you created either you know multiple views of data that had this information protected you had different files of this information in the head to Pico system different cables inside the system.", "start": 1599.14, "speaker": "Carey James"}, {"confidence": 0.98, "end": 1616.326, "track": 2, "text": "And so if I forgot.", "start": 1612.925, "speaker": "Carey James"}, {"confidence": 0.83, "end": 1623.302, "track": 2, "text": "You're literally forgot to do this somewhere then you run and you rented you a you have an exposure right you have a breach.", "start": 1616.698, "speaker": "Carey James"}, {"confidence": 0.92, "end": 1628.181, "track": 2, "text": "Policy model the way we do it would be to Central life policy definition with.", "start": 1623.417, "speaker": "Carey James"}, {"confidence": 0.88, "end": 1636.354, "track": 2, "text": "Enforcement point we actually intercept a query in what I mean by that is if I typed select star from account.", "start": 1628.356, "speaker": "Carey James"}, {"confidence": 0.87, "end": 1639.761, "track": 2, "text": "You know typically the day you because everything back.", "start": 1636.582, "speaker": "Carey James"}, {"confidence": 0.88, "end": 1653.299, "track": 2, "text": "And how you protect that was we talking about you having to you and I love you would say oh Carrie trying to trying to select my accounts but he's gets of you that doesn't have social security number it has it all to me the last four words for visible.", "newpara": true, "start": 1639.635, "speaker": "Carey James"}, {"confidence": 0.94, "end": 1657.698, "track": 2, "text": "And then we go okay Aaron has another.", "start": 1653.732, "speaker": "Carey James"}, {"confidence": 0.89, "end": 1671.729, "track": 2, "text": "View of this data and she's a financial services rap so she can see all of these social security number and Rob is a manager he can't see anything so you got to do that,", "start": 1657.873, "speaker": "Carey James"}, {"confidence": 0.91, "end": 1678.381, "track": 2, "text": "then you you have that exposure so with the way we handle this we do give that freedom.", "start": 1671.573, "speaker": "Carey James"}, {"confidence": 0.92, "end": 1685.85, "track": 2, "text": "To the data right so you reprovision People based on who they are and the attributes about the information in the context of other trying to,", "start": 1678.52, "speaker": "Carey James"}, {"confidence": 0.93, "end": 1695.789, "track": 2, "text": "utilize it and then we would by default look at my policy and Carrie is this and we we actually modify the query in flight.", "start": 1685.881, "speaker": "Carey James"}, {"confidence": 0.93, "end": 1706.173, "track": 2, "text": "I'm so we submitted to the database you don't have to understand it you know Carrie get this mass for the policy does that we actually talked to the database and we bring back,", "start": 1696.216, "speaker": "Carey James"}, {"confidence": 0.93, "end": 1719.754, "track": 2, "text": "what's called a compliant results at so in my case it would come back with the social security number Mass out so for the last four and your case it would come back with a social security number in Rob's case it would come back with the column deny,", "start": 1706.348, "speaker": "Carey James"}, {"confidence": 0.91, "end": 1728.671, "track": 2, "text": "we would just put One X in it right for this will say it's a numeric was making An American Tail we actually put a zero in it so your Downstream processing wouldn't break.", "start": 1719.82, "speaker": "Carey James"}, {"confidence": 0.92, "end": 1741.314, "track": 2, "text": "Cuz we don't want to remove social security number cuz it may be other things that are working on it that but he's actually denied access and so is that results that comes back to him it's got a zero right in this case of a numeric field.", "start": 1728.93, "speaker": "Carey James"}, {"confidence": 0.93, "end": 1748.147, "track": 2, "text": "And therefore I never get to see the data right but the actual predicate and what's happening the database.", "newpara": true, "start": 1741.405, "speaker": "Carey James"}, {"confidence": 0.94, "end": 1760.669, "track": 2, "text": "Still happened right so join still work you know knowing a still equals a still works but it's when we when we surface right when we display that resultset that's when we protect the information.", "start": 1748.495, "speaker": "Carey James"}, {"confidence": 0.82, "end": 1765.681, "track": 3, "text": "Because it is another positive aspect to this to write that where they can carry you.", "newpara": true, "start": 1760.369, "speaker": "Rob Hout"}, {"confidence": 0.9, "end": 1777.381, "track": 3, "text": "Touched on the subject a little bit so one of the positive outcomes of being able to have a policy-based security approach over top of a single Source or a single source of the truth the fact that I don't have.", "newpara": true, "start": 1765.742, "speaker": "Rob Hout"}, {"confidence": 0.93, "end": 1787.073, "track": 3, "text": "Like the proliferation of junk copies of data has multiple multiple copies that are slightly reduced or pieces pulled out and I'm just not feeling my data center with John.", "newpara": true, "start": 1777.327, "speaker": "Rob Hout"}, {"confidence": 0.9, "end": 1795.203, "track": 3, "text": "Right I've got a single source of the truth with the nice security policy layered side on top is it that kind of how you see this or is this.", "newpara": true, "start": 1787.23, "speaker": "Rob Hout"}, {"confidence": 0.88, "end": 1799.83, "track": 2, "text": "What is a positive benefit so you absolutely have that right you know.", "newpara": true, "start": 1795.703, "speaker": "Carey James"}, {"confidence": 0.88, "end": 1809.595, "track": 2, "text": "So I you know I work for Dell EMC in the past so I'll get it in your sister is perspective in but we do want people store in the information in the the most appropriate.", "start": 1800.149, "speaker": "Carey James"}, {"confidence": 0.92, "end": 1819.648, "track": 2, "text": "Waiting for Matt and yes what this does is it does remove that need right not completely right it will never remove the entire need to have.", "start": 1809.968, "speaker": "Carey James"}, {"confidence": 0.9, "end": 1828.722, "track": 2, "text": "Copies of data for 4 backup and protection other pieces but utilizing copies and redactions of information.", "newpara": true, "start": 1820.244, "speaker": "Carey James"}, {"confidence": 0.93, "end": 1834.028, "track": 2, "text": "For security that's absolutely where we see this you know moving away from.", "start": 1828.951, "speaker": "Carey James"}, {"confidence": 0.93, "end": 1841.894, "track": 2, "text": "Movie towards this type of a you know whether be a golden coffee or a source of the truth it's now I've got,", "start": 1834.239, "speaker": "Carey James"}, {"confidence": 0.92, "end": 1851.286, "track": 2, "text": "yeah the same I can have the same data I'm no longer arguing about where did your data come from where to my data come from which you know we know never happens.", "start": 1841.816, "speaker": "Carey James"}, {"confidence": 0.95, "end": 1858.046, "track": 2, "text": "But then we also get to that point of when you move data from system a to system B.", "start": 1851.545, "speaker": "Carey James"}, {"confidence": 0.94, "end": 1864.963, "track": 2, "text": "Right that we actually the policies actually can follow it right there's a process and procedure where you can actually,", "start": 1858.335, "speaker": "Carey James"}, {"confidence": 0.96, "end": 1874.595, "track": 2, "text": "move the date of the most appropriate storage medium write the most appropriate data platform and not have to worry about okay now that I move data from here to here,", "start": 1864.795, "speaker": "Carey James"}, {"confidence": 0.91, "end": 1879.805, "track": 2, "text": "hey Tabby right B doesn't have the type of security information so I don't know I can't do that.", "start": 1874.578, "speaker": "Carey James"}, {"confidence": 0.93, "end": 1887.737, "track": 2, "text": "Right and so by taking the data the date eccentric access protection a layer from the actual data application.", "start": 1880.142, "speaker": "Carey James"}, {"confidence": 0.96, "end": 1892.484, "track": 2, "text": "Right now we actually allow you to apply different information across.", "start": 1887.912, "speaker": "Carey James"}, {"confidence": 0.95, "end": 1904.136, "track": 2, "text": "The different platform so now you can make that decision based on no business process policy cost-effectiveness vs. security capabilities of the underlined siloed platform.", "start": 1892.653, "speaker": "Carey James"}, {"confidence": 0.65, "end": 1906.149, "track": 1, "text": "You took a policy in.", "newpara": true, "start": 1903.926, "speaker": "Brett Roberts"}, {"confidence": 0.89, "end": 1913.985, "track": 1, "text": "Feel important policy but I think that being able to set that policy into fine with that policy is this critical right so can you just talking about,", "newpara": true, "start": 1906.113, "speaker": "Brett Roberts"}, {"confidence": 0.89, "end": 1924.747, "track": 1, "text": "the importance of having a role for a chief data officer or a chief did a Governor's officer and it how old that is critical to this whole security and in policy based approach.", "start": 1913.991, "speaker": "Brett Roberts"}, {"confidence": 0.91, "end": 1934.422, "track": 2, "text": "I absolutely right and because it's his people process and technology so we're we're the technology side that allows it to be feasible.", "newpara": true, "start": 1924.868, "speaker": "Carey James"}, {"confidence": 0.94, "end": 1943.682, "track": 2, "text": "What if you do not have like a governance process in the governance board in place then you don't know what types of information you want to protect,", "start": 1934.566, "speaker": "Carey James"}, {"confidence": 0.92, "end": 1954.312, "track": 2, "text": "you won't have classifications of data therefore you won't be able to actually go okay I know that carry is a CSR I know the CSR should not have access to the you know,", "start": 1943.712, "speaker": "Carey James"}, {"confidence": 0.91, "end": 1963.079, "track": 2, "text": "only the only have access to the last 4 digits of the social security number they should not have access to credit card you know whatever those rules are have to be to find,", "start": 1954.198, "speaker": "Carey James"}, {"confidence": 0.86, "end": 1972.057, "track": 2, "text": "buy a people in a governance board so that Chief data you know chief petty officer Chief governance officer is important in helping to companies set their strategies,", "start": 1963.217, "speaker": "Carey James"}, {"confidence": 0.93, "end": 1979.826, "track": 2, "text": "right in and helping those companies put together the right policies and processes in their case right to actually,", "start": 1972.177, "speaker": "Carey James"}, {"confidence": 0.95, "end": 1984.513, "track": 2, "text": "make those real and that way you know what you're trying to follow so this goes back to your point,", "start": 1979.803, "speaker": "Carey James"}, {"confidence": 0.93, "end": 1997.853, "track": 2, "text": "Erin up are we doing security after the fact or we trying to now be more proactive those rules allow you to be more proactive and defining types of data and classifying it so you know what policies are needed.", "start": 1984.544, "speaker": "Carey James"}, {"confidence": 0.87, "end": 2008.159, "track": 2, "text": "Versus trying to play you know catch up and going okay whoops this is security is a sensitive data therefore we got to protect it,", "start": 1998.407, "speaker": "Carey James"}, {"confidence": 0.94, "end": 2019.173, "track": 2, "text": "this is the other model moving forward saying no we're going to Define our policies were going to find how we're going to manage you control sensitive data then when a data classification hits this we already know what we're doing.", "start": 2008.021, "speaker": "Carey James"}, {"confidence": 0.85, "end": 2022.412, "track": 2, "text": "Versus trying to understand you know after the fact.", "newpara": true, "start": 2019.33, "speaker": "Carey James"}, {"confidence": 0.94, "end": 2038.042, "track": 0, "text": "Yeah and I get like completely and utterly surprised when there's so many large companies and I mean all companies could utilize a cheap did Officer cheap that are governs officer because if they're going to implement it did analytics project and they don't understand,", "newpara": true, "start": 2022.978, "speaker": "Erin Banks"}, {"confidence": 0.78, "end": 2040.296, "track": 0, "text": "their data and they're not,", "start": 2037.85, "speaker": "Erin Banks"}, {"confidence": 0.91, "end": 2048.258, "track": 0, "text": "look at the classification or how even customer names are written out our address is are things along those if they don't look at their data like it has a Valium,", "start": 2040.314, "speaker": "Erin Banks"}, {"confidence": 0.93, "end": 2057.439, "track": 0, "text": "but I think that their outcomes are going to be less effective because they don't really either haven't Creighton like a symmetry across all of either the divisions or.", "start": 2048.078, "speaker": "Erin Banks"}, {"confidence": 0.83, "end": 2062.138, "track": 0, "text": "Just even within the entire company and it just fast and I try to always ask.", "start": 2057.326, "speaker": "Erin Banks"}, {"confidence": 0.87, "end": 2070.773, "track": 0, "text": "Companies that I had that I talk to you whether or not they have a chief data officer and a lot of times that they don't and they are a lot of more incredibly successful data analytics and I keep thinking like.", "start": 2062.061, "speaker": "Erin Banks"}, {"confidence": 0.93, "end": 2075.551, "track": 0, "text": "Well you know I can only imagine how much more impact you would have if you had somebody that literally.", "start": 2070.624, "speaker": "Erin Banks"}, {"confidence": 0.93, "end": 2088.194, "track": 0, "text": "Need to put rules and regulations in place about the date and how it's going to be used so I hope you know they keep talking about it being a new position in a lot of companies are taking it on I don't I hope that people see the advantage of the benefit of it.", "start": 2075.599, "speaker": "Erin Banks"}, {"confidence": 0.93, "end": 2089.45, "track": 0, "text": "As a whole.", "start": 2088.086, "speaker": "Erin Banks"}, {"confidence": 0.95, "end": 2094.702, "track": 2, "text": "Yes I think the big thing there is I've been guilty of making this comment in my,", "newpara": true, "start": 2089.222, "speaker": "Carey James"}, {"confidence": 0.93, "end": 2104.809, "track": 2, "text": "in the past right we always say people don't do you don't do governance for the sake of doing governance which I think is true but,", "start": 2094.63, "speaker": "Carey James"}, {"confidence": 0.92, "end": 2114.081, "track": 2, "text": "you know with that said I think they're I've seen more and more companies now starting with it they have a chief governance officer or not they're putting in,", "start": 2104.839, "speaker": "Carey James"}, {"confidence": 0.89, "end": 2122.277, "track": 2, "text": "governance boards and the one thing I've seen kind of flawed in the chief data officer is they bring them in and they only focus on,", "start": 2113.919, "speaker": "Carey James"}, {"confidence": 0.92, "end": 2133.394, "track": 2, "text": "you know the use of the day though. What are we doing with this information how do I get better marketing campaigns Accentra again versus looking at it from a holistic perspective.", "start": 2122.284, "speaker": "Carey James"}, {"confidence": 0.89, "end": 2145.003, "track": 2, "text": "Which is how are we using this data what is the contacts relationship of this data and my customer and you go back to the very early Point are we actively using this in the right,", "start": 2133.653, "speaker": "Carey James"}, {"confidence": 0.89, "end": 2156.415, "track": 2, "text": "manner but if we do find that upfront we can actually have that Freedom of Information right I can have my data scientist to look at marketing campaigns a different types of information without the fear.", "start": 2144.968, "speaker": "Carey James"}, {"confidence": 0.88, "end": 2171.503, "track": 2, "text": "But I'm going to expose you know sensitive data to the world but they need that has to be a conscious decision and then there needs to be interviewed epr kind of puts in place for this there is there their compliance officers I have to come on board,", "start": 2156.626, "speaker": "Carey James"}, {"confidence": 0.82, "end": 2180.463, "track": 2, "text": "for the controllers\nOrsini here more than us as well right of the sea so so cheap information in security officers.", "start": 2171.654, "speaker": "Carey James"}, {"confidence": 0.91, "end": 2187.854, "track": 2, "text": "That role is also be a big out there but we seen in the past what I've seen in the past is everybody treated him Asylum.", "newpara": true, "start": 2180.481, "speaker": "Carey James"}, {"confidence": 0.87, "end": 2192.379, "track": 2, "text": "Write different events and entities I think what we're starting to see,", "start": 2187.957, "speaker": "Carey James"}, {"confidence": 0.93, "end": 2198.238, "track": 2, "text": "I think we'll continue to see where is the success will come into is that you see these all as a.", "start": 2192.319, "speaker": "Carey James"}, {"confidence": 0.92, "end": 2207.402, "track": 2, "text": "Interdisciplinary unit to achieve the outcomes and not as individual events that you know are to be over, or to outflank.", "start": 2198.352, "speaker": "Carey James"}, {"confidence": 0.94, "end": 2220.327, "track": 1, "text": "Yeah I've seen that as well and a couple customers where where they are collecting the data first or bring all the date in to see what repository or they're getting their data strategy but then stage 2 or stage 3 years.", "newpara": true, "start": 2208.117, "speaker": "Brett Roberts"}, {"confidence": 0.96, "end": 2223.482, "track": 1, "text": "We need somebody to manage the entire end-to-end.", "newpara": true, "start": 2220.231, "speaker": "Brett Roberts"}, {"confidence": 0.91, "end": 2232.483, "track": 1, "text": "Hot process and policy of the data but it's an afterthought almost and I think that we need to add in organizations need to make that part of their stage 1.", "newpara": true, "start": 2223.543, "speaker": "Brett Roberts"}, {"confidence": 0.84, "end": 2237.525, "track": 1, "text": "And it didn't look Stern United States two or three to be the most successful and get the most out of it.", "newpara": true, "start": 2232.454, "speaker": "Brett Roberts"}, {"confidence": 0.91, "end": 2252.025, "track": 0, "text": "No I totally agree thank you so much Carrie for your time and for answering all these questions we have just a couple more for you before we let you leave what year do you think that Skynet will go online.", "newpara": true, "start": 2238.12, "speaker": "Erin Banks"}, {"confidence": 0.81, "end": 2257.986, "track": 2, "text": "I will ask John Connor has anything to it. I'm before they come online.", "newpara": true, "start": 2251.935, "speaker": "Carey James"}, {"confidence": 0.88, "end": 2267.438, "track": 1, "text": "I think that's the second best answer I've heard to this yet today but the second best to that.", "newpara": true, "start": 2260.294, "speaker": "Brett Roberts"}, {"confidence": 0.95, "end": 2273.243, "track": 0, "text": "That's funny I'm so if you were going to buy me a book Harry what would it be.", "newpara": true, "start": 2267.361, "speaker": "Erin Banks"}, {"confidence": 0.87, "end": 2282.821, "track": 2, "text": "Are we going to buy you a book Miss Banks so I think that there's a couple of them out there but I think one is going to be important to this kind of conversation,", "newpara": true, "start": 2273.015, "speaker": "Carey James"}, {"confidence": 0.93, "end": 2295.146, "track": 2, "text": "right there's two of them out there one is digital disciplines and the other is platform Revolution right so it's starting to think about this we talked about as ecosystems and you know start to finish is not.", "start": 2282.684, "speaker": "Carey James"}, {"confidence": 0.96, "end": 2296.955, "track": 2, "text": "Is we had in the past right,", "start": 2295.201, "speaker": "Carey James"}, {"confidence": 0.86, "end": 2305.368, "track": 2, "text": "starts and stops along the different mechanism was seen this as a eventual flow.", "start": 2296.841, "speaker": "Carey James"}, {"confidence": 0.78, "end": 2312.146, "track": 2, "text": "And again not as you know thanks be over, right so governance nobody does governor governor sake agreed,", "start": 2305.542, "speaker": "Carey James"}, {"confidence": 0.8, "end": 2321.34, "track": 2, "text": "but instead of just having a government policy in place you actually have the themes word protect the information that needed to be there and that comes in at the very beginning right not at the end.", "start": 2312.026, "speaker": "Carey James"}, {"confidence": 0.93, "end": 2327.451, "track": 0, "text": "I like it I like it so what kind of music are you listening to right now.", "newpara": true, "start": 2321.406, "speaker": "Erin Banks"}, {"confidence": 0.92, "end": 2331.099, "track": 2, "text": "Music of your sweet voice notes,", "newpara": true, "start": 2327.151, "speaker": "Carey James"}, {"confidence": 0.89, "end": 2343.97, "track": 2, "text": "my favorite you know so yo yo get my I went to high school in the 80s right so I am still a Metalhead I'm so and now they call that classic rock but also.", "start": 2331.045, "speaker": "Carey James"}, {"confidence": 0.96, "end": 2345.797, "track": 2, "text": "Still my favorites out there.", "start": 2344.186, "speaker": "Carey James"}, {"confidence": 0.88, "end": 2350.195, "track": 0, "text": "LOL so what's your favorite piece of useless technology right now.", "newpara": true, "start": 2345.929, "speaker": "Erin Banks"}, {"confidence": 0.96, "end": 2352.515, "track": 2, "text": "My Macintosh computer.", "newpara": true, "start": 2350.064, "speaker": "Carey James"}, {"confidence": 0.96, "end": 2359.936, "track": 0, "text": "And what is your biggest Money Pit\nyour Macintosh computer.", "newpara": true, "start": 2352.569, "speaker": "Erin Banks"}, {"confidence": 0.95, "end": 2371.714, "track": 2, "text": "My Big Money Pit right but my biggest consumer of my fines now or my two teenage daughters and getting them prepared for college so that's where most of my funds go to these days.", "newpara": true, "start": 2356.787, "speaker": "Carey James"}, {"confidence": 0.95, "end": 2376.154, "track": 0, "text": "That's awesome I'm so are you going anywhere interesting soon.", "newpara": true, "start": 2371.732, "speaker": "Erin Banks"}, {"confidence": 0.94, "end": 2387.824, "track": 2, "text": "Other than here now so I'm actually finally having my knee fixed right after Thanksgiving so I'll be I will be,", "newpara": true, "start": 2375.854, "speaker": "Carey James"}, {"confidence": 0.86, "end": 2392.86, "track": 2, "text": "interesting place for me will be from the couch to the refrigerator but that's about it.", "start": 2387.728, "speaker": "Carey James"}, {"confidence": 0.88, "end": 2399.199, "track": 0, "text": "Yeah so on that note I'm just curious of what is your 2017 of Delta status.", "newpara": true, "start": 2393.022, "speaker": "Erin Banks"}, {"confidence": 0.84, "end": 2408.501, "track": 2, "text": "2017 Diamond 2018-2018 I'm diamond and 2099 5000 miles short of diamond.", "newpara": true, "start": 2398.899, "speaker": "Carey James"}, {"confidence": 0.67, "end": 2411.716, "track": 0, "text": "Really you're already in 2019.", "newpara": true, "start": 2408.634, "speaker": "Erin Banks"}, {"confidence": 0.99, "end": 2413.903, "track": 2, "text": "Yes.", "newpara": true, "start": 2411.422, "speaker": "Carey James"}, {"confidence": 0.91, "end": 2418.332, "track": 0, "text": "That's crazy no wonder you need her that's nuts that's that's.", "newpara": true, "start": 2413.604, "speaker": "Erin Banks"}, {"confidence": 0.89, "end": 2428.049, "track": 2, "text": "I am I family agree with you so the great news is the last four months that is on drastically changed with the the new role with two blue talents out.", "newpara": true, "start": 2416.632, "speaker": "Carey James"}, {"confidence": 0.91, "end": 2434.557, "track": 0, "text": "That's good although you're going to miss it though once you start having to sit in coach it's going to break your heart.", "newpara": true, "start": 2428.175, "speaker": "Erin Banks"}, {"confidence": 0.94, "end": 2439.304, "track": 1, "text": "Have you had the the Porsche pick you up by the plane and take you to the lounge yet.", "newpara": true, "start": 2434.256, "speaker": "Brett Roberts"}, {"confidence": 0.94, "end": 2448.48, "track": 2, "text": "I've not had to pick me up take me to the lounge I've had to pick me up and take me to the next gate cuz it was a couple concourses away so they didn't pick me up and I'm driving straight to the next plane.", "newpara": true, "start": 2439.719, "speaker": "Carey James"}, {"confidence": 0.88, "end": 2454.831, "track": 1, "text": "That's when you know you've made it right has as far as the road warrior.", "newpara": true, "start": 2451.178, "speaker": "Brett Roberts"}, {"confidence": 0.94, "end": 2462.433, "track": 2, "text": "I live in Atlanta and I very seldom ever change planes in Atlanta but I was flying through Atlanta going somewhere.", "newpara": true, "start": 2454.862, "speaker": "Carey James"}, {"confidence": 0.9, "end": 2466.429, "track": 2, "text": "And you know is happens in the summer,", "start": 2462.559, "speaker": "Carey James"}, {"confidence": 0.92, "end": 2480.61, "track": 2, "text": "I'm in the South right weather delays and I was really really tight connection it was like me are just walking up to the front you know,", "start": 2466.297, "speaker": "Carey James"}, {"confidence": 0.9, "end": 2482.936, "track": 2, "text": "the lady was standing there in the jetway.", "start": 2480.508, "speaker": "Carey James"}, {"confidence": 0.91, "end": 2492.79, "track": 2, "text": "Are you mr. James I'm like yeah she's like come with me as we actually went down the stairs were they take the bags got into the Porsche drive me to the next one walked up.", "start": 2483.405, "speaker": "Carey James"}, {"confidence": 0.73, "end": 2494.731, "track": 2, "text": "You know and they had the um.", "start": 2492.929, "speaker": "Carey James"}, {"confidence": 0.88, "end": 2503.673, "track": 2, "text": "They they just there and they should have to verify my stop and check me in and I was on the plane so I mean it was you know it was a very nice experience.", "start": 2494.81, "speaker": "Carey James"}, {"confidence": 0.93, "end": 2517.83, "track": 0, "text": "That's awesome that's awesome idea I was in one of the first times I've ever done that in at New York at Kennedy so that was pretty cool I was as exciting they took me to the lounge great experience I highly recommend but it means that you fly wait wait.", "newpara": true, "start": 2503.505, "speaker": "Erin Banks"}, {"confidence": 0.95, "end": 2519.29, "track": 2, "text": "Way too much.", "newpara": true, "start": 2517.53, "speaker": "Carey James"}, {"confidence": 0.94, "end": 2523.527, "track": 0, "text": "Yeah so I'll ask question what show are you binging on right now.", "newpara": true, "start": 2518.99, "speaker": "Erin Banks"}, {"confidence": 0.91, "end": 2534.187, "track": 2, "text": "I'm actually not binging on any shows cuz I was just being crazy cuz I was able to catch up on my Game of Thrones which I you know is my favorite you could help me all you want.", "newpara": true, "start": 2523.233, "speaker": "Carey James"}, {"confidence": 0.97, "end": 2536.537, "track": 0, "text": "I've never watched it I mean that's why I just never.", "newpara": true, "start": 2533.887, "speaker": "Erin Banks"}, {"confidence": 0.92, "end": 2544.703, "track": 2, "text": "Now you got a binge on it there's a couple people shows of people trying to get me to binge on and I'm just right now I'm kind of refusing to take on a new one just.", "newpara": true, "start": 2536.236, "speaker": "Carey James"}, {"confidence": 0.92, "end": 2553.939, "track": 2, "text": "Cuz I'm trying to get a little bit of time back for me I'm actually back into reading I'm going to my JRR Tolkien for like the $87,000.", "start": 2544.8, "speaker": "Carey James"}, {"confidence": 0.93, "end": 2562.844, "track": 2, "text": "Right Touch I haven't read it in like a year-and-a-half two years I'm trying to go through that now and get back into doing a little more reading versus watching but.", "start": 2554.336, "speaker": "Carey James"}, {"confidence": 0.88, "end": 2564.719, "track": 0, "text": "Yeah I would love to do them.", "newpara": true, "start": 2562.995, "speaker": "Erin Banks"}, {"confidence": 0.92, "end": 2576.515, "track": 1, "text": "Okay so I got one question for you as well we try to ask some every show who is your favorite bearded person from history or current day but you had a name a person with your favorite. Who would that be.", "newpara": true, "start": 2564.666, "speaker": "Brett Roberts"}, {"confidence": 0.86, "end": 2583.876, "track": 2, "text": "All my favorite beard that's an actual interesting question\nwow.", "newpara": true, "start": 2576.918, "speaker": "Carey James"}, {"confidence": 0.84, "end": 2585.522, "track": 0, "text": "Injerto can have one.", "newpara": true, "start": 2583.672, "speaker": "Erin Banks"}, {"confidence": 0.93, "end": 2595.882, "track": 2, "text": "All talking had one right inside his mythical characters have beards but their mythical characters I'm trying to think of an actual you know person I like Did JR talking did have one but.", "newpara": true, "start": 2585.595, "speaker": "Carey James"}, {"confidence": 0.79, "end": 2600.761, "track": 1, "text": "We can't we can do school character so I Gandalf is always a pretty popular one.", "newpara": true, "start": 2595.582, "speaker": "Brett Roberts"}, {"confidence": 0.76, "end": 2604.974, "track": 2, "text": "Yeah I can get us a really cool am I think for me it's it's interesting is on.", "newpara": true, "start": 2600.744, "speaker": "Carey James"}, {"confidence": 0.94, "end": 2613.399, "track": 2, "text": "My daughter is going to yell at me now cuz I'm actually drawing a blank he is actually one of the German philosophist.", "newpara": true, "start": 2605.725, "speaker": "Carey James"}, {"confidence": 0.88, "end": 2621.186, "track": 2, "text": "And I am just completely blanking and she's him sitting on the other room listening to me and then yell at me after the.", "newpara": true, "start": 2614.036, "speaker": "Carey James"}, {"confidence": 0.91, "end": 2625.735, "track": 0, "text": "It's alright we'll put it in the notes cuz everyone's going to be wondering who it was.", "newpara": true, "start": 2619.859, "speaker": "Erin Banks"}, {"confidence": 0.95, "end": 2637.056, "track": 2, "text": "Yeah I'm off I'll get that to you I'll find out who it is and he's actually pretty cool right cuz he some of the the modern Concepts and it's not Freud listen to Modern concepts of how we actually younossi can interact.", "newpara": true, "start": 2625.435, "speaker": "Carey James"}, {"confidence": 0.81, "end": 2647.65, "track": 2, "text": "Nonito was think you can slavia nor Russian but\noh goodness gracious give me give me.", "newpara": true, "start": 2638.643, "speaker": "Carey James"}, {"confidence": 0.77, "end": 2648.852, "track": 0, "text": "Pumpkin bread.", "newpara": true, "start": 2647.729, "speaker": "Erin Banks"}, {"confidence": 0.85, "end": 2656.369, "track": 2, "text": "No did it two seconds and I will and I will fight until hell no I was yelling at my daughter around the corner literally so.", "newpara": true, "start": 2648.552, "speaker": "Carey James"}, {"confidence": 0.94, "end": 2660.966, "track": 1, "text": "Wilhelm group okay we'll have to do some research on that.", "newpara": true, "start": 2656.995, "speaker": "Brett Roberts"}, {"confidence": 0.91, "end": 2671.47, "track": 0, "text": "Yeah absolutely will thank you so much I really appreciate all your time now what is the best way for us to find you on social media or other mediums.", "newpara": true, "start": 2660.684, "speaker": "Erin Banks"}, {"confidence": 0.95, "end": 2685.838, "track": 2, "text": "You can always find me on Twitter at Carey James 33 set Carey James the number 33 you can also find me on LinkedIn again Carey James you can find their assets that's pretty much it.", "newpara": true, "start": 2671.387, "speaker": "Carey James"}, {"confidence": 0.95, "end": 2691.336, "track": 0, "text": "Well thank you guys so much for your time I really appreciate it and I wish you a happy holiday.", "newpara": true, "start": 2685.538, "speaker": "Erin Banks"}]