[{"confidence": 0.86, "end": 14.8, "track": 1, "text": "I am beautiful Phoenix Arizona at The Phoenician Resort and we are.", "newpara": true, "start": 11.658, "speaker": "Cory"}, {"confidence": 0.89, "end": 23.225, "track": 1, "text": "Lucky enough to have mr. Scott now CTO of hortonworks doing in this here in the Cypress conference room Scott welcome to the show.", "start": 15.011, "speaker": "Cory"}, {"confidence": 0.95, "end": 29.324, "track": 0, "text": "Thanks for having I see you pull out all the stops on the accommodations for today's podcast is beautiful thank you.", "newpara": true, "start": 23.484, "speaker": "Scott"}, {"confidence": 0.94, "end": 34.089, "track": 1, "text": "Yes we're going for a conference boring is the theme of think that we went for.", "newpara": true, "start": 29.06, "speaker": "Cory"}, {"confidence": 0.95, "end": 35.964, "track": 1, "text": "With a mix of Paisley.", "start": 34.168, "speaker": "Cory"}, {"confidence": 0.67, "end": 38.782, "track": 0, "text": "I will focus on the bigger issues than it has.", "newpara": true, "start": 36.68, "speaker": "Scott"}, {"confidence": 0.96, "end": 48.829, "track": 1, "text": "That's awesome well joining me also a co-host for today is Brett Roberts and we are going to jump in with Scott because sales kickoff is really where.", "newpara": true, "start": 38.482, "speaker": "Cory"}, {"confidence": 0.96, "end": 55.205, "track": 1, "text": "Like every tech company we bring you the best and the brightest from the company leadership to come in and talk with the sales.", "start": 48.902, "speaker": "Cory"}, {"confidence": 0.93, "end": 66.652, "track": 1, "text": "Pre-sales and partner community that support and leave it organization to hear what's going on what's 2018 going to be about but because it's the the start of the year I can't like to take just a second Scott and talk with you about.", "start": 55.338, "speaker": "Cory"}, {"confidence": 0.92, "end": 79.8, "track": 1, "text": "2017 and get kind of a backward view of you know what were some of the big things that you saw his Trends or macro Trends in 2017 that you thought were you know really pression that I think you're going to maybe set us up in 2018.", "start": 66.911, "speaker": "Cory"}, {"confidence": 0.92, "end": 94.997, "track": 0, "text": "2017 I think was a great year for many reasons but on a technology front it feels to me like two themes really crystallize are very important for.", "newpara": true, "start": 82.048, "speaker": "Scott"}, {"confidence": 0.95, "end": 101.481, "track": 0, "text": "Both the industry as well as hortonworks in general right the first is that I think.", "start": 95.166, "speaker": "Scott"}, {"confidence": 0.98, "end": 106.583, "track": 0, "text": "People started to really realize that big data is more than Hadoop.", "start": 101.776, "speaker": "Scott"}, {"confidence": 0.96, "end": 117.639, "track": 0, "text": "It's more than GM running a spark job and all of those things it's really about being able to capture and connect lots and lots of different data and that means,", "start": 107.214, "speaker": "Scott"}, {"confidence": 0.98, "end": 155.508, "track": 0, "text": "along that path so that was that was big for me because it was kind of a validation of what we've been doing and it was also\na good thing,", "start": 146.387, "speaker": "Scott"}, {"confidence": 0.96, "end": 169.834, "track": 0, "text": "just because of us commercially and the product stack that we have but I think really for folks to kind of put their best foot forward and not have a big piece of the story missing in the technology strategy so you know the definition of modern-day architecture.", "start": 155.443, "speaker": "Scott"}, {"confidence": 0.88, "end": 178.968, "track": 0, "text": "And folks really looking at their streaming strategy as well as heard a two-story strategy strategy.", "start": 170.045, "speaker": "Scott"}, {"confidence": 0.93, "end": 185.295, "track": 0, "text": "A modern data architecture and I started to really see that come in full force that was kind of one big.", "newpara": true, "start": 179.131, "speaker": "Scott"}, {"confidence": 0.88, "end": 191.19, "track": 0, "text": "The second big thing that I saw which you know it again do depending on.", "start": 186.275, "speaker": "Scott"}, {"confidence": 0.91, "end": 201.346, "track": 0, "text": "Which analyst reading which magazines in on someone you know a lot of people talk about the hype of artificial intelligence anywhere from you know robots are going to eat Us Alive and,", "start": 191.341, "speaker": "Scott"}, {"confidence": 0.89, "end": 207.054, "track": 0, "text": "will be no more humans or we won't have any jobs anymore whenever it kind of it one end of the extreme,", "start": 201.274, "speaker": "Scott"}, {"confidence": 0.91, "end": 213.376, "track": 0, "text": "to hey this is just over Heights and what the heck is it's really just like more math,", "start": 207.007, "speaker": "Scott"}, {"confidence": 0.97, "end": 217.186, "track": 0, "text": "but the thing that was really interesting and crystallizing is I think.", "start": 213.244, "speaker": "Scott"}, {"confidence": 0.97, "end": 223.165, "track": 0, "text": "The whole machine learning and artificial intelligence wave has brought with it.", "start": 217.42, "speaker": "Scott"}, {"confidence": 0.86, "end": 231.079, "track": 0, "text": "The notion of the true value of all of this data right and so they've been some Skeptics who been looking at the Big Data.", "start": 223.688, "speaker": "Scott"}, {"confidence": 0.93, "end": 245.879, "track": 0, "text": "Crazed meal for the past 10 years and saying wow. It's kind of interesting but who cares right it's not as valuable as not like the Erp transactions that we had in the old bi stuff or you had very dense data relatively speaking.", "start": 231.614, "speaker": "Scott"}, {"confidence": 0.95, "end": 257.567, "track": 0, "text": "And the density of that data created some economics it created some value proposition and so on and people looked at the Big Data space I said yeah it was a lot of data being created but who cares.", "start": 247.43, "speaker": "Scott"}, {"confidence": 0.84, "end": 266.814, "track": 0, "text": "And the AI saying really I think clearly identifies yeah and and you should care because right and.", "start": 257.946, "speaker": "Scott"}, {"confidence": 0.96, "end": 278.076, "track": 0, "text": "And so whether you're wherever you are in the hype cycle of the way I would Define it is thinking about deep learning machine learning that drive kind of artificial intelligence applications.", "start": 267.073, "speaker": "Scott"}, {"confidence": 0.96, "end": 283.153, "track": 0, "text": "It's not a New Concept write the math was invented in the 1860s or whatever.", "newpara": true, "start": 278.352, "speaker": "Scott"}, {"confidence": 0.93, "end": 293.05, "track": 0, "text": "But the difference is the more data you add to these algorithm somewhere accurate they become and the more accurate these are griffins become those algorithms can mathematically be more accurate than.", "start": 283.352, "speaker": "Scott"}, {"confidence": 0.95, "end": 295.183, "track": 0, "text": "Very sophisticated human beings.", "start": 293.249, "speaker": "Scott"}, {"confidence": 0.94, "end": 310.104, "track": 0, "text": "And I don't see that as a threat I see that as an opportunity wouldn't you like to have a predictive model for personalized medicine telling you how to go cure your illness then a doctor who was 50 years in the industry but not quite as accurate.", "start": 295.514, "speaker": "Scott"}, {"confidence": 0.92, "end": 315.157, "track": 0, "text": "There's a huge opportunity there so this whole thing really identifies.", "start": 310.411, "speaker": "Scott"}, {"confidence": 0.94, "end": 330.517, "track": 0, "text": "The reason why you need a modern-day architecture is because there are these applications out there that are enriched by and enhanced by and can create new business models around having more and more data and the ability to process that they definitely and create.", "start": 315.543, "speaker": "Scott"}, {"confidence": 0.92, "end": 345.347, "track": 0, "text": "New kinds of decision-making capabilities and so those two things really came together right the realization of streaming and storage and analytics and kind of the whole modern in architecture and oh by the way there is actually a use case that is extremely high value.", "start": 330.703, "speaker": "Scott"}, {"confidence": 0.8, "end": 350.497, "track": 0, "text": "Brighton and hey capturing this data actually does make sense and we're not crazy.", "start": 345.702, "speaker": "Scott"}, {"confidence": 0.92, "end": 359.36, "track": 1, "text": "Yeah so what if they actually heard the said multiple times right in the Press you know and it goes along with the hype cycle thing you talked about which is,", "newpara": true, "start": 350.816, "speaker": "Cory"}, {"confidence": 0.95, "end": 371.03, "track": 1, "text": "so many folks if you look at the Genesis of organizations like hortonworks and and the development of Technology was amazing in this early rise with so few people really know how to take advantage of it and we're really like you said there was some.", "start": 359.222, "speaker": "Cory"}, {"confidence": 0.94, "end": 380.482, "track": 1, "text": "At least we saw that there were some of this it invested it without a real clear understanding how to derive value from and and there was these press books and like all I do is dead like this is a dead technology.", "start": 371.343, "speaker": "Cory"}, {"confidence": 0.92, "end": 387.447, "track": 1, "text": "And I and I feel like this and I'm curious if you feel the same way or feel very differently is I feel like.", "start": 380.771, "speaker": "Cory"}, {"confidence": 0.95, "end": 399.411, "track": 1, "text": "Hadoop in the way that organizations were buying it originally which was we need to buy technology for the sake of technology is dead but buying a as you describe the modern data architecture feels like something that's.", "start": 387.753, "speaker": "Cory"}, {"confidence": 0.93, "end": 408.124, "track": 1, "text": "Maybe the it's it's the next instantiation of using these interesting Technologies in a real way you think that's an accurate assessment of you feel differently about it.", "start": 399.898, "speaker": "Cory"}, {"confidence": 0.77, "end": 411.964, "track": 0, "text": "I'm I'm I'm on a parallel to ride with you.", "newpara": true, "start": 408.455, "speaker": "Scott"}, {"confidence": 0.95, "end": 419.607, "track": 0, "text": "I don't know if I would go as far as to say Hadoop is Dad because of course that's kind of a headline attention-getter and all that kind of stuff.", "start": 412.198, "speaker": "Scott"}, {"confidence": 0.99, "end": 420.555, "track": 1, "text": "Nobody would ever do that.", "newpara": true, "start": 419.313, "speaker": "Cory"}, {"confidence": 0.84, "end": 433.993, "track": 0, "text": "Yeah but but it it's like a piece of the puzzle and it's a key enabler for the modern-day architecture and I've done a piece and it's actually on our website we talked about the data Tipping Point and you know I don't want to,", "newpara": true, "start": 421.122, "speaker": "Scott"}, {"confidence": 0.87, "end": 438.8, "track": 0, "text": "it's been 40 minutes going through all of that here but I certainly encourage folks take a look at it,", "start": 433.933, "speaker": "Scott"}, {"confidence": 0.98, "end": 444.437, "track": 0, "text": "I think the key thing that the Hadoop stack did for the world was.", "start": 438.728, "speaker": "Scott"}, {"confidence": 0.95, "end": 456.064, "track": 0, "text": "It change the Paradigm where the old Paradigm for analytics data storage was you had to actually go to find a schema and then set up an ETL if you had to load the data and then you had to figure out what the heck is there.", "start": 444.756, "speaker": "Scott"}, {"confidence": 0.9, "end": 466.033, "track": 0, "text": "In the new world that's impossible a lot of it is created outside of your firewall you don't even know what it is you don't know how his crate is going to change over time as,", "start": 456.647, "speaker": "Scott"}, {"confidence": 0.93, "end": 473.857, "track": 0, "text": "sensors get reconfigured in song so the hoop stack changes at Paradigm where you can actually love the date of first and then go figure something out about it.", "start": 465.901, "speaker": "Scott"}, {"confidence": 0.92, "end": 486.716, "track": 0, "text": "That's the key concept now whether it's you know this Apache project that Apache project whether it's you know open source tonight that's actually not the important thing you poor thing is we change the Paradigm to make it easy to consume data very quickly.", "start": 474.368, "speaker": "Scott"}, {"confidence": 0.89, "end": 493.543, "track": 0, "text": "Everything else is then history and got kind of a crease to what I described earlier as this modern-day to architecture to enable.", "start": 487.174, "speaker": "Scott"}, {"confidence": 0.91, "end": 502.37, "track": 0, "text": "New kinds of applications and the fact that the core technology the poor who do technology changed at Paradigm and actually reverse that paradigm.", "start": 493.802, "speaker": "Scott"}, {"confidence": 0.94, "end": 512.309, "track": 0, "text": "Is what made the difference now they're a bunch of analyst. They're some of whom are really good friends of mine although and in the public domain sometimes we sparked a little bit which makes it interesting.", "start": 502.509, "speaker": "Scott"}, {"confidence": 0.86, "end": 519.935, "track": 0, "text": "Now saying Hadoop is Dad or even there was one that sell the hood offenders that aren't really who do fenders anymore,", "newpara": true, "start": 512.219, "speaker": "Scott"}, {"confidence": 0.87, "end": 528.155, "track": 0, "text": "and I would say that's absolutely true because it's not just to do pits really this modern-day to architecture that's enabled by hoodoo and many other things.", "start": 520.013, "speaker": "Scott"}, {"confidence": 0.92, "end": 542.595, "track": 1, "text": "Yeah I would actually I'm sure so that cuz it smells very similar to The evolutionary thread if you pull on a bunch of different technology companies right so the Duke was the this technology stack that change the Paradigm of how we deal with data and we deal with.", "newpara": true, "start": 528.354, "speaker": "Cory"}, {"confidence": 0.92, "end": 553.597, "track": 1, "text": "As you said transactions that are no longer dense and easy to put it in your pee there sensors there at the edge they're not our data feels like it's like what databases in Oracle did write Oracle started as a database company.", "start": 542.679, "speaker": "Cory"}, {"confidence": 0.91, "end": 559.835, "track": 1, "text": "And then use the fast forward 5 6 10 years into their evolution and Hugo are they database Company still.", "start": 553.808, "speaker": "Cory"}, {"confidence": 0.92, "end": 568.951, "track": 0, "text": "Yeah you know it's it's not an uncommon theme in shortly I've been in the date of business for longer than I should probably care.", "newpara": true, "start": 560.508, "speaker": "Scott"}, {"confidence": 0.91, "end": 575.807, "track": 0, "text": "And then I went through kind of the data warehouse bi Evolution starting in the late 80s.", "start": 569.179, "speaker": "Scott"}, {"confidence": 0.96, "end": 583.985, "track": 0, "text": "Dating myself now and you know way back then and you know when dinosaurs walked the Earth and I was starting my career,", "start": 576.126, "speaker": "Scott"}, {"confidence": 0.92, "end": 586.864, "track": 0, "text": "you know one of the pool Concepts was G,", "start": 583.932, "speaker": "Scott"}, {"confidence": 0.94, "end": 599.044, "track": 0, "text": "instead of having just as big monolithic database I can paralyze his stuff and so you know by paralyzing the stuff I can store more data than ever like maybe even hundreds of gigabyte,", "start": 586.726, "speaker": "Scott"}, {"confidence": 0.92, "end": 611.495, "track": 0, "text": "excuse me and I can efficiently process at data using prologue or them so I can get response times that are reasonable for human thought and so I can combine that technology.", "start": 600.715, "speaker": "Scott"}, {"confidence": 0.93, "end": 625.965, "track": 0, "text": "In space is what makes sense like Telco where tacos you know might have a huge database and might want to do some price elasticity study or something anyways it was technology that solve the problem for a very specific very scaled use case,", "start": 612.03, "speaker": "Scott"}, {"confidence": 0.91, "end": 633.987, "track": 0, "text": "and all of that morphed into what we now know is the bi landscape which is a multibillion-dollar kind of annual thing,", "start": 625.881, "speaker": "Scott"}, {"confidence": 0.92, "end": 639.683, "track": 0, "text": "and by the way if you don't have a bi strategy you're not in business anymore right it's it's in every unit item,", "start": 634.059, "speaker": "Scott"}, {"confidence": 0.94, "end": 646.648, "track": 0, "text": "and so that whole morphine eyes I see is what we've done right Hadoop started as Haley change the Paradigm you can store a bunch of data,", "start": 639.612, "speaker": "Scott"}, {"confidence": 0.97, "end": 651.359, "track": 0, "text": "this is very effective for extremely scaled organizations that have a very unique problem.", "start": 646.744, "speaker": "Scott"}, {"confidence": 0.96, "end": 654.784, "track": 1, "text": "Exactly exactly.", "newpara": true, "start": 652.747, "speaker": "Cory"}, {"confidence": 0.96, "end": 664.988, "track": 0, "text": "And and now you look at that and say gee that's really interesting technology but here are all of those business use cases and solutions that you can now go saw.", "newpara": true, "start": 654.484, "speaker": "Scott"}, {"confidence": 0.94, "end": 671.561, "track": 0, "text": "With the application of this technology and so we're morphing into a solutions kind of world instead of a tack.", "start": 665.306, "speaker": "Scott"}, {"confidence": 0.93, "end": 682.095, "track": 0, "text": "Tac only kind of world natural maturity by the way it is I see it happening about three or four times faster than it happened in the rdbms time what you would expect.", "start": 672.079, "speaker": "Scott"}, {"confidence": 0.87, "end": 689.006, "track": 0, "text": "Now based on the that the radar pace of change you were also expect that based on the open-source Paradigm that we've adopted where we've now got.", "start": 682.24, "speaker": "Scott"}, {"confidence": 0.93, "end": 694.42, "track": 0, "text": "Collaboration instead of competition in the space and so.", "start": 689.181, "speaker": "Scott"}, {"confidence": 0.9, "end": 707.147, "track": 0, "text": "I think that's all part of the natural process and I would expect in 3 to 5 years you know you'll be talking less and less I even talk less and less about Hadoop whenever I talk about modern-day architecture here's how you could solve the problem and so on.", "start": 695.015, "speaker": "Scott"}, {"confidence": 0.89, "end": 713.559, "track": 0, "text": "And a c c a c Solutions become ubiquitous lb new Solutions new names new business models.", "start": 707.586, "speaker": "Scott"}, {"confidence": 0.9, "end": 719.724, "track": 0, "text": "But they're all built around that same Cornerstone a differentiation of the cortex,", "newpara": true, "start": 714.749, "speaker": "Scott"}, {"confidence": 0.9, "end": 727.524, "track": 0, "text": "cortech now enables you to do something in a very different way than you were ever able to do it before I like this.", "start": 719.821, "speaker": "Scott"}, {"confidence": 0.93, "end": 740.503, "track": 0, "text": "Idea this this turned out of the modded architecture I think that's that's really interesting and I feel that there's a new or renewed focus on machine learning as a way to apply it to the modern data architecture that's really about it,", "start": 727.933, "speaker": "Scott"}, {"confidence": 0.64, "end": 744.608, "track": 0, "text": "ready really is getting it it's likes so I think that's a cool.", "start": 740.486, "speaker": "Scott"}, {"confidence": 0.89, "end": 752.558, "track": 0, "text": "Trending 2017 War Machine learning has become more focused and when applied to the modern data architecture it's really but you know driven it along.", "start": 744.71, "speaker": "Scott"}, {"confidence": 0.89, "end": 759.66, "track": 1, "text": "Can I can I should I do this morning can we unpack modern did architecture cuz I like that term but I feel like that maybe one that.", "newpara": true, "start": 752.528, "speaker": "Cory"}, {"confidence": 0.92, "end": 766.733, "track": 1, "text": "I could get lost on folks if they don't understand what you mean cuz I know it I think I know what you mean from a product perspective but,", "start": 760.184, "speaker": "Cory"}, {"confidence": 0.91, "end": 773.217, "track": 1, "text": "help me understand strategic level none of the product level what is modern-day architecture mean to you and hortonworks.", "start": 767.058, "speaker": "Cory"}, {"confidence": 0.89, "end": 777.555, "track": 0, "text": "Sure and obviously it comes around that core I do been able to write where we.", "newpara": true, "start": 773.446, "speaker": "Scott"}, {"confidence": 0.94, "end": 785.349, "track": 0, "text": "Where we've effectively been able to reverse the process of data acquisition and data analytics where you can acquire and analyze versus analyze in a choir.", "start": 778.001, "speaker": "Scott"}, {"confidence": 0.91, "end": 797.632, "track": 0, "text": "So that's kind of the core and the other thing I like to think about it a concept for amount of data architecture is really connected not converged and it's almost like we reverse the polarity in the entire industry.", "newpara": true, "start": 786.582, "speaker": "Scott"}, {"confidence": 0.94, "end": 806.922, "track": 0, "text": "Which I've been part of for a very long time where for 30 years it was all about pull all of the data together into your Enterprise data warehouse.", "start": 798.065, "speaker": "Scott"}, {"confidence": 0.91, "end": 814.151, "track": 0, "text": "Model the data make it there no more form have one copy of it and then distributed to everyone so it's a converged pull it all together.", "start": 807.223, "speaker": "Scott"}, {"confidence": 0.94, "end": 821.818, "track": 0, "text": "In an iot world that is just physically and dramatically impossible to have happen it's just not going to have.", "start": 814.746, "speaker": "Scott"}, {"confidence": 0.94, "end": 830.345, "track": 0, "text": "So we talk about here is being able to play it where it lies being able to have data in many places being able to have analytics that are portable and not data that.", "start": 822.221, "speaker": "Scott"}, {"confidence": 0.96, "end": 845.368, "track": 0, "text": "And so that has again that's it's a reverse polarity you're pushing process to the data instead of pulling data to the process and so all of those concepts are really built into what I described as required for that modern,", "start": 831.289, "speaker": "Scott"}, {"confidence": 0.86, "end": 849.532, "track": 0, "text": "State architecture and certainly what we're building and then that and by extension.", "start": 845.428, "speaker": "Scott"}, {"confidence": 0.96, "end": 861.773, "track": 0, "text": "Because a lot of this is being driven by sensors and iot and those kinds of applications you're also talking about a large majority of the effectiveness of your architecture being how you actually.", "start": 849.887, "speaker": "Scott"}, {"confidence": 0.96, "end": 871.615, "track": 0, "text": "Move and capture data at the edge in the cloud on Prim and how you distribute applications to the point where.", "start": 862.35, "speaker": "Scott"}, {"confidence": 0.93, "end": 877.084, "track": 0, "text": "I think modern architecture really needs to support applications running at the edge.", "start": 871.892, "speaker": "Scott"}, {"confidence": 0.83, "end": 886.993, "track": 0, "text": "Right so for many years even in an RGB Mass Centric world and talk about real-time processing industry in processing and what that typically man was Jeep running faster.", "newpara": true, "start": 877.439, "speaker": "Scott"}, {"confidence": 0.81, "end": 890.057, "track": 1, "text": "Real-time was getting closer to when I got it.", "newpara": true, "start": 887.396, "speaker": "Cory"}, {"confidence": 0.97, "end": 891.968, "track": 0, "text": "In a world where you're.", "newpara": true, "start": 889.769, "speaker": "Scott"}, {"confidence": 0.93, "end": 900.213, "track": 0, "text": "IPhone will tell you 5 minutes before you're going to have a heart attack that you're about to have a heart attack and call an ambulance for you.", "start": 893.002, "speaker": "Scott"}, {"confidence": 0.94, "end": 910.326, "track": 0, "text": "Let Me Shine a little bit far-fetched but it's not unrealistic right in that world that application can't run somewhere in a Datacenter it's got to run on the phone.", "start": 900.676, "speaker": "Scott"}, {"confidence": 0.97, "end": 914.929, "track": 0, "text": "So that means it needs to be distributed app it's got to have access to.", "start": 911.12, "speaker": "Scott"}, {"confidence": 0.95, "end": 926.598, "track": 0, "text": "All of the hundreds and thousands and millions of petabytes of historical data for model building but it's got to be able to execute that model locally at the edge or it's not real time.", "start": 915.224, "speaker": "Scott"}, {"confidence": 0.92, "end": 933.821, "track": 0, "text": "Right and so application architectures and data architecture that support that kind of modeling wear.", "start": 927.146, "speaker": "Scott"}, {"confidence": 0.92, "end": 947.882, "track": 0, "text": "You're capturing data at the edge of capturing data at the edge or analyze and get at the edge of publishing dated it make sense to publish your enhancing models 100% of the time and then you're redistributing those models back out to the edge to run locally.", "start": 934.242, "speaker": "Scott"}, {"confidence": 0.9, "end": 949.986, "track": 0, "text": "That's a modern-day architecture.", "start": 948.49, "speaker": "Scott"}, {"confidence": 0.91, "end": 956.608, "track": 1, "text": "That's ocwencustomers a lot about the some of the use cases and challenges iot is obviously a very interesting one.", "newpara": true, "start": 950.19, "speaker": "Cory"}, {"confidence": 0.9, "end": 966.246, "track": 1, "text": "People get excited about like 5G technology no to make it possible for a sexually finally get the data pack in the Datacenter cuz they still operator the model that I need all the way to the comeback.", "start": 956.692, "speaker": "Cory"}, {"confidence": 0.94, "end": 975.843, "track": 0, "text": "And you don't need you don't need all of the data to come back in fact one of the things that I've talked about a lot in 2017 is the concept of skill ability and again.", "newpara": true, "start": 965.946, "speaker": "Scott"}, {"confidence": 0.93, "end": 984.838, "track": 0, "text": "For the first 30 years of my career scalability was well how many gigabytes of data do you have by the way my first day to Warehouse in 1989 how big was it.", "start": 976.156, "speaker": "Scott"}, {"confidence": 0.99, "end": 988.696, "track": 0, "text": "It was the biggest in the world how big was it.", "newpara": true, "start": 986.173, "speaker": "Scott"}, {"confidence": 0.72, "end": 992.053, "track": 0, "text": "30 gig 30 gay.", "newpara": true, "start": 989.971, "speaker": "Scott"}, {"confidence": 0.93, "end": 997.878, "track": 1, "text": "30 gig that's huge\nhow to impress by your database right now.", "newpara": true, "start": 990.772, "speaker": "Cory"}, {"confidence": 0.87, "end": 1005.99, "track": 0, "text": "So so my point is scalability has always been an hour talking about petabytes and & Beyond okay that's really cool 5 years from now.", "newpara": true, "start": 997.578, "speaker": "Scott"}, {"confidence": 0.97, "end": 1012.324, "track": 0, "text": "Scalability is going to be about the amount of data that you can impact not about the amount of data that you store centrally.", "start": 1006.189, "speaker": "Scott"}, {"confidence": 0.97, "end": 1026.721, "track": 0, "text": "So I have Edge processors I have sensors they all have local storage right can I impact can I connect that data without having to move all of it that's going to be the definition of true scalability think about that jet engine that creates a terabyte of data.", "start": 1012.655, "speaker": "Scott"}, {"confidence": 0.95, "end": 1035.717, "track": 0, "text": "All the time every hour and now we have 5G and satellite okay great I can transmit that turned by today to every hour why what you going to do with it do you need to do that.", "start": 1027.143, "speaker": "Scott"}, {"confidence": 0.94, "end": 1048.396, "track": 0, "text": "Know what you need to do is have a model that runs locally against the date of this being created finds exceptions and then decides when to transmit things and work and make a local decision to improve overall safety.", "start": 1035.928, "speaker": "Scott"}, {"confidence": 0.95, "end": 1055.944, "track": 1, "text": "I agree with that the question though is is that if I want to build a model for a jet engine this running and thousands of airplanes around the world.", "newpara": true, "start": 1048.679, "speaker": "Cory"}, {"confidence": 0.9, "end": 1064.176, "track": 1, "text": "Where do I get the date of the build that model cuz don't have to bring some amount of that sample data back in or into my you know my data plan.", "start": 1056.551, "speaker": "Cory"}, {"confidence": 0.58, "end": 1066.802, "track": 0, "text": "Whatever shirts.", "newpara": true, "start": 1065.198, "speaker": "Scott"}, {"confidence": 0.93, "end": 1090.724, "track": 1, "text": "It's not an it's not an all-or-nothing right it's it's it's like we said before like it's not that Hadoop is dead it's not that's not it's not that binary it's you still need lots of due to come back into that.", "newpara": true, "start": 1079.908, "speaker": "Cory"}, {"confidence": 0.73, "end": 1093.248, "track": 1, "text": "You know part of that modern-day Dark Sector is having a.", "start": 1091.109, "speaker": "Cory"}, {"confidence": 0.9, "end": 1115.554, "track": 0, "text": "And reprioritize data streams at the edge as well.", "newpara": true, "start": 1110.5, "speaker": "Scott"}, {"confidence": 0.92, "end": 1124.02, "track": 0, "text": "So you think about the connected-car case or even autonomous vehicles which seems to have everyone's imagination.", "start": 1115.993, "speaker": "Scott"}, {"confidence": 0.94, "end": 1133.419, "track": 0, "text": "That is the ultimate coyote application because it's got to make decisions in real time locally there's a semi bearing down on me what should I do.", "newpara": true, "start": 1125.469, "speaker": "Scott"}, {"confidence": 0.95, "end": 1142.0, "track": 0, "text": "I don't want to wait for G do I have a 3-g signal let me transmit someday. Let me run in and I need to get out of the way while okay.", "start": 1133.623, "speaker": "Scott"}, {"confidence": 0.93, "end": 1150.052, "track": 0, "text": "So being able to have that local model process but also at the same time she I found an anomaly in the day to let me send that up for model enhancement.", "start": 1142.463, "speaker": "Scott"}, {"confidence": 0.95, "end": 1159.155, "track": 0, "text": "Let me refresh the model when you know when it's appropriate and so on so those are all technologies that are being deployed today and making some of the things that we thought were science fiction.", "start": 1150.286, "speaker": "Scott"}, {"confidence": 0.93, "end": 1163.632, "track": 0, "text": "Actually realities but let me send that data back for the model enhancement,", "start": 1159.396, "speaker": "Scott"}, {"confidence": 0.85, "end": 1170.747, "track": 0, "text": "not when the tractor trailers will be coming down on the right part and everyone's out after I will send it back,", "start": 1163.657, "speaker": "Scott"}, {"confidence": 0.88, "end": 1180.716, "track": 0, "text": "experience that the exact same case although I used a kid crossing the street do I really want to send it back if someone's crossing the street in a self-driving car,", "start": 1171.006, "speaker": "Scott"}, {"confidence": 0.9, "end": 1182.759, "track": 0, "text": "so yeah I know.", "start": 1180.722, "speaker": "Scott"}, {"confidence": 0.98, "end": 1190.319, "track": 0, "text": "But at the same time when you think about the sophistication of those models right and even image recognition of.", "start": 1183.685, "speaker": "Scott"}, {"confidence": 0.92, "end": 1203.629, "track": 0, "text": "G it's a semi coming right I know the weight I know the relative momentum of that vehicle I know it's turning radius I know mine I can actually calculate a much better outcome than a human being in a Split Second.", "start": 1190.674, "speaker": "Scott"}, {"confidence": 0.81, "end": 1205.431, "track": 0, "text": "These are huge thanks.", "start": 1203.887, "speaker": "Scott"}, {"confidence": 0.92, "end": 1208.878, "track": 1, "text": "Now the fun part that gets really interesting this is the this is the part of,", "newpara": true, "start": 1205.301, "speaker": "Cory"}, {"confidence": 0.96, "end": 1218.122, "track": 1, "text": "autonomous cars that I think is really interesting is the ethical question parts of it so like I like the question I read conference I think it was.", "start": 1209.087, "speaker": "Cory"}, {"confidence": 0.84, "end": 1220.742, "track": 0, "text": "Software crash has a new connotation and.", "newpara": true, "start": 1217.822, "speaker": "Scott"}, {"confidence": 0.94, "end": 1224.27, "track": 1, "text": "Man does it does it ever right so but I like the example somebody gave of.", "newpara": true, "start": 1220.442, "speaker": "Cory"}, {"confidence": 0.91, "end": 1238.235, "track": 1, "text": "I was at a conference in Berlin and the guys from Porsche Digital Labs were talking about it cuz they're helping develop some of the tunnels driving and they said here's a question to new lawn in a car if I push a processing of the edge.", "start": 1224.36, "speaker": "Cory"}, {"confidence": 0.95, "end": 1245.217, "track": 1, "text": "What do I tell it to do when the only two possible outcomes are kill driver or driving to a group of people.", "start": 1238.47, "speaker": "Cory"}, {"confidence": 0.93, "end": 1254.117, "track": 1, "text": "And is that something that should be disclaimed to the driver when they buy said car cuz they may not be interested in that one.", "start": 1246.708, "speaker": "Cory"}, {"confidence": 0.91, "end": 1258.688, "track": 0, "text": "Is it like a moral checklist like when you like to see you start the car or is it your phone or setting it up.", "newpara": true, "start": 1253.835, "speaker": "Scott"}, {"confidence": 0.93, "end": 1261.789, "track": 2, "text": "Did I can Morel checklist like when you like seeing you start the car or is it your phone or setting it up I know they ask you some questions and they build a model based on that yeah.", "newpara": true, "start": 1254.017, "speaker": "Brett"}, {"confidence": 0.72, "end": 1261.965, "track": 0, "text": "Orange Hill driver or kill passenger.", "newpara": true, "start": 1259.233, "speaker": "Scott"}, {"confidence": 0.82, "end": 1265.336, "track": 1, "text": "Yeah I told her I'd exactly so it ain't who gets the worse the brunt of that,", "newpara": true, "start": 1261.689, "speaker": "Cory"}, {"confidence": 0.9, "end": 1276.867, "track": 1, "text": "that 18-wheeler that I identified as a turning radius of X it's likely to hit this one or this one.", "start": 1265.246, "speaker": "Cory"}, {"confidence": 0.89, "end": 1283.201, "track": 1, "text": "One of these I see that horde works as is bringing the market in this talked about it started on the press for the last year was.", "start": 1276.873, "speaker": "Cory"}, {"confidence": 0.73, "end": 1287.533, "track": 1, "text": "Hdb 3. O h TPB in the horn Works Data platform the.", "start": 1283.357, "speaker": "Cory"}, {"confidence": 0.91, "end": 1301.252, "track": 1, "text": "Score of the modern-day architecture if I'm capturing this right tell me what's what's exciting that you're going to be talking about both the sales kick-off with your team but also for the market to hear what's coming from hortonworks.", "start": 1287.84, "speaker": "Cory"}, {"confidence": 0.65, "end": 1304.383, "track": 0, "text": "Well HD P320 is.", "newpara": true, "start": 1301.919, "speaker": "Scott"}, {"confidence": 0.9, "end": 1313.408, "track": 0, "text": "A big deal for us obviously anytime you start with the new major number and we go from 2.5 I buy 23.82 a big deal,", "start": 1304.684, "speaker": "Scott"}, {"confidence": 0.9, "end": 1321.154, "track": 0, "text": "I think it's a big deal for our customers really strategically because his introduction of containerization,", "start": 1313.451, "speaker": "Scott"}, {"confidence": 0.9, "end": 1323.684, "track": 0, "text": "across the head of stack and so,", "start": 1321.046, "speaker": "Scott"}, {"confidence": 0.94, "end": 1331.85, "track": 0, "text": "earlier when I was talking about application portability and being able to push out to the edge and so on you know containerization enables a lot of things,", "start": 1323.6, "speaker": "Scott"}, {"confidence": 0.92, "end": 1341.903, "track": 0, "text": "now one of the key things that it enables obviously is better Microsoft versus an application portability in so I think from a usability consume ability,", "start": 1331.676, "speaker": "Scott"}, {"confidence": 0.83, "end": 1343.736, "track": 0, "text": "after this will just be.", "start": 1341.868, "speaker": "Scott"}, {"confidence": 0.91, "end": 1351.235, "track": 0, "text": "Where you see our platform deployed one of the other.", "start": 1347.264, "speaker": "Scott"}, {"confidence": 0.91, "end": 1360.501, "track": 0, "text": "Features let's say inside of a CP3 is Erasure coding which which a lot of folks have been looking for as well which is,", "start": 1351.53, "speaker": "Scott"}, {"confidence": 0.96, "end": 1369.635, "track": 0, "text": "enables us to store a lot more data more densely of course there's some performance trade-offs when you do that but the overall savings can be huge.", "start": 1360.406, "speaker": "Scott"}, {"confidence": 0.94, "end": 1380.566, "track": 0, "text": "You know what we're not talking about a 30gb database anymore which would fit on my phone but you know we're talking about hundreds of petabytes or more and so being able to make,", "start": 1369.888, "speaker": "Scott"}, {"confidence": 0.93, "end": 1393.731, "track": 0, "text": "50% difference or more kind of storage footprint on on on that will be a big deal so I think you know a lot more applications lots more access to data.", "start": 1380.476, "speaker": "Scott"}, {"confidence": 0.91, "end": 1402.691, "track": 0, "text": "2 West Nelson different commercial Footprints in terms of the storage footprint I will be really big Headliners at our customer will be excited about.", "newpara": true, "start": 1393.642, "speaker": "Scott"}, {"confidence": 0.92, "end": 1406.687, "track": 1, "text": "Yeah erase recordings one that we you know we've heard about for a long time I think.", "newpara": true, "start": 1402.866, "speaker": "Cory"}, {"confidence": 0.94, "end": 1417.503, "track": 1, "text": "For us that we're going to end of that came into this big kid ecosystem not as the applications are database psypokes became at it from an infrastructure perspective that was always one that I looked at and we went.", "start": 1407.078, "speaker": "Cory"}, {"confidence": 0.93, "end": 1420.857, "track": 1, "text": "Man like if they like I get that hdfs.", "start": 1417.828, "speaker": "Cory"}, {"confidence": 0.99, "end": 1421.944, "track": 0, "text": "Just do that.", "newpara": true, "start": 1420.556, "speaker": "Scott"}, {"confidence": 0.91, "end": 1433.704, "track": 1, "text": "I mean is it because the problem and it's also it's been a boon for companies to to to deal if I can in terms of a way to sell more Hardware right I'm in the lot of companies made a lot of money because.", "newpara": true, "start": 1421.644, "speaker": "Cory"}, {"confidence": 0.89, "end": 1440.47, "track": 1, "text": "800 wasn't very efficient at storing data right it with having replicas which is fine because it's expressed intention wasn't.", "start": 1433.939, "speaker": "Cory"}, {"confidence": 0.94, "end": 1447.459, "track": 1, "text": "Be absolutely efficient first it was no store large amounts of data effectively so that I can so I can analyze it right.", "start": 1440.909, "speaker": "Cory"}, {"confidence": 0.94, "end": 1462.631, "track": 1, "text": "Design paradigms and as you said they're straight off but the fact that that will that now I think to me one that's one of those that the platform feels like it will be easier for many Enterprises to adopt at a scale that maybe hit that they were held back from before.", "start": 1447.832, "speaker": "Cory"}, {"confidence": 0.94, "end": 1476.969, "track": 0, "text": "Yeah and it's another choice right and it's another Choice another trade-off it's you think about it as data temperature and you know I have some some very cold daytime going to do Erasure coding so I know I'm going to pay a bit of a performance penalty on Reed Road.", "newpara": true, "start": 1462.65, "speaker": "Scott"}, {"confidence": 0.89, "end": 1480.557, "track": 0, "text": "That's okay because otherwise I couldn't afford to store it anyway.", "start": 1477.228, "speaker": "Scott"}, {"confidence": 0.93, "end": 1491.667, "track": 0, "text": "And I'm not doing it for real-time decision-making at the edge while at the same time I can choose more traditional storage methods for dated a little bit warmer or I can go completely in memory and use smart,", "start": 1480.779, "speaker": "Scott"}, {"confidence": 0.9, "end": 1501.775, "track": 0, "text": "or I can use highville ap4 so that's for high-performance kind of interactive and anywhere in between so I don't do it as a Boolean thing but more as just creating some more choice,", "start": 1491.632, "speaker": "Scott"}, {"confidence": 0.93, "end": 1508.0, "track": 0, "text": "and again it it kind of extends the validity of the end of viability of the footprint into new spaces.", "start": 1501.841, "speaker": "Scott"}, {"confidence": 0.93, "end": 1513.162, "track": 1, "text": "So the containers they should support you talked about before there is sort of a battle going on in the container space.", "newpara": true, "start": 1507.778, "speaker": "Cory"}, {"confidence": 0.89, "end": 1524.194, "track": 1, "text": "Is there a single container platform that you guys have decided to incorporate as it. Are you container agnostic what's the what's the spin on container.", "start": 1513.3, "speaker": "Cory"}, {"confidence": 0.92, "end": 1526.25, "track": 1, "text": "Company.", "start": 1524.435, "speaker": "Cory"}, {"confidence": 0.96, "end": 1532.253, "track": 0, "text": "Yeah the goal is to be is agnostic and open as possible.", "newpara": true, "start": 1526.058, "speaker": "Scott"}, {"confidence": 0.95, "end": 1542.378, "track": 0, "text": "You know we'll be able to use some of the best openframeworks that are out there I don't think the Container Wars are completely over.", "start": 1532.457, "speaker": "Scott"}, {"confidence": 0.98, "end": 1546.47, "track": 0, "text": "And and so our goal is to be as open.", "start": 1542.829, "speaker": "Scott"}, {"confidence": 0.96, "end": 1557.034, "track": 0, "text": "To what our customers decide to implement as we can possibly be in support that and facilitate that through integration with yarn and some of the other core capabilities of the platform.", "start": 1546.681, "speaker": "Scott"}, {"confidence": 0.81, "end": 1559.179, "track": 1, "text": "Obviously HDPE is getting some big updates.", "newpara": true, "start": 1556.95, "speaker": "Cory"}, {"confidence": 0.96, "end": 1573.745, "track": 1, "text": "Are there other parts of the the modern did architecture the products at hortonworks bills to support that are there other big announcements in terms of Technology direction or innovations that are coming across the portfolio.", "start": 1559.72, "speaker": "Cory"}, {"confidence": 0.96, "end": 1586.629, "track": 0, "text": "Well I think the biggest thing that we launched and thanks for asking that yeah I think the biggest thing for us is what we launched in the fourth quarter of 2017 which is now behind us.", "newpara": true, "start": 1574.088, "speaker": "Scott"}, {"confidence": 0.83, "end": 1595.774, "track": 0, "text": "And that is the date of playing service concept and so we talked earlier about cuz it was dead and this and that the other thing,", "start": 1587.765, "speaker": "Scott"}, {"confidence": 0.93, "end": 1608.712, "track": 0, "text": "when I think about kind of the change in the business that change in the footprint that we've had even during my tenure here for the past three years right is Hadoop and the business kind of move from G,", "start": 1595.721, "speaker": "Scott"}, {"confidence": 0.88, "end": 1612.197, "track": 0, "text": "we've got this hdfs in mapreduce thing,", "start": 1608.598, "speaker": "Scott"}, {"confidence": 0.98, "end": 1614.15, "track": 0, "text": "that was kind of the center of gravity.", "start": 1612.12, "speaker": "Scott"}, {"confidence": 0.93, "end": 1624.907, "track": 0, "text": "I think about you know what we're shipping today and what customers really look for and the value they get are the core services around security governance multi-tenancy management.", "start": 1614.397, "speaker": "Scott"}, {"confidence": 0.9, "end": 1626.986, "track": 0, "text": "An Operational Support.", "start": 1625.292, "speaker": "Scott"}, {"confidence": 0.92, "end": 1641.017, "track": 0, "text": "And into what you can bring your data you can bring your data in multiple different format you can use hdfs you can use S3 and Amazon if you choose you can you can have hired you can have spark you can have hbase whatever you bring your analytic you write your own thing.", "start": 1627.268, "speaker": "Scott"}, {"confidence": 0.97, "end": 1646.768, "track": 0, "text": "The core Services become really really important because when you think about.", "start": 1641.378, "speaker": "Scott"}, {"confidence": 0.92, "end": 1657.554, "track": 0, "text": "The massive capability but also the massive responsibility of having all of this data you really need to have some very consistent security and governance rules.", "start": 1647.471, "speaker": "Scott"}, {"confidence": 0.96, "end": 1662.289, "track": 0, "text": "And and you need to be able to do the operational Management in a seamless fashion.", "start": 1658.077, "speaker": "Scott"}, {"confidence": 0.91, "end": 1671.927, "track": 0, "text": "And so when I think about the value proper around monitoring architecture and what what works bring to the table is really those core services in to which we plug all of the other things and.", "start": 1662.896, "speaker": "Scott"}, {"confidence": 0.92, "end": 1675.581, "track": 0, "text": "Do you know the new shiny object Dushore will be something else tomorrow.", "newpara": true, "start": 1672.246, "speaker": "Scott"}, {"confidence": 0.93, "end": 1688.062, "track": 0, "text": "So that's all well and good enter the cloud right so now I've got all these clouds Footprints I got on Prem clusters I got folks we can spend stuff up in the club.", "start": 1676.495, "speaker": "Scott"}, {"confidence": 0.94, "end": 1695.886, "track": 0, "text": "And I want to be able to understand my perimeter even though my perimeter now extends outside of my data center.", "start": 1688.284, "speaker": "Scott"}, {"confidence": 0.93, "end": 1705.807, "track": 0, "text": "I want to have constant and consistent security governance were also when I say governance what I really mean is where did it come from who had access to it what did they do and where did it go.", "start": 1696.157, "speaker": "Scott"}, {"confidence": 0.83, "end": 1714.339, "track": 0, "text": "True prop where did it come from who touched it right all those cans I think so.", "newpara": true, "start": 1708.703, "speaker": "Scott"}, {"confidence": 0.91, "end": 1728.118, "track": 0, "text": "We're able now with data plan services to to kind of pull those core Services out of a cluster and make them a cloud service that accesses all of their data and all of the Clusters whether they're on prime or in the cloud.", "newpara": true, "start": 1715.632, "speaker": "Scott"}, {"confidence": 0.85, "end": 1730.113, "track": 1, "text": "And enforcing the policies back in.", "newpara": true, "start": 1728.269, "speaker": "Cory"}, {"confidence": 0.9, "end": 1741.825, "track": 0, "text": "And enforce all of those policies in the Providence and all of those kinds of things so it's a really interesting concept I think it becomes a way for customers to really get into the cloud with.", "newpara": true, "start": 1729.813, "speaker": "Scott"}, {"confidence": 0.92, "end": 1746.296, "track": 0, "text": "And understand that they're able to bring with everything that they've built.", "start": 1742.06, "speaker": "Scott"}, {"confidence": 0.95, "end": 1754.75, "track": 0, "text": "Around the security in the Providence out into the cloud and understand and keep track of where those assets are and how they're being used that's a really really good.", "start": 1746.566, "speaker": "Scott"}, {"confidence": 0.97, "end": 1759.822, "track": 0, "text": "It enables customers to the cloud agnostic.", "start": 1754.997, "speaker": "Scott"}, {"confidence": 0.94, "end": 1766.12, "track": 0, "text": "Based on price based on Performance Based on corporate and whatever I can go over here I can go over there.", "start": 1760.159, "speaker": "Scott"}, {"confidence": 0.89, "end": 1771.275, "track": 0, "text": "True application portability through data plan Services you can guarantee that your.", "start": 1766.661, "speaker": "Scott"}, {"confidence": 0.92, "end": 1780.415, "track": 0, "text": "Implementation weather is on Premarin the cloud is the same versions of software so you'll have application portability be able to automatically provision and D provision.", "start": 1771.552, "speaker": "Scott"}, {"confidence": 0.94, "end": 1792.854, "track": 0, "text": "So this is a whole new a whole new way to look at managing managing data over the sister Footprints remember back I said you know it's not about convergence about connect.", "newpara": true, "start": 1781.75, "speaker": "Scott"}, {"confidence": 0.9, "end": 1802.414, "track": 0, "text": "Write in a connected World which is inherently more complicated and You've Got Dat Ass it's all over the place we can go to have a consistent way to understand to find.", "start": 1793.654, "speaker": "Scott"}, {"confidence": 0.93, "end": 1810.412, "track": 0, "text": "To keep track of those assets regardless of where those assets are in a very consistent and enforced approach I think it's very valuable thing.", "start": 1802.577, "speaker": "Scott"}, {"confidence": 0.94, "end": 1818.903, "track": 0, "text": "And so we launch the airplane services in the fourth quarter you'll see us coming in 2018 with more instantiations.", "start": 1810.701, "speaker": "Scott"}, {"confidence": 0.92, "end": 1828.019, "track": 0, "text": "The date of playing Services the way I think about it is there the coordinate plane services that I described I think you're extremely valuable if you are.", "start": 1819.607, "speaker": "Scott"}, {"confidence": 0.75, "end": 1832.015, "track": 0, "text": "Hortonworks customer you know go to play date of plain Gray.", "start": 1828.314, "speaker": "Scott"}, {"confidence": 0.83, "end": 1836.185, "track": 0, "text": "I also have you it almost like.", "start": 1834.047, "speaker": "Scott"}, {"confidence": 0.94, "end": 1846.112, "track": 0, "text": "IOS and app store because now they playing services having access and mapping to all of your data and you did ask that's along with the governance and security,", "start": 1836.685, "speaker": "Scott"}, {"confidence": 0.96, "end": 1854.489, "track": 0, "text": "why not be able to plug applications into that and now those applications can have access to data wherever the data are stored anywhere in the simple structure as opposed to having,", "start": 1846.089, "speaker": "Scott"}, {"confidence": 0.9, "end": 1864.536, "track": 0, "text": "a different set of applications in each one of your Footprints and so the first application I sent that we launched with a to Plant Services is data lifecycle manager.", "start": 1854.55, "speaker": "Scott"}, {"confidence": 0.89, "end": 1872.432, "track": 0, "text": "Still life cycle manager does backup recovery data copy replication groups kind of data lifecycle management.", "start": 1864.819, "speaker": "Scott"}, {"confidence": 0.89, "end": 1877.858, "track": 1, "text": "It support stuff though because it hasn't been typically something that was super Jermaine and like.", "newpara": true, "start": 1872.354, "speaker": "Cory"}, {"confidence": 0.98, "end": 1878.898, "track": 0, "text": "It was hard to do.", "newpara": true, "start": 1877.685, "speaker": "Scott"}, {"confidence": 0.94, "end": 1890.297, "track": 1, "text": "It was hard to do in the hood you're saying that was one of the things I like Enterprise it practitioners you know the folks are responsible for running clusters that were that they'd run all the other Enterprise applications in an environment they would look at and go.", "newpara": true, "start": 1878.598, "speaker": "Cory"}, {"confidence": 0.79, "end": 1894.305, "track": 1, "text": "Wait what are we do for Dr and how do I pick this thing up and granted their.", "start": 1890.628, "speaker": "Cory"}, {"confidence": 0.94, "end": 1906.053, "track": 1, "text": "There's reasons for and against each of those but that's one of those I think if that's a huge Boon for you guys and terms of adoption the m&o stuck his big but one thing I will say that you said it a couple times and I don't want to pull in this thread.", "start": 1894.492, "speaker": "Cory"}, {"confidence": 0.92, "end": 1916.238, "track": 1, "text": "I feel like your data plan is is is almost a requirement now partially because one things you said was Data assets right I've got assets all over the place.", "start": 1907.123, "speaker": "Cory"}, {"confidence": 0.92, "end": 1926.496, "track": 1, "text": "Would it is it a fair assessment to also say that those could be called Data liabilities like if we don't have proper security and governance and that audit and lineage.", "start": 1916.587, "speaker": "Cory"}, {"confidence": 0.97, "end": 1930.72, "track": 1, "text": "We can probably find enough stories to just scare the crap out of them.", "start": 1926.755, "speaker": "Cory"}, {"confidence": 0.85, "end": 1934.764, "track": 0, "text": "So there a couple of things right there's an ease of use.", "newpara": true, "start": 1930.42, "speaker": "Scott"}, {"confidence": 0.97, "end": 1939.259, "track": 0, "text": "Keeping track of assets and so on so that that's the good side.", "start": 1935.318, "speaker": "Scott"}, {"confidence": 0.94, "end": 1951.415, "track": 0, "text": "Write the flip side is all coming to a head this year with GDP are being implemented and gdpr is important not just because of the far-reaching requirements but also the penalty phase.", "start": 1939.975, "speaker": "Scott"}, {"confidence": 0.92, "end": 1957.497, "track": 0, "text": "Which can be quite extreme so you know think about gdpr do you want to go implementa gdpr,", "start": 1951.536, "speaker": "Scott"}, {"confidence": 0.93, "end": 1964.16, "track": 0, "text": "independent solution that way you just paying the cost and so on or do you just want to build it into your modern data architecture,", "start": 1957.473, "speaker": "Scott"}, {"confidence": 0.93, "end": 1973.985, "track": 0, "text": "where you've already got provenance so you know where it came from where it went where it exists do you know what your boundaries are and therefore you can be compliant in a very seamless fashion.", "start": 1964.221, "speaker": "Scott"}, {"confidence": 0.92, "end": 1979.376, "track": 0, "text": "So I think so there's certainly is that aspect to it as well.", "start": 1974.491, "speaker": "Scott"}, {"confidence": 0.94, "end": 1989.399, "track": 0, "text": "I think the other aspect in this this is one of the 2018 predictions that I wrote about recently online is you know,", "start": 1980.421, "speaker": "Scott"}, {"confidence": 0.97, "end": 1995.762, "track": 0, "text": "cloud is a huge asset but also potentially a huge liability or is it too much of a good thing.", "start": 1989.423, "speaker": "Scott"}, {"confidence": 0.94, "end": 2005.923, "track": 0, "text": "And when I think about it I think about a person I know and industries been a customer of mine for a long time and we were talking about his Evolution right.", "start": 1996.676, "speaker": "Scott"}, {"confidence": 0.93, "end": 2017.323, "track": 0, "text": "And you guys get out you came in and told me this Enterprise data warehouse cuz I'm going to save money right I was going to get rid of all these day tomorrow so I can put it in one place we have single version of the truth and save some money.", "start": 2006.104, "speaker": "Scott"}, {"confidence": 0.95, "end": 2021.187, "track": 0, "text": "Going to do better analytics life is going to be good he said so I did that.", "start": 2017.642, "speaker": "Scott"}, {"confidence": 0.91, "end": 2029.653, "track": 0, "text": "And I got a lot of benefit out of the edw but you know what I never actually unplug made this day tomorrow it's not set up so now I'm kind of double paying,", "newpara": true, "start": 2021.415, "speaker": "Scott"}, {"confidence": 0.75, "end": 2038.799, "track": 0, "text": "Sikorsky upside was was the enhanced analytics who's able to get he said then all the sudden is data like thing came along inside.", "start": 2029.66, "speaker": "Scott"}, {"confidence": 0.94, "end": 2040.824, "track": 0, "text": "And and that's really great.", "start": 2039.082, "speaker": "Scott"}, {"confidence": 0.95, "end": 2051.791, "track": 0, "text": "Because now because of the the Paradigm around to do but I can actually capture data that I wouldn't have captured before and it's native form I can create new analytics and all that.", "start": 2041.522, "speaker": "Scott"}, {"confidence": 0.83, "end": 2058.966, "track": 0, "text": "But I'm also going to need to grab you and I still got they tomorrow it's and now my users are going to go to the cloud.", "start": 2052.194, "speaker": "Scott"}, {"confidence": 0.93, "end": 2066.796, "track": 0, "text": "And so now there's no longer any adult supervision because you know what for the edw in the day like I had to go to Capitol committee I had to go buy a bunch of stuff.", "start": 2059.519, "speaker": "Scott"}, {"confidence": 0.93, "end": 2078.675, "track": 0, "text": "And so at least at least it was some Ry right with the cloud any any any person with a credit card and a need can just go spend stuff up willy-nilly.", "start": 2067.229, "speaker": "Scott"}, {"confidence": 0.93, "end": 2081.77, "track": 0, "text": "And it's going to be very hard for me to manage in control that.", "start": 2078.988, "speaker": "Scott"}, {"confidence": 0.91, "end": 2091.895, "track": 0, "text": "So what do you think about the value proposition around data plan services and at least be able to create that standard footprint and create that provenance at least you'll be able to measure and track what's being done.", "start": 2082.059, "speaker": "Scott"}, {"confidence": 0.95, "end": 2099.743, "track": 0, "text": "At the same time you know 3 those Services be able to measure the utilization rates and hey do I need this instance or not.", "start": 2092.971, "speaker": "Scott"}, {"confidence": 0.97, "end": 2104.238, "track": 0, "text": "And so you know giving giving some level of.", "start": 2100.104, "speaker": "Scott"}, {"confidence": 0.93, "end": 2119.129, "track": 0, "text": "Balance of power as it were in a cloud world I think becomes interesting cuz Cloud I know how it is with data right people get consumed by data they get hooked on data to get hooked on analytics and just like entropy it only goes One Direction.", "newpara": true, "start": 2105.416, "speaker": "Scott"}, {"confidence": 0.96, "end": 2127.902, "track": 0, "text": "And that's really that's really hard even in a normal data center World let alone a cloud world where is seemingly boundless.", "start": 2119.784, "speaker": "Scott"}, {"confidence": 0.83, "end": 2129.71, "track": 1, "text": "And it is a multi Club world now.", "newpara": true, "start": 2127.812, "speaker": "Cory"}, {"confidence": 0.99, "end": 2146.498, "track": 0, "text": "You knew where the fence was,", "newpara": true, "start": 2144.926, "speaker": "Scott"}, {"confidence": 0.96, "end": 2147.545, "track": 0, "text": "and you could see it.", "start": 2146.526, "speaker": "Scott"}, {"confidence": 0.87, "end": 2151.661, "track": 1, "text": "Yeah exactly know sometimes it wouldn't security as well as it should have been and that's.", "newpara": true, "start": 2147.347, "speaker": "Cory"}, {"confidence": 0.9, "end": 2162.58, "track": 1, "text": "It happens but I think candidly the cloud whenever you say the cloth I think the cloud is an operating operating model less of a place but when you go to a public cloud provider.", "start": 2151.848, "speaker": "Cory"}, {"confidence": 0.96, "end": 2171.894, "track": 1, "text": "You can still do dumb stuff and if you don't have a some sort of the governance tool that can help you manage doing dumb stuff.", "start": 2162.881, "speaker": "Cory"}, {"confidence": 0.8, "end": 2176.629, "track": 1, "text": "The cloud however secure Amazon dress to make their services are google-cloud-platform HR services.", "start": 2172.099, "speaker": "Cory"}, {"confidence": 0.95, "end": 2191.057, "track": 1, "text": "You can still have out administrators humans the obviously we've talked about this for the the the weakest link in this whole chain is the heat up and we can make that decision so that's good that she was going to go to extend into that that that new world of multi-cloud.", "start": 2176.852, "speaker": "Cory"}, {"confidence": 0.88, "end": 2194.182, "track": 0, "text": "Can you really only secure is the person clicking the button right.", "newpara": true, "start": 2190.991, "speaker": "Scott"}, {"confidence": 0.9, "end": 2198.202, "track": 1, "text": "That's the butts in the seats so out of curiosity so.", "newpara": true, "start": 2193.882, "speaker": "Cory"}, {"confidence": 0.85, "end": 2198.386, "track": 2, "text": "So out of curiosity so.", "newpara": true, "start": 2194.082, "speaker": "Brett"}, {"confidence": 0.89, "end": 2210.773, "track": 1, "text": "And obviously monitor architecture big Trend we've talked about the last time she gave me the date of flying service is helping extend the capabilities to a higher multi-cloud hybrid world.", "newpara": true, "start": 2198.286, "speaker": "Cory"}, {"confidence": 0.89, "end": 2213.651, "track": 1, "text": "Solve some of the governance and compliance challenges.", "start": 2210.983, "speaker": "Cory"}, {"confidence": 0.92, "end": 2222.587, "track": 1, "text": "What about on the streaming xikezan ohd F was a big part of the modern data platform is is there anything happening with hdf this year that we should be paying attention to.", "start": 2213.772, "speaker": "Cory"}, {"confidence": 0.96, "end": 2229.239, "track": 0, "text": "Well there's a whole lot going on in that space and thanks for reminding me to bring that up you know.", "newpara": true, "start": 2222.647, "speaker": "Scott"}, {"confidence": 0.98, "end": 2232.91, "track": 1, "text": "I did say this was your show.", "newpara": true, "start": 2229.99, "speaker": "Cory"}, {"confidence": 0.94, "end": 2242.459, "track": 0, "text": "Thank you very much so yeah hdf we continue to invest for heavily you know I mentioned last year there was a big aha moment in our customer install base and certainly through.", "newpara": true, "start": 2231.456, "speaker": "Scott"}, {"confidence": 0.92, "end": 2256.947, "track": 0, "text": "The results that we published and so far for 2017 we've talked about kind of the increased a crate of hdf as people trying to realize hey this is like as big as storing data is how do I capture it touch it managed to close those kinds of things.", "start": 2242.669, "speaker": "Scott"}, {"confidence": 0.91, "end": 2266.735, "track": 0, "text": "So are approaching the space is that we look at it as data in motion and for us that includes streaming as well as.", "start": 2257.83, "speaker": "Scott"}, {"confidence": 0.9, "end": 2270.707, "track": 0, "text": "Dataflow and kind of everywhere in between so.", "start": 2267.042, "speaker": "Scott"}, {"confidence": 0.91, "end": 2298.042, "track": 0, "text": "That seamless right so scheme registry was our first and sensation of that again released last year and you'll see us move the ball forward as we.", "newpara": true, "start": 2289.522, "speaker": "Scott"}, {"confidence": 0.91, "end": 2304.785, "track": 0, "text": "I continue to invest in that as well as integration of things like schema registry and Apache Atlas and.", "start": 2298.265, "speaker": "Scott"}, {"confidence": 0.96, "end": 2317.283, "track": 0, "text": "You know some of the other governance models to make provenance even easier and more seamless and I think again it would it would be even though it's a discrete set of products that is different that we.", "start": 2305.061, "speaker": "Scott"}, {"confidence": 0.93, "end": 2327.751, "track": 0, "text": "That Wii bundle separately because they have separate used cases in separate needs I think over time you'll see kind of a blurring of the lines what was almost look like one big thing.", "start": 2317.711, "speaker": "Scott"}, {"confidence": 0.82, "end": 2333.574, "track": 0, "text": "Right around that revolves around those kind of key core services and a date of Plain Central kind of world.", "start": 2327.896, "speaker": "Scott"}, {"confidence": 0.96, "end": 2344.661, "track": 1, "text": "Yeah so what did you talk about with Alan Gates on a previous episode was that works obviously this great Product Company developing some very interesting products to solve interesting,", "newpara": true, "start": 2333.611, "speaker": "Cory"}, {"confidence": 0.93, "end": 2352.996, "track": 1, "text": "gaps in the Enterprise adoption of a modern data platform that's very cool things he said never heard you talk about it a lot is really around.", "start": 2344.722, "speaker": "Cory"}, {"confidence": 0.77, "end": 2362.133, "track": 2, "text": "Solving customer yusuke's right those you're going to think I'm 2017 is like.", "newpara": true, "start": 2352.896, "speaker": "Brett"}, {"confidence": 0.88, "end": 2372.933, "track": 1, "text": "My customer story was there a customer like vertical that was the most interesting to you.", "newpara": true, "start": 2368.511, "speaker": "Cory"}, {"confidence": 0.92, "end": 2384.074, "track": 0, "text": "Wow you know there were a lot of customer stories and I found very interesting you know I'll date myself again and talk about 10 of history repeating itself.", "newpara": true, "start": 2372.982, "speaker": "Scott"}, {"confidence": 0.96, "end": 2392.024, "track": 0, "text": "In the early 90s I remember a bunch of Industry analyst running around saying 80% of BBWs fail.", "start": 2384.405, "speaker": "Scott"}, {"confidence": 0.87, "end": 2403.219, "track": 0, "text": "And she what was the highlight of the analyst reports last year at 80% of the Gator projects are unsuccessful is that papa papa papa.", "start": 2393.845, "speaker": "Scott"}, {"confidence": 0.98, "end": 2409.27, "track": 0, "text": "Okay whatever my point is that obviously we wouldn't be here.", "start": 2403.364, "speaker": "Scott"}, {"confidence": 0.9, "end": 2414.823, "track": 0, "text": "And we wouldn't think it was just important if we weren't solving real production problems for customer so,", "start": 2409.451, "speaker": "Scott"}, {"confidence": 0.94, "end": 2428.986, "track": 0, "text": "one of the things that I personally have issue with is a bunch of animals running around kind of scaring the world like they did in the 90s and look what happened. We came this multibillion-dollar thing and they can everybody's doing it and successful in Table Steaks,", "start": 2414.775, "speaker": "Scott"}, {"confidence": 0.94, "end": 2440.433, "track": 0, "text": "so I think we're kind of on the cusp of that happening in our space and so is really important the flip side is that a lot of customers who are doing things with our tag and with big data.", "start": 2429.84, "speaker": "Scott"}, {"confidence": 0.95, "end": 2447.885, "track": 0, "text": "They're very breakthrough that they're using to build new business models to be more competitive so the last thing we want to do is actually talk about it.", "start": 2440.686, "speaker": "Scott"}, {"confidence": 0.97, "end": 2452.626, "track": 0, "text": "And tell everybody else hey this is what we're doing right.", "start": 2448.209, "speaker": "Scott"}, {"confidence": 0.93, "end": 2462.613, "track": 1, "text": "I'm going to remind some people this because like that's one of those things that has s practitioners in the space one if your customer and you're trying to find out what other customers are doing like if you go to the conferences,", "newpara": true, "start": 2452.422, "speaker": "Cory"}, {"confidence": 0.9, "end": 2470.257, "track": 1, "text": "it's really hard to get him to talk about and then if you're up a provider in this way so I'm sure the hortonworks sales teams deals with this I know that a lot of i t you know,", "start": 2462.637, "speaker": "Cory"}, {"confidence": 0.86, "end": 2477.389, "track": 1, "text": "sitting on sales and preschool themes deal with this the customer to go hey tell me what your other three customers just like me or doing with your technology and you go.", "start": 2470.119, "speaker": "Cory"}, {"confidence": 0.97, "end": 2480.556, "track": 1, "text": "It just doesn't make sense.", "start": 2477.798, "speaker": "Cory"}, {"confidence": 0.95, "end": 2490.134, "track": 0, "text": "Yeah so we're kind of in that conundrum right now it'll this too shall pass.", "newpara": true, "start": 2481.752, "speaker": "Scott"}, {"confidence": 0.93, "end": 2494.539, "track": 0, "text": "You know I'm not entirely worried about it but of course I'm.", "start": 2490.495, "speaker": "Scott"}, {"confidence": 0.91, "end": 2506.972, "track": 0, "text": "Any anytime I find someone who will talk about something publicly is like yes please let's go do it and we want we want to Foster that environment and accelerate it.", "start": 2495.333, "speaker": "Scott"}, {"confidence": 0.96, "end": 2516.599, "track": 0, "text": "There was a white paper in a blog published by Geisinger Health earlier this year that I found particularly interesting and rewarding because they name names and,", "start": 2507.537, "speaker": "Scott"}, {"confidence": 0.89, "end": 2523.689, "track": 0, "text": "talk about what they did and talked about the success and how they were able to network with her business to her.", "start": 2516.515, "speaker": "Scott"}, {"confidence": 0.93, "end": 2532.883, "track": 0, "text": "Are utility in the UK called centrica similar thing they've done some use cases spoken at our conferences and other conferences about what they were able to do.", "start": 2524.609, "speaker": "Scott"}, {"confidence": 0.96, "end": 2541.272, "track": 0, "text": "Leveraging Big Data technology and so those use cases are starting to show up and and I find that extremely rewarding.", "start": 2533.25, "speaker": "Scott"}, {"confidence": 0.95, "end": 2556.33, "track": 0, "text": "I put the shout out to them you know they're in the public domain and obviously I would encourage folks to look at hortonworks. Com any anytime a customer gives us permission to talk about what they're doing we're going to put it out there as well just because it's like really important.", "start": 2541.494, "speaker": "Scott"}, {"confidence": 0.96, "end": 2561.156, "track": 0, "text": "But there are you know I can tell.", "start": 2557.49, "speaker": "Scott"}, {"confidence": 0.9, "end": 2568.337, "track": 0, "text": "Not just because I run around the world talking with customers and Prospects is my role of CTO but also does have our support organization.", "start": 2561.445, "speaker": "Scott"}, {"confidence": 0.96, "end": 2576.364, "track": 0, "text": "That's part of my team and I can tell just from our support calls and the intensity of what our customers are asking us to help them with.", "start": 2568.649, "speaker": "Scott"}, {"confidence": 0.95, "end": 2582.608, "track": 0, "text": "That we're seeing a huge rush to production and production use cases meaning.", "newpara": true, "start": 2576.792, "speaker": "Scott"}, {"confidence": 0.94, "end": 2595.305, "track": 0, "text": "Business processes are depending on this technology and I see that is extremely encouraging and and frankly I I will debate till the last of my breath is industry analysts say.", "start": 2582.885, "speaker": "Scott"}, {"confidence": 0.97, "end": 2602.636, "track": 0, "text": "Big data is failing Hadoop has failed or Big Data projects are not in production cuz it's just not what I'm saying.", "start": 2595.678, "speaker": "Scott"}, {"confidence": 0.96, "end": 2605.05, "track": 2, "text": "No definitely not the case.", "newpara": true, "start": 2602.536, "speaker": "Brett"}, {"confidence": 0.94, "end": 2614.348, "track": 0, "text": "Didn't work Summit coming up a couple of shows globally in 28 never heard of it.", "newpara": true, "start": 2604.95, "speaker": "Scott"}, {"confidence": 0.93, "end": 2617.617, "track": 0, "text": "Any preview you can give the audience anything you can talk about what.", "start": 2614.727, "speaker": "Scott"}, {"confidence": 0.94, "end": 2626.078, "track": 0, "text": "Fort Worth going to talk about me but you're going to be talking about any of these shows anything you can tease out there for us it's going to be great.", "start": 2618.188, "speaker": "Scott"}, {"confidence": 0.84, "end": 2632.213, "track": 0, "text": "The you know first off you know we get we replanted today to work Summit from.", "start": 2626.445, "speaker": "Scott"}, {"confidence": 0.94, "end": 2641.767, "track": 0, "text": "Hoop Summit which gets to the earlier conversation we had a few notes is modern architecture much more than it is about the data and what you can do with the data how data works.", "start": 2632.622, "speaker": "Scott"}, {"confidence": 0.95, "end": 2651.178, "track": 0, "text": "Get it they don't work Summit you'll see us focus on customer use case examples and and really letting our customers have.", "start": 2642.05, "speaker": "Scott"}, {"confidence": 0.97, "end": 2660.491, "track": 0, "text": "The driver seat in terms of describing And discussing and talking about a reticulating what they're doing of course in each of those venues will have some additional product updates.", "start": 2651.322, "speaker": "Scott"}, {"confidence": 0.95, "end": 2666.543, "track": 0, "text": "I don't want to say too much more because then you won't tune in.", "start": 2660.876, "speaker": "Scott"}, {"confidence": 0.88, "end": 2674.15, "track": 1, "text": "MSU quick question if if folks wanted to find you on social are you on the Twitter.", "newpara": true, "start": 2666.321, "speaker": "Cory"}, {"confidence": 0.97, "end": 2675.032, "track": 2, "text": "Social are you on the Twitter.", "newpara": true, "start": 2666.443, "speaker": "Brett"}, {"confidence": 0.98, "end": 2677.095, "track": 0, "text": "I am on the Twitter.", "newpara": true, "start": 2674.932, "speaker": "Scott"}, {"confidence": 0.96, "end": 2678.453, "track": 1, "text": "And do you have any.", "newpara": true, "start": 2676.795, "speaker": "Cory"}, {"confidence": 0.95, "end": 2686.312, "track": 0, "text": "Scott underscore yes I'm starting a hashtag I'm from San Diego.", "newpara": true, "start": 2678.934, "speaker": "Scott"}, {"confidence": 0.97, "end": 2691.072, "track": 0, "text": "And I am particularly perturbed and insulted that the.", "start": 2686.602, "speaker": "Scott"}, {"confidence": 0.93, "end": 2700.897, "track": 0, "text": "NFL football team was allowed to move to Los Angeles so I have a hashtag campaign called hashtag Dean is an ass focus on the owners of the.", "start": 2691.667, "speaker": "Scott"}, {"confidence": 0.97, "end": 2708.648, "track": 0, "text": "Now La Chargers who left after making billions of dollars out of the San Diego community over 40 years to LA.", "start": 2701.131, "speaker": "Scott"}, {"confidence": 0.88, "end": 2713.263, "track": 1, "text": "I got you okay so go follow me on Twitter I'm assuming we'll see you the day to work summits.", "newpara": true, "start": 2708.883, "speaker": "Cory"}, {"confidence": 0.94, "end": 2716.598, "track": 0, "text": "You might see me at the day to work Summit perhaps if I'm invited.", "newpara": true, "start": 2712.963, "speaker": "Scott"}, {"confidence": 0.93, "end": 2730.653, "track": 1, "text": "Well very good one Scott we had a blast chatting with you it's great to get your Trends going to where you at where you see a 2017 brought us to now and what's ahead of us in 2018 so I want to take a few minutes shift gears for a second or personal,", "newpara": true, "start": 2717.35, "speaker": "Cory"}, {"confidence": 0.95, "end": 2732.48, "track": 1, "text": "we have a rapid fire section.", "start": 2730.552, "speaker": "Cory"}, {"confidence": 0.93, "end": 2742.329, "track": 1, "text": "No we're not done so hang on it's just it's a few quick questions and what I want you to do sit back relax and just going to say the first thing that comes to mind when I ask you these questions okay.", "start": 2732.907, "speaker": "Cory"}, {"confidence": 0.93, "end": 2746.626, "track": 1, "text": "It won't hurt will be easy on you or maybe you be easy on us.", "start": 2742.708, "speaker": "Cory"}, {"confidence": 0.45, "end": 2747.377, "track": 0, "text": "Penis in ass.", "newpara": true, "start": 2746.325, "speaker": "Scott"}, {"confidence": 0.93, "end": 2752.118, "track": 1, "text": "Alright so what year do you think Skynet will go online.", "newpara": true, "start": 2747.077, "speaker": "Cory"}, {"confidence": 0.99, "end": 2754.269, "track": 0, "text": "I don't know.", "newpara": true, "start": 2753.08, "speaker": "Scott"}, {"confidence": 0.99, "end": 2757.839, "track": 1, "text": "Okay if you bought me a book what would it be.", "newpara": true, "start": 2753.993, "speaker": "Cory"}, {"confidence": 0.98, "end": 2758.125, "track": 2, "text": "If you bought me a book what would it be.", "newpara": true, "start": 2754.169, "speaker": "Brett"}, {"confidence": 0.89, "end": 2765.362, "track": 1, "text": "Or maybe best book you read in 2017.", "newpara": true, "start": 2762.352, "speaker": "Cory"}, {"confidence": 0.92, "end": 2769.903, "track": 2, "text": "I didn't have time to read I was busy Building Products.", "newpara": true, "start": 2765.262, "speaker": "Brett"}, {"confidence": 0.91, "end": 2785.995, "track": 0, "text": "Wow I went to see Wally Nelson night before last.", "newpara": true, "start": 2781.581, "speaker": "Scott"}, {"confidence": 0.81, "end": 2790.402, "track": 1, "text": "Awesome\nyeah but Willie is he Super C.", "newpara": true, "start": 2785.853, "speaker": "Cory"}, {"confidence": 0.97, "end": 2793.268, "track": 0, "text": "Although I don't like country music I happen to find talented musicians everywhere very entertaining.", "newpara": true, "start": 2786.823, "speaker": "Scott"}, {"confidence": 0.94, "end": 2805.887, "track": 1, "text": "That's awesome literally we had a guest the guest on the show you're I think you're the only two people that have said like the same artist which is awesome way to go Willie so let's go the next one what is your favorite piece.", "newpara": true, "start": 2793.118, "speaker": "Cory"}, {"confidence": 0.92, "end": 2806.102, "track": 2, "text": "That's awesome literally we had a guest guest on a shelf I think you're the only two people that have said like the same artist which is awesome way to go Willie so let's see what is your favorite piece.", "newpara": true, "start": 2793.168, "speaker": "Brett"}, {"confidence": 0.98, "end": 2809.198, "track": 1, "text": "Of just utterly useless are goofy technology.", "newpara": true, "start": 2806.002, "speaker": "Cory"}, {"confidence": 0.97, "end": 2814.666, "track": 0, "text": "My favorite useless technology is the windshield wipers in my car.", "newpara": true, "start": 2809.794, "speaker": "Scott"}, {"confidence": 0.91, "end": 2818.963, "track": 1, "text": "That's awesome.", "newpara": true, "start": 2816.584, "speaker": "Cory"}, {"confidence": 0.95, "end": 2835.77, "track": 0, "text": "Their way over engineered and every time you turn them on and off when they come to arrest little flip halfway so that every other time it'll rest on the opposite side of the rubber blade.", "newpara": true, "start": 2822.515, "speaker": "Scott"}, {"confidence": 0.8, "end": 2836.84, "track": 1, "text": "Oh goodness.", "newpara": true, "start": 2835.68, "speaker": "Cory"}, {"confidence": 0.94, "end": 2839.929, "track": 0, "text": "In San Diego where it never rains and I actually never turn them on.", "newpara": true, "start": 2836.894, "speaker": "Scott"}, {"confidence": 0.98, "end": 2845.337, "track": 1, "text": "Nice what is your biggest Money Pit right now personal Money Pit.", "newpara": true, "start": 2839.731, "speaker": "Cory"}, {"confidence": 0.98, "end": 2846.248, "track": 2, "text": "What is your biggest Money Pit right now personal Money Pit.", "newpara": true, "start": 2839.829, "speaker": "Brett"}, {"confidence": 0.97, "end": 2851.784, "track": 0, "text": "My biggest personal Money Pit it's either my wife or my dog or perhaps the two of them combined.", "newpara": true, "start": 2846.148, "speaker": "Scott"}, {"confidence": 0.96, "end": 2856.315, "track": 1, "text": "Family got it okay and are you going anywhere really interesting or cool soon.", "newpara": true, "start": 2851.521, "speaker": "Cory"}, {"confidence": 0.95, "end": 2857.022, "track": 2, "text": "I got it okay and are you going anywhere really interesting or cool soon.", "newpara": true, "start": 2851.684, "speaker": "Brett"}, {"confidence": 0.94, "end": 2861.922, "track": 0, "text": "I will be in Mumbai in four days and that's always cool and interesting.", "newpara": true, "start": 2856.923, "speaker": "Scott"}, {"confidence": 0.95, "end": 2868.067, "track": 1, "text": "It is India is super fun and then are you binging on any particular show right now.", "newpara": true, "start": 2861.718, "speaker": "Cory"}, {"confidence": 0.93, "end": 2868.241, "track": 2, "text": "It is super fun and then are you binging on any particular show right now.", "newpara": true, "start": 2861.822, "speaker": "Brett"}, {"confidence": 0.86, "end": 2872.69, "track": 1, "text": "Like on your flight to Mumbai are going to rock in any Netflix downloads.", "newpara": true, "start": 2868.961, "speaker": "Cory"}, {"confidence": 0.95, "end": 2873.277, "track": 2, "text": "On your flight to Mumbai\nNetflix downloads.", "newpara": true, "start": 2869.111, "speaker": "Brett"}, {"confidence": 0.96, "end": 2884.348, "track": 0, "text": "You know I've watched all of the ones that I wanted to bench out on I would say I'm really looking forward to the new season of Homeland.", "newpara": true, "start": 2873.177, "speaker": "Scott"}, {"confidence": 0.82, "end": 2885.988, "track": 1, "text": "Excellent hall right.", "newpara": true, "start": 2884.378, "speaker": "Cory"}, {"confidence": 0.97, "end": 2887.873, "track": 0, "text": "Which will not be available in time for my,", "newpara": true, "start": 2885.688, "speaker": "Scott"}, {"confidence": 0.75, "end": 2889.141, "track": 0, "text": "24 hour flight.", "start": 2887.919, "speaker": "Scott"}, {"confidence": 0.81, "end": 2890.453, "track": 1, "text": "Bummer.", "newpara": true, "start": 2888.969, "speaker": "Cory"}, {"confidence": 0.81, "end": 2892.346, "track": 0, "text": "Got to be watch all the previous seasons.", "newpara": true, "start": 2890.203, "speaker": "Scott"}, {"confidence": 0.84, "end": 2904.857, "track": 2, "text": "We watch all the previous seasons.", "newpara": true, "start": 2890.353, "speaker": "Brett"}, {"confidence": 0.91, "end": 2904.857, "track": 1, "text": "There you go hello. What's got it's been super fun to have you on we really appreciate it Scott now again from a hortonworks here at the Horton Works sales kickoff for 2018 thanks again and thanks for tuning then.", "newpara": true, "start": 2892.088, "speaker": "Cory"}]