[{"confidence": 0.95, "end": 13.49, "track": 0, "text": "Hi folks this is Corey mountain with the bigdatabeard along for another exciting ride and journey.", "newpara": true, "start": 6.039, "speaker": "Cory"}, {"confidence": 0.85, "end": 21.542, "track": 0, "text": "Through exciting happenings in the big deal that you go system I've joined today by a couple of bearded gentleman Kyle and Brett,", "start": 13.418, "speaker": "Cory"}, {"confidence": 0.88, "end": 30.255, "track": 0, "text": "and we are excited because you know there's a lot of Hot Topics in Big Data it's there's a lot of past City Topix but the one that is in Vogue.", "start": 21.344, "speaker": "Cory"}, {"confidence": 0.97, "end": 32.311, "track": 0, "text": "Right now probably more than ever,", "start": 30.124, "speaker": "Cory"}, {"confidence": 0.91, "end": 40.447, "track": 0, "text": "is this concept of deep learning and we're seeing deep learning machine learning an AI confusion everywhere and we wanted to.", "start": 32.137, "speaker": "Cory"}, {"confidence": 0.94, "end": 48.721, "track": 0, "text": "Spend a little bit of time with somebody who can help us unpack and understand you know really from that architect in that data engineer perspective.", "start": 40.369, "speaker": "Cory"}, {"confidence": 0.92, "end": 55.674, "track": 0, "text": "What is all this stuff mean and what are the architectural tenants of deep learning and help us understand how,", "start": 48.668, "speaker": "Cory"}, {"confidence": 0.93, "end": 66.424, "track": 0, "text": "we can help our Enterprises achieve their objectives with deep learning so I'm very excited to have joining us today mr. Keith manthey the CTO for the unstructured division.", "start": 55.812, "speaker": "Cory"}, {"confidence": 0.73, "end": 68.287, "track": 0, "text": "Adele EMC Keith welcome.", "start": 66.334, "speaker": "Cory"}, {"confidence": 0.98, "end": 70.282, "track": 1, "text": "Thank you.", "newpara": true, "start": 68.486, "speaker": "Keith"}, {"confidence": 0.93, "end": 82.258, "track": 0, "text": "Keith I wanted to talk with you a little bit about again deep learning machine learning super interesting and we read your blog post that was really the basis for hot of Ark of the beginning of our conversations.", "newpara": true, "start": 70.535, "speaker": "Cory"}, {"confidence": 0.97, "end": 93.513, "track": 0, "text": "One thing I like about this is is you start out kind of unpacking this thing for me but before we unpack it what I don't understand is why is machine learning a deep learning why do you think it's so hot right now.", "start": 82.108, "speaker": "Cory"}, {"confidence": 0.74, "end": 104.029, "track": 1, "text": "You know I think the best way to describe it is you know we've been fascinated as a culture\nwith a I sense.", "newpara": true, "start": 95.665, "speaker": "Keith"}, {"confidence": 0.97, "end": 112.562, "track": 1, "text": "You know and if you go back you look at it we still hold the Turing test something that was invented in 1943 if I remember correctly.", "start": 104.624, "speaker": "Keith"}, {"confidence": 0.92, "end": 125.655, "track": 1, "text": "As you're one of the Pinnacles if you've succeeded so here are Benchmark is you know seven years old and where were starting to achieve a level of you no capabilities.", "start": 112.784, "speaker": "Keith"}, {"confidence": 0.89, "end": 132.752, "track": 1, "text": "That can ultimately cheap and so you know what's interesting was machine learning went through all the vogan and certainly.", "start": 125.818, "speaker": "Keith"}, {"confidence": 0.82, "end": 135.997, "track": 1, "text": "Had a lot of of grape press.", "start": 133.317, "speaker": "Keith"}, {"confidence": 0.92, "end": 145.936, "track": 1, "text": "But it also had a very very dark side and you know what I say that and then not sort of in a negative way but if you look at some of the early duration to machine learning.", "start": 136.316, "speaker": "Keith"}, {"confidence": 0.9, "end": 154.481, "track": 1, "text": "It was a whole Fascination sometimes around detecting faces detecting pictures detecting different thing.", "start": 146.567, "speaker": "Keith"}, {"confidence": 0.89, "end": 161.854, "track": 1, "text": "And one of those the real your benefits was if you had something that it could fully construct like the picture.", "start": 154.782, "speaker": "Keith"}, {"confidence": 0.91, "end": 170.171, "track": 1, "text": "Or the picture of a child it was really good at sort of assessing and it in your detecting age in detecting motion.", "start": 162.72, "speaker": "Keith"}, {"confidence": 0.93, "end": 180.777, "track": 1, "text": "But if you had something and couldn't account for so maybe a wounded warrior with a traumatic brain injury that wasn't able to handle you know nuances.", "start": 170.694, "speaker": "Keith"}, {"confidence": 0.89, "end": 191.497, "track": 1, "text": "It's sort of went through a phase where in a machine-learning sort of took a dark. Because it couldn't account for the bad data the bad day to being something not perfect in a picture.", "start": 181.18, "speaker": "Keith"}, {"confidence": 0.96, "end": 203.737, "track": 1, "text": "And now you know the reason why defunding is suddenly all the folk is there starting to realize that you can create a model where you can actually allow it to Discount Parts.", "newpara": true, "start": 192.14, "speaker": "Keith"}, {"confidence": 0.92, "end": 215.437, "track": 1, "text": "It can also create a model where it doesn't need everything great example is one of the pictures I use in talking a lot is really picture of two legs of a chair.", "start": 204.134, "speaker": "Keith"}, {"confidence": 0.93, "end": 223.916, "track": 1, "text": "Deep learning has figured out that that's a chair it doesn't where you sit it doesn't meet the back it doesn't eat all four legs it literally just has two legs of the chair.", "start": 215.906, "speaker": "Keith"}, {"confidence": 0.93, "end": 234.708, "track": 1, "text": "And as we talk to businesses we talk to you no different consumer groups out their customers in you know and all the things the number one thing businesses tell me if they have a lot of good data.", "start": 224.307, "speaker": "Keith"}, {"confidence": 0.93, "end": 244.455, "track": 1, "text": "And so if there's not a way for them to you no have no capabilities to Discount the bad data the results are going to get there.", "start": 234.901, "speaker": "Keith"}, {"confidence": 0.89, "end": 255.986, "track": 1, "text": "So that's sort of you know what I mean she thinks it would have caught up and you know when the things that we've been asking about for years are now if you want to look at it that way.", "start": 245.008, "speaker": "Keith"}, {"confidence": 0.95, "end": 268.84, "track": 0, "text": "Yeah it feels like we came out of this I think I've heard the term a number of times like a machine learning winter or 1/8 High winter where there was these these there was a speak and kind of interest is,", "newpara": true, "start": 255.914, "speaker": "Cory"}, {"confidence": 0.92, "end": 274.825, "track": 0, "text": "digitization of information sort of started and then like you said there were some struggles and stumbles along the way,", "start": 268.732, "speaker": "Cory"}, {"confidence": 0.93, "end": 284.361, "track": 0, "text": "combined with I think science fiction we saw a whole bunch of really bad examples of what I could turn into think you Skynet in Terminator you jerks,", "start": 274.645, "speaker": "Cory"}, {"confidence": 0.92, "end": 294.691, "track": 0, "text": "and then I saw this thing which was Hey and I actually saw, by Jeff Dean from my Google the other day it's like the ubiquity of.", "start": 284.47, "speaker": "Cory"}, {"confidence": 0.88, "end": 301.126, "track": 0, "text": "Doug data now like the amount of digitized data its restitch reach that critical mass.", "start": 294.565, "speaker": "Cory"}, {"confidence": 0.91, "end": 311.065, "track": 0, "text": "That was important form for machine learning that defunded take off and the ubiquity of computing capabilities and the Frameworks that could handle.", "start": 301.151, "speaker": "Cory"}, {"confidence": 0.96, "end": 322.891, "track": 0, "text": "Large amounts of data and develop models that use as you said work we're good it's all kind of come to a head so it feels like we're in kind of this this air this deep learning spring that's ahead of us.", "start": 311.21, "speaker": "Cory"}, {"confidence": 0.89, "end": 330.607, "track": 0, "text": "I guess one thing that we talked about kind of lump them altogether I'm curious your opinion instead of the differences between.", "newpara": true, "start": 323.312, "speaker": "Cory"}, {"confidence": 0.95, "end": 337.331, "track": 0, "text": "If you're if you're a data engineer kind of an architect like how would you understand the difference between what's machine learning versus deep learning.", "start": 330.583, "speaker": "Cory"}, {"confidence": 0.9, "end": 344.229, "track": 1, "text": "Sure so if if I'm going to you know break it down.", "newpara": true, "start": 338.93, "speaker": "Keith"}, {"confidence": 0.93, "end": 357.642, "track": 1, "text": "You know just I'll do the full categorization cuz I get off and ask them like you said if we were to sort of Define your different categories for what they are I like to call a i c.", "start": 344.482, "speaker": "Keith"}, {"confidence": 0.93, "end": 366.902, "track": 1, "text": "It is so if I'm going to I love your your reference because you know really a balls back to forward thinking but never something we can feel itchy\nmachine learning.", "start": 358.237, "speaker": "Keith"}, {"confidence": 0.94, "end": 381.161, "track": 1, "text": "Was you know so if I went in and did you know any kind of Hadoop model with my out whether it's parka ml live or any other technology and I wanted to do some form of bucket.", "start": 367.467, "speaker": "Keith"}, {"confidence": 0.94, "end": 394.615, "track": 1, "text": "I wanted to potentially take away a pile of data and a classified into a few different strain and then try to then assign maybe some values to that using.", "start": 381.931, "speaker": "Keith"}, {"confidence": 0.81, "end": 398.161, "track": 1, "text": "Either we are truly on supervised type of technique.", "start": 395.061, "speaker": "Keith"}, {"confidence": 0.96, "end": 407.529, "track": 1, "text": "Maybe they were supervised but yet you know the focus there was the engineer did all the feature selection manual.", "start": 398.624, "speaker": "Keith"}, {"confidence": 0.9, "end": 420.719, "track": 1, "text": "The library is really were working what pain just would have a framework where Magics would have happened and I don't say that and sort of that but you.", "start": 408.16, "speaker": "Keith"}, {"confidence": 0.93, "end": 431.956, "track": 1, "text": "There wasn't a whole lot of dials or hyperparameters or ways that you could go in and tunic you could choose Ensemble models you could choose a different way to do.", "start": 421.416, "speaker": "Keith"}, {"confidence": 0.97, "end": 438.217, "track": 1, "text": "Different types of models but there wasn't a lot of granularity that you could dial into what you were.", "newpara": true, "start": 432.341, "speaker": "Keith"}, {"confidence": 0.97, "end": 448.463, "track": 1, "text": "You couldn't discount bad data unless you throw it out ahead of time you couldn't discount you know some of the values and so whatever came out of it and some of the early duration.", "start": 438.638, "speaker": "Keith"}, {"confidence": 0.91, "end": 459.441, "track": 1, "text": "You likely if you did any kind of any machine learning up until probably before 2 years ago it was mushy and learn it was you know no matter what it was.", "start": 449.022, "speaker": "Keith"}, {"confidence": 0.89, "end": 470.546, "track": 1, "text": "Where were starting to see in the Deep learning room\nusually you will start to see a construct there's lots of them.", "newpara": true, "start": 461.202, "speaker": "Keith"}, {"confidence": 0.98, "end": 473.466, "track": 1, "text": "There's lots of names that go with them.", "start": 470.865, "speaker": "Keith"}, {"confidence": 0.94, "end": 483.94, "track": 1, "text": "Additionally they will have some form of recursive capabilities it could be called a convolutional neural network if he called recursive neural network it be called recurrent.", "start": 474.044, "speaker": "Keith"}, {"confidence": 0.92, "end": 493.699, "track": 1, "text": "I seen a lot of those you could have you know different types of capabilities but really what it it's trying to do is it's trying to emulate sort of how the brain works.", "start": 484.704, "speaker": "Keith"}, {"confidence": 0.93, "end": 507.081, "track": 1, "text": "So you'll see a series of passive and different layers the idea is it's instead of trying to go through and do it all in one large massive pass to try and categorize.", "start": 494.006, "speaker": "Keith"}, {"confidence": 0.88, "end": 516.035, "track": 1, "text": "If you want to go back to the infamous it is said I think everybody who's ever done machine learning course is going to play with the the flower take data set.", "start": 507.965, "speaker": "Keith"}, {"confidence": 0.97, "end": 528.407, "track": 1, "text": "And so you know if you were to do that deep learning it now starts to take over some of the hyperparameters you can start to actually allow it to do feature selection what I mean by that is.", "start": 516.366, "speaker": "Keith"}, {"confidence": 0.9, "end": 536.201, "track": 1, "text": "It will have the ability to Discount data that maybe doesn't contribute to the end goal.", "start": 528.852, "speaker": "Keith"}, {"confidence": 0.9, "end": 545.683, "track": 1, "text": "And so you know what will there's a lot of libraries out there some of them are in the defense Park Spectrum like Intel's Big D L you have.", "start": 536.448, "speaker": "Keith"}, {"confidence": 0.91, "end": 554.349, "track": 1, "text": "Departing for Jay and some of the other yes park with tensorflow are sort of in the you'll see it in the head dupe and he can spark landscape.", "start": 546.032, "speaker": "Keith"}, {"confidence": 0.94, "end": 564.564, "track": 1, "text": "You also are starting to see a real big influx where HPC high performance Computing are back in Vogue and you'll see Libras like tensorflow.", "newpara": true, "start": 554.565, "speaker": "Keith"}, {"confidence": 0.69, "end": 568.878, "track": 1, "text": "Tiano torch by torch tool kit.", "start": 564.841, "speaker": "Keith"}, {"confidence": 0.85, "end": 577.886, "track": 1, "text": "Cafe too and so those are really focused on the high performance with you today you have a turd of passes within a high performer.", "start": 569.618, "speaker": "Keith"}, {"confidence": 0.87, "end": 581.876, "track": 1, "text": "And so that's really been through the evolution of last 2 years.", "start": 578.596, "speaker": "Keith"}, {"confidence": 0.93, "end": 594.447, "track": 1, "text": "And almost every machine learning book that I've actually read or looked at lately really starts to include all of the deep learning even if they say machine learning them they're starting to cool out of the deep learning embedded into it.", "start": 582.021, "speaker": "Keith"}, {"confidence": 0.85, "end": 603.443, "track": 1, "text": "I know that's a long way to answer but in a really what you'll see is\ndo anything where you see the term neural-net you're probably doing people are.", "start": 594.628, "speaker": "Keith"}, {"confidence": 0.9, "end": 613.466, "track": 0, "text": "Okay that makes sense just machine learning right is applying old math in new ways deep learning is now how do you automate and use.", "newpara": true, "start": 603.569, "speaker": "Cory"}, {"confidence": 0.88, "end": 621.296, "track": 0, "text": "Maybe old math maybe new math maybe new programming capabilities to allow the model to improve itself.", "start": 613.424, "speaker": "Cory"}, {"confidence": 0.92, "end": 632.605, "track": 0, "text": "Riding to go back over the date of more than once not so much more than one batch but are Serta make a sipper passes on some bleeding criteria and and and models that's really cool I get that no one thing that I.", "start": 621.314, "speaker": "Cory"}, {"confidence": 0.95, "end": 647.567, "track": 0, "text": "I'm generally I think I think is that accurate maybe you can tell me if I'm wrong but whether it's deep learning or machine learning or frankly you could even argue some of the units or the Big Data stuff there seems to be some architectural tenants,", "start": 632.503, "speaker": "Cory"}, {"confidence": 0.91, "end": 656.749, "track": 0, "text": "that you know some macros that emerged across all those and maybe even in the HBC space and in your blog you talk about sort of these these four pillars,", "start": 647.393, "speaker": "Cory"}, {"confidence": 0.88, "end": 661.49, "track": 0, "text": "of architectural tenants and I want to unpack a Lil Bit of those so,", "start": 656.593, "speaker": "Cory"}, {"confidence": 0.94, "end": 666.826, "track": 0, "text": "so tell us what are those critical kind of Architectural Components that you see and are they.", "start": 661.328, "speaker": "Cory"}, {"confidence": 0.88, "end": 671.598, "track": 0, "text": "Are they kind of generally true of both mldl and Big Data.", "start": 666.725, "speaker": "Cory"}, {"confidence": 0.95, "end": 682.053, "track": 1, "text": "Sort of and you know what what gets interesting is a lot of it has to do with how the libraries have built.", "newpara": true, "start": 672.878, "speaker": "Keith"}, {"confidence": 0.96, "end": 688.603, "track": 1, "text": "You know and some of it has to do with the architecture in ecosystem that lives below it.", "start": 682.577, "speaker": "Keith"}, {"confidence": 0.91, "end": 693.446, "track": 1, "text": "Compute you're being probably the most,", "newpara": true, "start": 690.088, "speaker": "Keith"}, {"confidence": 0.93, "end": 705.447, "track": 1, "text": "your fundamental one that everybody thinks about and your computer I say that specifically because you have a standard CPU with eyes and Coors.", "start": 693.471, "speaker": "Keith"}, {"confidence": 0.97, "end": 709.773, "track": 1, "text": "You also now have the rise of video.", "start": 705.687, "speaker": "Keith"}, {"confidence": 0.89, "end": 715.83, "track": 1, "text": "GPS Otherwise Known ask where you now have the ability to use video cards.", "start": 709.96, "speaker": "Keith"}, {"confidence": 0.88, "end": 724.802, "track": 1, "text": "With you know a very limited capability and I'm not knocking them there their they're not really great at doing a lot.", "start": 715.975, "speaker": "Keith"}, {"confidence": 0.94, "end": 737.415, "track": 1, "text": "But they can do a lot with a little and just to give you an idea of what a magnitude which is why we're starting to see GPS take off so if I have a top-of-the-line.", "start": 725.133, "speaker": "Keith"}, {"confidence": 0.8, "end": 746.242, "track": 1, "text": "2 cor 30 North to die 36 core machine out of.", "start": 737.728, "speaker": "Keith"}, {"confidence": 0.81, "end": 749.818, "track": 1, "text": "That will give me 72.", "start": 746.777, "speaker": "Keith"}, {"confidence": 0.88, "end": 759.588, "track": 1, "text": "If I take two GPU standard video card.", "newpara": true, "start": 751.248, "speaker": "Keith"}, {"confidence": 0.87, "end": 765.766, "track": 0, "text": "You can't you can't get you can't get the Cinnabons anymore buddy she's going for Bitcoin miners you got to buy the high-end ones.", "newpara": true, "start": 759.288, "speaker": "Cory"}, {"confidence": 0.91, "end": 772.189, "track": 1, "text": "Very true and so from that standpoint to gpus.", "newpara": true, "start": 766.199, "speaker": "Keith"}, {"confidence": 0.95, "end": 783.144, "track": 1, "text": "Will deliver you and the master everybody's got two different math but it's very easy to go in and back into it about 344,000 concurrent processing.", "start": 772.52, "speaker": "Keith"}, {"confidence": 0.91, "end": 789.477, "track": 1, "text": "Out of two GPU cars and so you know what you're seeing is.", "start": 783.439, "speaker": "Keith"}, {"confidence": 0.94, "end": 802.848, "track": 1, "text": "Really went when you broke down and sort of some of the libraries that you'll see out there they're still very very Taylor to compute which is there's nothing wrong with that it's just a different model and a different approach.", "start": 790.421, "speaker": "Keith"}, {"confidence": 0.94, "end": 806.032, "track": 1, "text": "A lot of what we're seeing on the HPC side.", "start": 803.197, "speaker": "Keith"}, {"confidence": 0.92, "end": 819.841, "track": 1, "text": "And I expect at some point you will start to see it sort of bleed back into the Dukan sparklier lot more just because the sheer power ratio of a footprint of two gpus that can deliver 344,000 connections is just unheard of.", "start": 806.477, "speaker": "Keith"}, {"confidence": 0.97, "end": 827.052, "track": 1, "text": "But you know what you're able to then do is take a standard model.", "start": 820.274, "speaker": "Keith"}, {"confidence": 0.91, "end": 830.79, "track": 1, "text": "And break it into really fine component.", "start": 827.377, "speaker": "Keith"}, {"confidence": 0.93, "end": 838.457, "track": 1, "text": "And so in a really that sort of the difference of what we're seeing now with you know sort of those you look at it from an architecture for.", "start": 831.259, "speaker": "Keith"}, {"confidence": 0.93, "end": 850.277, "track": 1, "text": "You know what I'm going to throw I do work load out there I'm going to throw machine learning or deep learning job on it I know the resources in the classroom I know the storage in the cluster I know the fan with him.", "start": 839.197, "speaker": "Keith"}, {"confidence": 0.9, "end": 861.797, "track": 1, "text": "And so that sort of a fixed capacity and you know it it's a little more in the Box nothing I do with it.", "start": 850.999, "speaker": "Keith"}, {"confidence": 0.89, "end": 871.615, "track": 1, "text": "What were saying with some of the HPC side is it actually can be dialed up and dial down and well that sounds weird,", "newpara": true, "start": 862.392, "speaker": "Keith"}, {"confidence": 0.95, "end": 881.122, "track": 1, "text": "you know as you go to build some of these models you can intentionally amplify the effect of what I mean by that is if I want to put in a series of texts.", "start": 871.676, "speaker": "Keith"}, {"confidence": 0.92, "end": 886.091, "track": 1, "text": "There are ways that I can build a model to actually make the output size 10 x.", "start": 881.254, "speaker": "Keith"}, {"confidence": 0.89, "end": 898.055, "track": 1, "text": "So I truly will allow me find a granularity same thing can be done with a picture so I can actually blow it up or I can shrink it so there's ways I can actually say subsampling is the official time.", "start": 886.272, "speaker": "Keith"}, {"confidence": 0.93, "end": 905.705, "track": 1, "text": "And the way you do it is to padding and so you know what we're seeing is you have the ability with the computer.", "start": 898.711, "speaker": "Keith"}, {"confidence": 0.9, "end": 919.826, "track": 1, "text": "And the multiple tiers now with this massive ability with very small cost me to Jeep used in the grand scheme of things is not a lot of money I mean especially the Bitcoin miner.", "start": 905.946, "speaker": "Keith"}, {"confidence": 0.96, "end": 926.003, "track": 1, "text": "They're not a lot of money and so what we're starting to see is you know you could have a rack.", "start": 919.935, "speaker": "Keith"}, {"confidence": 0.84, "end": 935.348, "track": 1, "text": "You know very very new servers with each of them having to or for\nNVIDIA cards item.", "start": 926.28, "speaker": "Keith"}, {"confidence": 0.97, "end": 939.812, "track": 1, "text": "And you can do a whole lot of damage.", "start": 935.805, "speaker": "Keith"}, {"confidence": 0.93, "end": 948.543, "track": 0, "text": "Network is key the other one is you can do a whole lot of damage to your power supplies.", "newpara": true, "start": 940.041, "speaker": "Cory"}, {"confidence": 0.9, "end": 958.254, "track": 0, "text": "And does gpus are power suckers actually one thing that's interesting I've seen a lot of work at the team from Google brain.", "newpara": true, "start": 948.796, "speaker": "Cory"}, {"confidence": 0.92, "end": 969.359, "track": 0, "text": "Outlined a bunch of there out there out there pick another year in review 2017 one thing I know is they talked a lot about the tensorflow of the TPU Evolution and kind of the tensor flow cloud.", "start": 958.375, "speaker": "Cory"}, {"confidence": 0.89, "end": 977.399, "track": 0, "text": "What are your thoughts on those purpose-built Asics things like you know purpose of a 6ft GA in context of machine learning and deep-learning.", "start": 969.377, "speaker": "Cory"}, {"confidence": 0.97, "end": 989.97, "track": 1, "text": "So let me be very very you know specific it's you know we have today everybody refers to GPU which is a single product from a single manufacturer.", "newpara": true, "start": 977.988, "speaker": "Keith"}, {"confidence": 0.97, "end": 999.338, "track": 1, "text": "Make no mistake that that is not lost on every applicator out there so your point now Google has a TPU.", "newpara": true, "start": 991.647, "speaker": "Keith"}, {"confidence": 0.96, "end": 1009.139, "track": 1, "text": "I cannot say what I know but I'm aware that the competition are coming out with their own so you know yes we call it Kleenex.", "start": 1000.144, "speaker": "Keith"}, {"confidence": 0.84, "end": 1012.276, "track": 1, "text": "Hey you know Kleenex even if we meet at issue.", "start": 1009.464, "speaker": "Keith"}, {"confidence": 0.92, "end": 1026.427, "track": 1, "text": "So you know how much lead over we have between there will be a series of specific you know a 6in and graphic accelerators and different types of cards coming out.", "start": 1012.577, "speaker": "Keith"}, {"confidence": 0.91, "end": 1034.389, "track": 1, "text": "All of them solving the same purpose at some point I think we'll probably need to come up with some consistency and commoditization across them.", "start": 1026.764, "speaker": "Keith"}, {"confidence": 0.84, "end": 1041.991, "track": 1, "text": "As far as language is across New York tool kits and you know whether it's Centerfolds in the others there will have to be a reckoning.", "start": 1034.528, "speaker": "Keith"}, {"confidence": 0.85, "end": 1049.682, "track": 1, "text": "But I think you know definitely in the space there will be a lot of competition\nwho are the specialist yet because.", "start": 1042.165, "speaker": "Keith"}, {"confidence": 0.95, "end": 1055.968, "track": 1, "text": "Besides Bitcoin Mike we are starting to see a lot of interest and know that.", "start": 1050.193, "speaker": "Keith"}, {"confidence": 0.9, "end": 1066.562, "track": 1, "text": "Massively parallel and you actually the proper term is embarrassing though which is actually the second North text to tenant which is you know if I dial up with padding Rye down.", "start": 1056.19, "speaker": "Keith"}, {"confidence": 0.88, "end": 1074.121, "track": 1, "text": "Whatever I do with a picture I love examples because.", "start": 1066.971, "speaker": "Keith"}, {"confidence": 0.94, "end": 1077.126, "track": 1, "text": "So let's pick out of the.", "start": 1074.494, "speaker": "Keith"}, {"confidence": 0.92, "end": 1090.916, "track": 1, "text": "Automated Dragon that's one of these cases I think I get a lot of questions about and for the record I do not believe in autonomous driving cuz I think that will stay in court for the probably the next decade and really from the whole idea of.", "start": 1077.535, "speaker": "Keith"}, {"confidence": 0.9, "end": 1099.954, "track": 1, "text": "It'll probably take the court to figure out what happens between whether I hit that brick wall or hit a person\nbecause you know.", "newpara": true, "start": 1091.127, "speaker": "Keith"}, {"confidence": 0.92, "end": 1108.607, "track": 0, "text": "Yeah we talked about that day the ethical questions around automatic autonomous-driving is an interesting one and it's one of those that you almost wonder.", "newpara": true, "start": 1099.654, "speaker": "Cory"}, {"confidence": 0.96, "end": 1120.199, "track": 0, "text": "Does the underlined ethical decisions that have been made in the models does it have to be something that is clearly exposed to the buyer because that example you just said is one I've used,", "start": 1108.644, "speaker": "Cory"}, {"confidence": 0.89, "end": 1128.659, "track": 0, "text": "with who had a conversation with CTO hortonworks and said the question like shouldn't I know if whichever brand I choose.", "start": 1119.941, "speaker": "Cory"}, {"confidence": 0.75, "end": 1132.421, "track": 0, "text": "Is either going to kill the dump smoked behind-the-wheel or Key Largo.", "start": 1128.636, "speaker": "Cory"}, {"confidence": 0.92, "end": 1143.171, "track": 0, "text": "Or is going to allow me to living take out the pedestrian like shouldn't I as a consumer know which decisions were made or is that something that the government should be mandated for me.", "start": 1132.403, "speaker": "Cory"}, {"confidence": 0.97, "end": 1146.17, "track": 1, "text": "That's a great question that is a fabulous question.", "newpara": true, "start": 1142.871, "speaker": "Keith"}, {"confidence": 0.9, "end": 1156.553, "track": 3, "text": "Yeah yeah yeah I'm shocked it already we haven't even had a you know a self-driving car out there and production so to speak and they're already talking about taking the steering wheel off in like.", "newpara": true, "start": 1146.272, "speaker": "Brett"}, {"confidence": 0.87, "end": 1164.54, "track": 3, "text": "What 20-20 or some like that it's pretty close to being it has pretty kinds of it will be good enough to have no steering wheel no accelerator no break.", "newpara": true, "start": 1156.458, "speaker": "Brett"}, {"confidence": 0.92, "end": 1176.323, "track": 3, "text": "3 years or two years down the road at this point so Keith I agree with you I think that this is a it's a little bit further down the road then what everyone stay with the self-driving cars but I do have one question for you.", "newpara": true, "start": 1164.468, "speaker": "Brett"}, {"confidence": 0.9, "end": 1187.008, "track": 3, "text": "We we talked about how we're now in this deep learning spring and winter has come and gone and there were some constraints compute data that cause the.", "newpara": true, "start": 1176.684, "speaker": "Brett"}, {"confidence": 0.93, "end": 1193.119, "track": 3, "text": "But I guess the peaks in Winter right in the past what do you think the the next constraint will be too kind of.", "newpara": true, "start": 1187.038, "speaker": "Brett"}, {"confidence": 0.92, "end": 1199.416, "track": 3, "text": "You know progress or keep us from going or no evolving even more with you learning is it a.", "newpara": true, "start": 1193.107, "speaker": "Brett"}, {"confidence": 0.86, "end": 1203.178, "track": 3, "text": "Power problem is a cooling problem with G fuse what what do what do you think that is.", "newpara": true, "start": 1199.477, "speaker": "Brett"}, {"confidence": 0.96, "end": 1214.878, "track": 1, "text": "I honestly think all of those are issues you know the bigger issue to me and so you know which is actually the reason why I wrote The Blog.", "newpara": true, "start": 1204.909, "speaker": "Keith"}, {"confidence": 0.98, "end": 1223.459, "track": 1, "text": "It's where I spend most of my time is when you look at I want to build a model.", "start": 1215.076, "speaker": "Keith"}, {"confidence": 0.85, "end": 1229.72, "track": 1, "text": "There's probably you know probably a hundred really Great Courses about how to do a test from.", "start": 1223.783, "speaker": "Keith"}, {"confidence": 0.97, "end": 1239.142, "track": 1, "text": "I want if I want to look at how do I you know code Cuda.", "start": 1230.706, "speaker": "Keith"}, {"confidence": 0.97, "end": 1245.458, "track": 1, "text": "There's no real great dialogue going on in the industry today.", "start": 1239.822, "speaker": "Keith"}, {"confidence": 0.98, "end": 1250.944, "track": 1, "text": "About how do you look at your network.", "start": 1246.516, "speaker": "Keith"}, {"confidence": 0.96, "end": 1259.237, "track": 1, "text": "What types of architecture do you need to build to handle this what are the storage requirements to be able to feed a model.", "start": 1251.341, "speaker": "Keith"}, {"confidence": 0.93, "end": 1265.173, "track": 1, "text": "How do you know when you know you have a bottleneck and what is your Jeep you doing.", "start": 1259.561, "speaker": "Keith"}, {"confidence": 0.87, "end": 1273.748, "track": 1, "text": "What are your wet where is the slow wall clock and we have all those tools in a lot of the existing structures in a lot of.", "start": 1265.498, "speaker": "Keith"}, {"confidence": 0.96, "end": 1280.635, "track": 1, "text": "Work has been done in Prior generations to put those pieces together but today there's not really that conversation.", "start": 1274.217, "speaker": "Keith"}, {"confidence": 0.94, "end": 1289.714, "track": 1, "text": "And so you know back to really I think the biggest challenge is just we need to have an open dialogue about what are the impacts of different model,", "start": 1280.81, "speaker": "Keith"}, {"confidence": 0.93, "end": 1304.322, "track": 1, "text": "how do you build a how do you account for those in your network how do you handle know the the scale of what your developer might do and if Sam and network Tech score storage person or infrastructure.", "start": 1289.811, "speaker": "Keith"}, {"confidence": 0.99, "end": 1310.001, "track": 1, "text": "And I don't really understand the math behind what he's trying to do.", "newpara": true, "start": 1304.798, "speaker": "Keith"}, {"confidence": 0.85, "end": 1318.071, "track": 1, "text": "It's not hard to crush a networker crush to order question few we have the capabilities that are available today and say in Spanish.", "start": 1310.602, "speaker": "Keith"}, {"confidence": 0.95, "end": 1325.889, "track": 1, "text": "So I think that's to me you know the big challenges we need to have a really good dialogue about how do we scale this.", "start": 1318.751, "speaker": "Keith"}, {"confidence": 0.93, "end": 1334.782, "track": 0, "text": "So so on that one question today so you said you can crush a networking Crush storage and I want to go back to the embarrassing parallel thing and suck a butt.", "newpara": true, "start": 1325.823, "speaker": "Cory"}, {"confidence": 0.92, "end": 1342.468, "track": 0, "text": "How how how are you seeing people assess that because that that to me feels like one of those big gaps if I'm a systems engineer,", "start": 1334.669, "speaker": "Cory"}, {"confidence": 0.87, "end": 1346.674, "track": 0, "text": "or an arkitektura data engineer and I'm having a conversation with.", "start": 1342.493, "speaker": "Cory"}, {"confidence": 0.89, "end": 1356.109, "track": 0, "text": "You know I CIA operations teams or even a cloud provider where I'm going to buy the stuff as a service what do you start to know like what.", "start": 1346.537, "speaker": "Cory"}, {"confidence": 0.94, "end": 1364.996, "track": 0, "text": "You need or how do you know that what system you maybe have already built whether to do based or something else.", "newpara": true, "start": 1356.338, "speaker": "Cory"}, {"confidence": 0.96, "end": 1375.662, "track": 0, "text": "Are do you know of ways that are that are good assessments of this is our problem this is where we should invest in terms of all we have a network problem we have a storage problem we have a computer.", "start": 1364.864, "speaker": "Cory"}, {"confidence": 0.95, "end": 1390.739, "track": 1, "text": "Not today and that's part of why I started the conversation and Lily where I'm I spend a lot of time actually helping folks to understand what they won't even do.", "newpara": true, "start": 1376.083, "speaker": "Keith"}, {"confidence": 0.96, "end": 1399.001, "track": 1, "text": "You know because it's I think a lot of folks we're still in the growing phase.", "newpara": true, "start": 1392.5, "speaker": "Keith"}, {"confidence": 0.87, "end": 1407.642, "track": 1, "text": "The bleeding Edge's is started to adopt it and get a production that leading-edge you know so probably like 2 to 5%.", "start": 1399.284, "speaker": "Keith"}, {"confidence": 0.97, "end": 1411.176, "track": 1, "text": "Are now starting to kick the tires and put it in life.", "start": 1408.37, "speaker": "Keith"}, {"confidence": 0.91, "end": 1423.537, "track": 1, "text": "And so International point we don't have a lot of the capabilities and in understanding out there and so that's sort of where I'm pushing you know is we need to start that conversation.", "start": 1411.633, "speaker": "Keith"}, {"confidence": 0.9, "end": 1431.474, "track": 1, "text": "Even your otherwise it's going to be a quick migration in the fall because we're headed home structures can be.", "start": 1423.831, "speaker": "Keith"}, {"confidence": 0.78, "end": 1434.389, "track": 1, "text": "Yes because we just blew up his Data Center.", "start": 1431.841, "speaker": "Keith"}, {"confidence": 0.94, "end": 1446.858, "track": 1, "text": "Or you know we need to have a way that this becomes Evergreen and continues to grow and to those you know that sort of the conversation we need to have we just what is the impact of running you know.", "start": 1434.696, "speaker": "Keith"}, {"confidence": 0.9, "end": 1454.754, "track": 1, "text": "Convolutional neural network on Allied Arctic or something is coming out of an 8 oz you know what is the impact.", "start": 1447.153, "speaker": "Keith"}, {"confidence": 0.96, "end": 1468.707, "track": 1, "text": "And that's sort of the conversation that's not being had you know and really I think what we need to do is there needs to be cooling but there needs to be a conversation about how does this really work cuz I think that even if you Google it you don't get a really good answer.", "start": 1455.349, "speaker": "Keith"}, {"confidence": 0.89, "end": 1480.436, "track": 2, "text": "Hey Keith so add to sing you know it's it's huge on the fringes it's it's a it's growing but what do you see being the tools that.", "newpara": true, "start": 1470.582, "speaker": "Kyle"}, {"confidence": 0.92, "end": 1484.354, "track": 2, "text": "Machine learning and deep-learning will standardize on so so what.", "newpara": true, "start": 1480.311, "speaker": "Kyle"}, {"confidence": 0.92, "end": 1492.232, "track": 2, "text": "Companies what applications do you see companies starting to use machine learning and deep-learning to achieve this mix success out of.", "newpara": true, "start": 1484.547, "speaker": "Kyle"}, {"confidence": 0.96, "end": 1503.211, "track": 1, "text": "So it's interesting is in almost every\nconversation I've had to date no one really wants to standard on a sink.", "newpara": true, "start": 1493.915, "speaker": "Keith"}, {"confidence": 0.95, "end": 1509.52, "track": 1, "text": "And the reason why is certain libraries within certain models have stronger string.", "start": 1503.668, "speaker": "Keith"}, {"confidence": 0.95, "end": 1513.835, "track": 1, "text": "Tensorflow is pretty much guaranteed to be in everybody.", "newpara": true, "start": 1510.723, "speaker": "Keith"}, {"confidence": 0.93, "end": 1523.281, "track": 1, "text": "It is the one that probably is the most referenced used tested driven.", "start": 1514.592, "speaker": "Keith"}, {"confidence": 0.95, "end": 1529.579, "track": 1, "text": "We see there are some reasons why people would want to use Cafe.", "start": 1523.738, "speaker": "Keith"}, {"confidence": 0.97, "end": 1536.97, "track": 1, "text": "It tends to have some interesting features around some of the computer vision problems or image recognition that people tend to like,", "start": 1530.126, "speaker": "Keith"}, {"confidence": 0.93, "end": 1545.599, "track": 1, "text": "there's some other libraries Harkins copia and Tiana 10 to go really really well when people are doing a lot of natural language processing.", "start": 1536.982, "speaker": "Keith"}, {"confidence": 0.91, "end": 1555.688, "track": 1, "text": "So what I what I seen in almost every one of my conversations is the golden stand up in architecture that they could deploy any of those on the same architecture.", "start": 1545.96, "speaker": "Keith"}, {"confidence": 0.58, "end": 1565.657, "track": 1, "text": "And have any of those would just be stools within an ecosystem that was live on a set of architecture\nbe president.", "start": 1555.941, "speaker": "Keith"}, {"confidence": 0.9, "end": 1571.288, "track": 1, "text": "So far it's proving to be adorable feet so you know.", "newpara": true, "start": 1567.628, "speaker": "Keith"}, {"confidence": 0.94, "end": 1586.016, "track": 1, "text": "I would say tensorflow is almost guaranteed to be there and everybody's Arsenal and then you usually have a few more in there and then a name some of them there's probably always there's going to be like if you're meeting entertainment there's a couple specialized ones within the media and entertainment industry.", "start": 1571.456, "speaker": "Keith"}, {"confidence": 0.94, "end": 1596.766, "track": 1, "text": "I expect we will start to see some you know bespoke ones come out because we're starting to see a lot of people open source some of their toolkit so I think we'll start to see some more tokens.", "start": 1586.473, "speaker": "Keith"}, {"confidence": 0.87, "end": 1604.175, "track": 1, "text": "Mia from now there's going to be a frost in a proliferation weather that collapses at some point it is.", "start": 1597.494, "speaker": "Keith"}, {"confidence": 0.93, "end": 1610.016, "track": 0, "text": "So let me ask a dumb question what's the difference between a library and a defining framework.", "newpara": true, "start": 1605.107, "speaker": "Cory"}, {"confidence": 0.88, "end": 1615.34, "track": 1, "text": "So a framework would be sort of how it work.", "newpara": true, "start": 1610.924, "speaker": "Keith"}, {"confidence": 0.95, "end": 1624.984, "track": 1, "text": "So the ability for me to spin up a tensorflow and run a model comes with its own Library.", "start": 1615.971, "speaker": "Keith"}, {"confidence": 0.88, "end": 1635.705, "track": 1, "text": "So there are specific libraries within tensorflow that allow oil in if you use cameras which is another higher level API you can actually go in and.", "start": 1625.37, "speaker": "Keith"}, {"confidence": 0.98, "end": 1638.475, "track": 1, "text": "Dial specific features.", "start": 1636.036, "speaker": "Keith"}, {"confidence": 0.91, "end": 1647.795, "track": 1, "text": "And so you know within there you'll have a lot of the same models there might be some specific permutations to those.", "start": 1638.716, "speaker": "Keith"}, {"confidence": 0.93, "end": 1656.815, "track": 1, "text": "And some cases it actually makes reference to external libraries so you know great example is most of the deep learning is very very python Center.", "start": 1648.072, "speaker": "Keith"}, {"confidence": 0.97, "end": 1668.49, "track": 1, "text": "They take advantage of some of the tools like numpy and pandas and others out there so you know you've got this Rich ecosystem so it while tensorflow would be the framework on which you run.", "start": 1657.176, "speaker": "Keith"}, {"confidence": 0.93, "end": 1674.638, "track": 1, "text": "You might actually be referencing a particular elements within their,", "start": 1669.146, "speaker": "Keith"}, {"confidence": 0.89, "end": 1686.788, "track": 1, "text": "Rama turn umpires or sklearn inside Pike or you know something straight out of intention flow itself so it's,", "start": 1674.554, "speaker": "Keith"}, {"confidence": 0.84, "end": 1691.253, "track": 1, "text": "mango together not in a bad way but yeah they're they're sort of high dependency.", "start": 1686.662, "speaker": "Keith"}, {"confidence": 0.94, "end": 1696.06, "track": 0, "text": "So you went through Canada the three,", "newpara": true, "start": 1692.407, "speaker": "Cory"}, {"confidence": 0.94, "end": 1715.505, "track": 0, "text": "Baseline components are architectural tenants really good durable storage that's embarrassing embarrassing the parallel high-bandwidth which we get you going to design that right compute its it might not be GPU vs. CPU as much as it is a mix of some depended upon the models in the libraries than you've got the Frameworks which kind of,", "start": 1695.904, "speaker": "Cory"}, {"confidence": 0.96, "end": 1717.536, "track": 0, "text": "seem to be varied,", "start": 1715.38, "speaker": "Cory"}, {"confidence": 0.91, "end": 1731.483, "track": 0, "text": "at the very least she said growing probably a little bit of frothing which I love that concept as you talked about those Frameworks and those bespoke tools coexisting and cohabitating.", "start": 1717.573, "speaker": "Cory"}, {"confidence": 0.94, "end": 1747.642, "track": 0, "text": "On top of that underline architecture and what you need there is you need some sort of a management and orchestration set of tools and you listed out of handful that I think there are interesting and I want to I want to help understand like how important is that,", "start": 1731.412, "speaker": "Cory"}, {"confidence": 0.92, "end": 1751.001, "track": 0, "text": "m&o stock in the Deep learning constructs.", "start": 1747.45, "speaker": "Cory"}, {"confidence": 0.93, "end": 1759.696, "track": 1, "text": "Critical\nand from that standpoint it also drives even deeper sort of architectural.", "newpara": true, "start": 1751.879, "speaker": "Keith"}, {"confidence": 0.98, "end": 1764.587, "track": 1, "text": "And what I mean by that is so I'd say the top,", "newpara": true, "start": 1761.733, "speaker": "Keith"}, {"confidence": 0.96, "end": 1771.864, "track": 1, "text": "you know a couple that we see as far as you know the management layer which really you know,", "start": 1764.528, "speaker": "Keith"}, {"confidence": 0.92, "end": 1781.887, "track": 1, "text": "so tensorflow would just be a framework within their Tiana would be a framework and then how you schedule a job you know if you were working with an I do.", "start": 1771.895, "speaker": "Keith"}, {"confidence": 0.95, "end": 1790.709, "track": 1, "text": "Kubernetes is certainly one that I would say is probably got the hottest flame right now as far as a management.", "start": 1782.068, "speaker": "Keith"}, {"confidence": 0.84, "end": 1799.903, "track": 1, "text": "Capability misses is right behind that so me so severe and sort of that approach there's blue data which is you know a.", "start": 1791.028, "speaker": "Keith"}, {"confidence": 0.89, "end": 1810.454, "track": 1, "text": "Start up that hill we partner with corporate leak where are you can do your very similar types of interest is all three of those were lying a container.", "start": 1800.63, "speaker": "Keith"}, {"confidence": 0.91, "end": 1819.973, "track": 1, "text": "So here you are with a doctor or PCOS or some form of a container which of course now if you're in a stateless container model.", "newpara": true, "start": 1811.975, "speaker": "Keith"}, {"confidence": 0.91, "end": 1824.438, "track": 1, "text": "Ability to bridge to state for storage or.", "start": 1820.334, "speaker": "Keith"}, {"confidence": 0.89, "end": 1834.966, "track": 1, "text": "Overwhelm your containers with you know 10 million images of storage which is really going to blow out your Datacenter really makes it sort of an action challenge.", "start": 1824.763, "speaker": "Keith"}, {"confidence": 0.95, "end": 1844.298, "track": 1, "text": "It's now really that the number one thing we're starting to see is containerize tensorflow at scale using one of those management.", "start": 1835.08, "speaker": "Keith"}, {"confidence": 0.91, "end": 1856.664, "track": 0, "text": "So I guess the other one we're saying to as you started to say that the the lines are blurring a bit between what we are more traditional Hadoop Centric.", "newpara": true, "start": 1844.737, "speaker": "Cory"}, {"confidence": 0.92, "end": 1862.517, "track": 0, "text": "Orchestration tools something like spark cluster manager yarn as you said or even in the Big Data space.", "newpara": true, "start": 1857.043, "speaker": "Cory"}, {"confidence": 0.93, "end": 1878.706, "track": 0, "text": "Then you're getting into the sort of container Cloud organization and kubernetes me subscribe Docker and those worlds are colliding right cuz Jimmy need to look at even things like horn Works HDPE 300 integration with containers like all that stuff all that's a convoy confluence,", "newpara": true, "start": 1862.752, "speaker": "Cory"}, {"confidence": 0.97, "end": 1886.956, "track": 0, "text": "now you look at then oh my gosh we also have to include the the HPC environment so things like bright cluster manager are.", "start": 1878.526, "speaker": "Cory"}, {"confidence": 0.83, "end": 1895.411, "track": 0, "text": "I honestly like in my time I see like professionally I see them in as many of these conversations as any of the.", "start": 1886.944, "speaker": "Cory"}, {"confidence": 0.92, "end": 1897.604, "track": 0, "text": "Big data plans are you seeing the same thing.", "start": 1895.321, "speaker": "Cory"}, {"confidence": 0.87, "end": 1909.063, "track": 1, "text": "Absolutely and so you know what we're seeing is HPC use of NFS storage war in deep learning.", "newpara": true, "start": 1898.554, "speaker": "Keith"}, {"confidence": 0.89, "end": 1913.738, "track": 1, "text": "Those are new protocols\nsome ways for Back to the Future.", "start": 1909.983, "speaker": "Keith"}, {"confidence": 0.96, "end": 1920.607, "track": 1, "text": "Because really you know sort of neural Nets had their previous High Point in the 90s.", "start": 1914.123, "speaker": "Keith"}, {"confidence": 0.92, "end": 1931.723, "track": 1, "text": "And then you know we sort of went all in a different way and then yell McCune and some of the others actually cracked the math problem.", "newpara": true, "start": 1922.242, "speaker": "Keith"}, {"confidence": 0.91, "end": 1940.262, "track": 1, "text": "That you're really had limited neural networks back in the day and that work weeks one completely back to sort of the HBC contra.", "start": 1932.097, "speaker": "Keith"}, {"confidence": 0.89, "end": 1944.319, "track": 1, "text": "But a lot of the players that have been in use for the HPC space.", "start": 1940.413, "speaker": "Keith"}, {"confidence": 0.94, "end": 1955.321, "track": 1, "text": "Continue to move from your migrate along so yeah they they move right into the deep learning as well because again they were there an HBCU before you know tensorflow is even a dream and Mama's I.", "start": 1944.613, "speaker": "Keith"}, {"confidence": 0.83, "end": 1963.692, "track": 1, "text": "And so you know a lot of sort of those seen her traditional how am I going to manage\n10000 core.", "start": 1955.682, "speaker": "Keith"}, {"confidence": 0.83, "end": 1973.378, "track": 1, "text": "However Mini Storage\nhowever many Lunds managing you know under the computer for Scratch and spell space.", "start": 1964.089, "speaker": "Keith"}, {"confidence": 0.84, "end": 1980.698, "track": 1, "text": "And ability to you know reboot and handle that amount of cluster requires some form of a command and control.", "start": 1973.836, "speaker": "Keith"}, {"confidence": 0.89, "end": 1990.011, "track": 1, "text": "And bright and some of the others you know what I feel the command control space would really you know so for Brunetti's hidden,", "start": 1981.071, "speaker": "Keith"}, {"confidence": 0.97, "end": 1991.243, "track": 1, "text": "but you know,", "start": 1990.006, "speaker": "Keith"}, {"confidence": 0.89, "end": 2002.931, "track": 1, "text": "you've got sort of this how am I going to come in to control you know serious or of 10 to be able to reboot it or no it's down here what's my alerting if I lose in there.", "start": 1991.238, "speaker": "Keith"}, {"confidence": 0.95, "end": 2010.052, "track": 1, "text": "And so that sort of that you've got all of sort of the the scale problems that you know.", "start": 2003.49, "speaker": "Keith"}, {"confidence": 0.9, "end": 2021.403, "track": 1, "text": "Short of solve in Hadoop one way or service Ogden HPC and other way that's what it what we're seeing is in those residuals are still caring for cuz they're still need it and now you just problem or tools on top.", "start": 2010.671, "speaker": "Keith"}, {"confidence": 0.93, "end": 2031.522, "track": 0, "text": "So if you were so if you're sitting in front of a customer and let's say they're not one of these bleeding edge is already having production and there maybe they're Leading Edge in there in the labs,", "newpara": true, "start": 2021.319, "speaker": "Cory"}, {"confidence": 0.94, "end": 2039.076, "track": 0, "text": "and somebody came and said Keith look we want your professional opinion what do you think the right way to build something.", "start": 2031.318, "speaker": "Cory"}, {"confidence": 0.94, "end": 2053.6, "track": 0, "text": "To meet the what we were like you said right was going to be a growing shifting, juxtaposing set of requirements is going to be what are some of the best practices that you're advising you know folks in industry.", "start": 2039.07, "speaker": "Cory"}, {"confidence": 0.93, "end": 2058.244, "track": 0, "text": "Architecture what should they be looking at what should they be using as.", "start": 2053.732, "speaker": "Cory"}, {"confidence": 0.96, "end": 2066.405, "track": 0, "text": "Very practical things to do today to build deep learning environments that will be useful both now and in the near-term.", "start": 2058.317, "speaker": "Cory"}, {"confidence": 0.92, "end": 2071.831, "track": 1, "text": "Great question and it's the same advice I gave when.", "newpara": true, "start": 2067.169, "speaker": "Keith"}, {"confidence": 0.86, "end": 2077.678, "track": 1, "text": "I do pussy\nso you know.", "start": 2072.456, "speaker": "Keith"}, {"confidence": 0.91, "end": 2090.129, "track": 1, "text": "I'm in a number of conversations actively right now\nMurray's that are looking to do plc's the first thing I help them do a sake great let's not try to boil the ocean.", "start": 2078.105, "speaker": "Keith"}, {"confidence": 0.94, "end": 2102.159, "track": 1, "text": "And and you know one of the active conversations I have going on where I'll be in in an in-depth conversation next week we're literally going to go down and pick a few specific use cases.", "start": 2090.628, "speaker": "Keith"}, {"confidence": 0.93, "end": 2112.014, "track": 1, "text": "Not only are we going to pick a few specific use cases we're actually going to look at what would the architectural impact of those be,", "start": 2102.808, "speaker": "Keith"}, {"confidence": 0.92, "end": 2119.903, "track": 1, "text": "and so in one of those cases you know an image recognition problem computer vision and no that is not teaching computer to.", "start": 2112.092, "speaker": "Keith"}, {"confidence": 0.92, "end": 2124.591, "track": 1, "text": "Like when I get but it is.", "newpara": true, "start": 2121.454, "speaker": "Keith"}, {"confidence": 0.94, "end": 2136.988, "track": 1, "text": "Text recognition picture recognition the ability to do you know that type of a scenario and sew in a back to sort of the math.", "start": 2125.15, "speaker": "Keith"}, {"confidence": 0.79, "end": 2145.358, "track": 1, "text": "Take a 16 cake picture\nthat has 132 million pixels\nabout a gigabyte of storage.", "start": 2137.571, "speaker": "Keith"}, {"confidence": 0.89, "end": 2151.974, "track": 1, "text": "Want to CNN so a convolution neural network that will fire 132 million thread.", "start": 2146.079, "speaker": "Keith"}, {"confidence": 0.86, "end": 2159.269, "track": 1, "text": "So one can your storage handle a hundred 32 million concurrent.", "newpara": true, "start": 2155.021, "speaker": "Keith"}, {"confidence": 0.87, "end": 2169.436, "track": 1, "text": "To do you have a 132 million concurrent processes that you're capable to feel like it'll handle it and sort of a waterfall as it fills up but you know.", "start": 2159.907, "speaker": "Keith"}, {"confidence": 0.93, "end": 2179.388, "track": 1, "text": "Think through the ramifications so if we're going to do a PSA let's figure out what picture size with the POC do we have to be able to not crush the info.", "start": 2170.296, "speaker": "Keith"}, {"confidence": 0.93, "end": 2191.94, "track": 1, "text": "And so you know it is sort of a crawl walk run approach which is you let's figure out what it is you want to do let's make sure the math behind the model will support.", "start": 2179.749, "speaker": "Keith"}, {"confidence": 0.9, "end": 2199.506, "track": 1, "text": "But that way they can start to get comfortable with you let's run one more time and understand what that does to your neck.", "start": 2192.98, "speaker": "Keith"}, {"confidence": 0.91, "end": 2209.655, "track": 1, "text": "Understand what that does to restore to understand one of that does to computer where are the latency in the bottlenecks how can you tell if your gpus are busy or not.", "start": 2199.843, "speaker": "Keith"}, {"confidence": 0.96, "end": 2219.348, "track": 1, "text": "How can you tell if your computer's busy or not busy where is the wall clock weight and so what we're doing is just a very very scientific very very from the basics approach,", "start": 2209.908, "speaker": "Keith"}, {"confidence": 0.94, "end": 2223.35, "track": 1, "text": "we're doing it with active real use cases that meet the customer.", "start": 2219.288, "speaker": "Keith"}, {"confidence": 0.93, "end": 2236.852, "track": 1, "text": "So short of help building it up you know I'd say the biggest thing I seen that really causes a lot of drama customers are they want they run a PLC I think it's really good then they deploy and say run all these 80 theme song.", "start": 2223.53, "speaker": "Keith"}, {"confidence": 0.93, "end": 2248.816, "track": 0, "text": "So one thing I want to want to dig into is you working in an organization within Dell EMC that has some interesting products.", "newpara": true, "start": 2238.457, "speaker": "Cory"}, {"confidence": 0.88, "end": 2256.97, "track": 0, "text": "That they really feeling interesting space in one of those four key components are tenants architectural e.", "start": 2248.913, "speaker": "Cory"}, {"confidence": 0.94, "end": 2260.372, "track": 0, "text": "That we talked about and that's the concept of durable storage that can handle,", "start": 2256.827, "speaker": "Cory"}, {"confidence": 0.96, "end": 2273.285, "track": 0, "text": "high-bandwidth embarrassing a parallel so help me understand this this product that you you and your team are out talking about the market and selling what is it and how does it fit in the context of this architecture.", "start": 2260.402, "speaker": "Cory"}, {"confidence": 0.92, "end": 2283.092, "track": 1, "text": "So what's interesting is when we look at the problem your point then we just came.", "newpara": true, "start": 2275.197, "speaker": "Keith"}, {"confidence": 0.9, "end": 2292.406, "track": 1, "text": "And all this problem not just in storage but in that work as well but then with the ability to deliver a certain current sea level.", "start": 2283.321, "speaker": "Keith"}, {"confidence": 0.94, "end": 2301.161, "track": 1, "text": "Across you know a given form factor so how many gigabytes per second can I deliver in before you structure.", "start": 2292.563, "speaker": "Keith"}, {"confidence": 0.95, "end": 2314.802, "track": 1, "text": "And then not only that how many concurrent connections to Any Given subsystem or file can I handle on any for you chassis and so those are the two things that I spend a lot of time playing with.", "start": 2301.997, "speaker": "Keith"}, {"confidence": 0.92, "end": 2322.475, "track": 1, "text": "What are what I call a sharp edges how many can I unleash a million concurrent connections against one for you.", "start": 2315.247, "speaker": "Keith"}, {"confidence": 0.9, "end": 2335.719, "track": 1, "text": "You know some of that sparked math some of that sparked trial and error to figure out and so yes we we have been looking a lot at it mostly because we've had some bleeding edge customers.", "newpara": true, "start": 2324.296, "speaker": "Keith"}, {"confidence": 0.92, "end": 2340.407, "track": 1, "text": "Who was actually started using it who have shared sort of their Journey with us.", "start": 2335.828, "speaker": "Keith"}, {"confidence": 0.93, "end": 2350.37, "track": 1, "text": "And you know not every journey is totally seamless but at the same time it's definitely been an interesting eye-opener but what's interesting is.", "start": 2340.738, "speaker": "Keith"}, {"confidence": 0.97, "end": 2353.885, "track": 1, "text": "You know our products Heritage comes from,", "start": 2351.175, "speaker": "Keith"}, {"confidence": 0.8, "end": 2362.351, "track": 1, "text": "sort of the you know what I'll call American Apparel approach so you know if you like to do streaming sound or streaming media.", "start": 2353.981, "speaker": "Keith"}, {"confidence": 0.95, "end": 2373.655, "track": 1, "text": "You can't really have a whole lot of locks on the file or you're suddenly going to really have a problem when everybody in the Internet besides they love that new song on.", "start": 2362.454, "speaker": "Keith"}, {"confidence": 0.89, "end": 2379.568, "track": 1, "text": "Or let you want to watch the same media and so you know there's sort of this idea that.", "start": 2374.43, "speaker": "Keith"}, {"confidence": 0.96, "end": 2386.226, "track": 1, "text": "You can have a weed without a lock and so that's where you know we've sort of approach to.", "start": 2380.001, "speaker": "Keith"}, {"confidence": 0.91, "end": 2397.979, "track": 1, "text": "Historically and what's interesting now is as for the tensorflow xindi pony takes off on her no network that's actually a very valuable commodity because most of the actual file systems out there.", "start": 2386.466, "speaker": "Keith"}, {"confidence": 0.87, "end": 2405.455, "track": 1, "text": "Still a database term do it an optimistic or what I mean by that is every day assume every open May potentially do a right.", "start": 2398.448, "speaker": "Keith"}, {"confidence": 0.95, "end": 2415.562, "track": 1, "text": "So when you start to manage latches in the background when you start to manage different you lock mechanisms at some point you reach a ability of.", "start": 2405.87, "speaker": "Keith"}, {"confidence": 0.89, "end": 2423.824, "track": 1, "text": "So many users into a given file causes a problem with the name yo is aspirates itself as latency.", "newpara": true, "start": 2416.037, "speaker": "Keith"}, {"confidence": 0.89, "end": 2431.774, "track": 1, "text": "And if you get enough connections into there's enough unmatched or if they were referred to as an asymptote with musically means it goes to zero and nothing more.", "start": 2424.083, "speaker": "Keith"}, {"confidence": 0.91, "end": 2440.211, "track": 1, "text": "And so from that standpoint your what we're really seeing is it's really a fun interesting time because.", "start": 2432.892, "speaker": "Keith"}, {"confidence": 0.92, "end": 2447.05, "track": 1, "text": "You now have your things that were interesting in another of segments.", "start": 2440.849, "speaker": "Keith"}, {"confidence": 0.96, "end": 2451.58, "track": 1, "text": "That are now extremely valuable and this sucks like.", "start": 2447.386, "speaker": "Keith"}, {"confidence": 0.96, "end": 2459.945, "track": 1, "text": "If you go back to innovator's dilemma is really how you know he says everything gets crushed by something that's been applied to a new use.", "start": 2452.086, "speaker": "Keith"}, {"confidence": 0.91, "end": 2468.225, "track": 1, "text": "I'm so fresh Tampa Emily you interested in this because it Play Store Heritage where we come from we have ice on it some more.", "start": 2460.348, "speaker": "Keith"}, {"confidence": 0.97, "end": 2471.476, "track": 1, "text": "But at the same time you know,", "start": 2468.742, "speaker": "Keith"}, {"confidence": 0.91, "end": 2479.324, "track": 1, "text": "cost of our customers were the first people to start applying this on and then came back to us and say hey we did this with love it but can you look at that show can you look at that.", "start": 2471.555, "speaker": "Keith"}, {"confidence": 0.91, "end": 2486.86, "track": 1, "text": "And so that was sort of the Genesis was hey I actually started doing it even without our knowledge and then started saying hate works great but,", "start": 2479.517, "speaker": "Keith"}, {"confidence": 0.93, "end": 2494.545, "track": 1, "text": "can you help here and so that's actually what started my journey into this was in order to help them and then we started putting lacquer.", "start": 2486.902, "speaker": "Keith"}, {"confidence": 0.93, "end": 2502.7, "track": 1, "text": "And your point now that you know deep learning a sort of one of the hottest topics in the ecosystem it gets very very interesting.", "start": 2495.231, "speaker": "Keith"}, {"confidence": 0.91, "end": 2511.635, "track": 3, "text": "Keith I want to ship a little bit and talk about the business and now you're talking about bleeding edge and as,", "newpara": true, "start": 2504.322, "speaker": "Brett"}, {"confidence": 0.88, "end": 2521.159, "track": 3, "text": "these cases for deep learning are growing more and more as an organization's begin to or continue their Journey with the earning can you share some cool stories.", "start": 2511.485, "speaker": "Brett"}, {"confidence": 0.91, "end": 2524.771, "track": 3, "text": "About what you're seeing out there.", "newpara": true, "start": 2521.238, "speaker": "Brett"}, {"confidence": 0.85, "end": 2530.732, "track": 1, "text": "Sure so I guess I've got some customers that you have probably not nice to reference.", "newpara": true, "start": 2525.42, "speaker": "Keith"}, {"confidence": 0.88, "end": 2541.091, "track": 1, "text": "But they've been you know a couple of them have weaponized use my term tensorflow and you know have some very very big install.", "start": 2531.519, "speaker": "Keith"}, {"confidence": 0.96, "end": 2553.987, "track": 1, "text": "And you know what's interesting is they were actually doing it on some older hardware and it was really working pretty well and so now as we look at some of the gen-6 and would even bring the boys.", "start": 2541.194, "speaker": "Keith"}, {"confidence": 0.91, "end": 2562.213, "track": 1, "text": "And so that sort of started and you know our understanding and now we really have you know every industry.", "start": 2554.191, "speaker": "Keith"}, {"confidence": 0.94, "end": 2570.992, "track": 1, "text": "Yo if you look at me a couple of that that truly innovators and every industry and what I mean by that is I've got a couple and financial service.", "start": 2562.334, "speaker": "Keith"}, {"confidence": 0.97, "end": 2580.415, "track": 1, "text": "We've got a couple in media and entertainment we've got a couple in the the life scientist Healthcare space.", "start": 2571.383, "speaker": "Keith"}, {"confidence": 0.93, "end": 2584.994, "track": 1, "text": "Where there on the journey and what I mean by that is.", "start": 2580.794, "speaker": "Keith"}, {"confidence": 0.98, "end": 2591.357, "track": 1, "text": "The conversation really in a couple of them started with.", "newpara": true, "start": 2586.821, "speaker": "Keith"}, {"confidence": 0.96, "end": 2597.144, "track": 1, "text": "You know what do you know about and that quickly morph into you know.", "start": 2591.622, "speaker": "Keith"}, {"confidence": 0.97, "end": 2603.513, "track": 1, "text": "I can have me personally can have a conversation all the way up to the management orchestration layer.", "start": 2597.938, "speaker": "Keith"}, {"confidence": 0.9, "end": 2608.074, "track": 1, "text": "And talk through no use cases architectural consideration.", "start": 2604.025, "speaker": "Keith"}, {"confidence": 0.93, "end": 2614.071, "track": 1, "text": "How does that Mary up with your use cases and it's really turned into a dialogue where you know.", "start": 2608.79, "speaker": "Keith"}, {"confidence": 0.9, "end": 2620.183, "track": 1, "text": "We corporately are you having dialogues with him about what is it you're trying to do.", "start": 2614.21, "speaker": "Keith"}, {"confidence": 0.95, "end": 2630.47, "track": 1, "text": "And then Willy we can break down into the use cases and then give them guidance about here's how to run a PLC in some cases we're helping them run the POC.", "start": 2620.285, "speaker": "Keith"}, {"confidence": 0.96, "end": 2637.958, "track": 1, "text": "To understand you know how they can consume it how they're comfortable with it and so that sort of driving it but anyways.", "start": 2630.681, "speaker": "Keith"}, {"confidence": 0.95, "end": 2649.471, "track": 1, "text": "Right now we're sitting on about 15 different organizations all of them very very large who all and when I mean large billion dollar.", "start": 2638.168, "speaker": "Keith"}, {"confidence": 0.83, "end": 2654.549, "track": 1, "text": "Who are in a really trying to figure out how do they bring this in.", "start": 2650.289, "speaker": "Keith"}, {"confidence": 0.94, "end": 2669.247, "track": 1, "text": "And you're not really break their architectural tenants they want security they want back up they want you to all the good practices but they also want to be able to do this you know in and some of the scale aspirations I've heard are off the chart.", "start": 2654.784, "speaker": "Keith"}, {"confidence": 0.86, "end": 2674.312, "track": 1, "text": "You're not there today but you have some of the things they want to do the size would be Mass.", "start": 2669.686, "speaker": "Keith"}, {"confidence": 0.85, "end": 2681.956, "track": 2, "text": "Hey Keith what industries are you seeing in Embrace deep learning in machine learning quicker.", "newpara": true, "start": 2675.184, "speaker": "Kyle"}, {"confidence": 0.95, "end": 2687.959, "track": 1, "text": "Probably the top ones I've seen Financial Services.", "newpara": true, "start": 2682.912, "speaker": "Keith"}, {"confidence": 0.91, "end": 2700.073, "track": 1, "text": "Me your number Taemin oil and gas Healthcare Life Sciences you know so you know mix medicine you know the ability to.", "start": 2688.633, "speaker": "Keith"}, {"confidence": 0.87, "end": 2709.676, "track": 1, "text": "Floyd some of the other packs images were seeing or even medical swabs is off the chart.", "start": 2700.831, "speaker": "Keith"}, {"confidence": 0.86, "end": 2718.467, "track": 1, "text": "Some of the in a financial services we're starting to actually add governance and Regulatory.", "start": 2710.445, "speaker": "Keith"}, {"confidence": 0.92, "end": 2728.346, "track": 1, "text": "It is really taking off Media entertainment it is really adopting oil and gas so the ability to actually.", "newpara": true, "start": 2720.264, "speaker": "Keith"}, {"confidence": 0.93, "end": 2736.56, "track": 1, "text": "No use for the Deep learning and sort of in the end of that case it's actually for targeting oil serves instead of actually on the existing.", "start": 2728.485, "speaker": "Keith"}, {"confidence": 0.84, "end": 2741.897, "track": 1, "text": "So you know we're really starting to see what aux all a true cross-pollination across.", "start": 2736.939, "speaker": "Keith"}, {"confidence": 0.87, "end": 2752.454, "track": 1, "text": "All different and auto is probably the oldest I mean Auto has if you look at it in your what they refer to as a task for fence driving is probably the for bearer of almost all.", "start": 2742.005, "speaker": "Keith"}, {"confidence": 0.9, "end": 2766.768, "track": 0, "text": "The actual you bring up all night she doesn't become immediately self-evident to me which is media and entertainment so unpack a little bit for me like what what's her conversations are you having in that space where.", "newpara": true, "start": 2753.579, "speaker": "Cory"}, {"confidence": 0.91, "end": 2771.293, "track": 0, "text": "They're thinking deep learning that's what I want to do.", "newpara": true, "start": 2767.009, "speaker": "Cory"}, {"confidence": 0.96, "end": 2778.864, "track": 1, "text": "This one caught me off guard at first until I started digging in and then when I started here what they've done it to Larry.", "newpara": true, "start": 2772.633, "speaker": "Keith"}, {"confidence": 0.89, "end": 2786.868, "track": 1, "text": "So there's two 1/2 sort of abuse cases that I've seen one of them I find completely fast.", "start": 2779.502, "speaker": "Keith"}, {"confidence": 0.87, "end": 2796.891, "track": 1, "text": "And you know it's for the play some sort of Labor Arbitrage sort of approach so there is a major and then he house that does movies.", "start": 2787.866, "speaker": "Keith"}, {"confidence": 0.92, "end": 2802.924, "track": 1, "text": "They literally had deep learning create a trailer for their movie.", "start": 2797.968, "speaker": "Keith"}, {"confidence": 0.9, "end": 2808.002, "track": 1, "text": "And so what they did was they fed it a series of clips from the movie.", "start": 2803.514, "speaker": "Keith"}, {"confidence": 0.98, "end": 2819.828, "track": 1, "text": "And then let the Deep learning algorithm figure out how to stitch together a trailer them at a certain time criteria and a certain set of element criteria.", "start": 2808.508, "speaker": "Keith"}, {"confidence": 0.95, "end": 2829.971, "track": 1, "text": "What I've heard is that the if an individual human had done it that would have taken 30 days the actual deep learning Bots did it in less than 24 hours.", "start": 2820.724, "speaker": "Keith"}, {"confidence": 0.94, "end": 2845.018, "track": 1, "text": "Yes and actually what I hear is it's actually as good as if a human did it the other use cases a little more business focus and what I mean by that is what we're finding is there taking.", "start": 2831.035, "speaker": "Keith"}, {"confidence": 0.94, "end": 2853.353, "track": 1, "text": "Movie successes is a great way to say which movies made money which movies lost money.", "start": 2845.559, "speaker": "Keith"}, {"confidence": 0.94, "end": 2867.774, "track": 1, "text": "What elements were included in those movies so plot with different things and they're actually using deep learning to sort of adjust the flow and adjust the elements within movies.", "start": 2853.798, "speaker": "Keith"}, {"confidence": 0.97, "end": 2877.798, "track": 1, "text": "To potentially include some elements that may have been you know in a similar movie that made a whole lot of money it was a box office success.", "newpara": true, "start": 2867.847, "speaker": "Keith"}, {"confidence": 0.91, "end": 2889.473, "track": 1, "text": "So they're actually using it behind the scenes the sort of craft sort of you know the way a movie might flow or some scenes you might want to include a different element and so really they're using it sort of to help.", "start": 2877.978, "speaker": "Keith"}, {"confidence": 0.98, "end": 2892.291, "track": 1, "text": "Figure out how to have another box off exit.", "start": 2889.678, "speaker": "Keith"}, {"confidence": 0.95, "end": 2894.941, "track": 0, "text": "That's crazy cuz actually I just,", "newpara": true, "start": 2892.809, "speaker": "Cory"}, {"confidence": 0.93, "end": 2906.833, "track": 0, "text": "just brought up to mine that we talked about in our very first episode of the big date of your podcast we talked about how some of the movie houses were talking about putting cameras into the theaters.", "start": 2895.05, "speaker": "Cory"}, {"confidence": 0.79, "end": 2910.24, "track": 0, "text": "To to monitor how people reacted,", "start": 2906.72, "speaker": "Cory"}, {"confidence": 0.92, "end": 2918.142, "track": 0, "text": "you know facial expression body language right everything their reactions to the movies so that they can understand,", "start": 2910.331, "speaker": "Cory"}, {"confidence": 0.95, "end": 2931.218, "track": 0, "text": "you know the emotional response that their product creates and if good like sir to do some interesting analysis of how to make better movies which is that's just a really interesting yusuke Wild,", "start": 2917.981, "speaker": "Cory"}, {"confidence": 0.98, "end": 2933.207, "track": 0, "text": "good.", "start": 2931.026, "speaker": "Cory"}, {"confidence": 0.9, "end": 2942.731, "track": 1, "text": "Is it plays into a lot of the use cases that started in machine learning\nand now really have cared for in a deep learning.", "newpara": true, "start": 2934.001, "speaker": "Keith"}, {"confidence": 0.85, "end": 2953.68, "track": 1, "text": "Are really last what I'll call the classic I want it you know I want to send me grow my my pie tons or I wanted 71 a safe cost.", "start": 2943.339, "speaker": "Keith"}, {"confidence": 0.91, "end": 2960.344, "track": 1, "text": "Enter more on sort of the angle of I want to do what I do better.", "start": 2954.564, "speaker": "Keith"}, {"confidence": 0.92, "end": 2971.245, "track": 1, "text": "And so you know that's really what we're seeing is a lot of these cases like this the goal is to make more money but there are a lot more targeted to your point to understand how do we make better movies.", "start": 2960.843, "speaker": "Keith"}, {"confidence": 0.92, "end": 2985.546, "track": 1, "text": "How do I run my business but you no answer that's really what we're seeing a lot of the financial services to be used cases where exactly that how do I run my business better is really the strongest use case and financial services right now for deep learning.", "start": 2971.485, "speaker": "Keith"}, {"confidence": 0.94, "end": 2997.132, "track": 0, "text": "Interested now one thing I do know about you is that this is publicly stated that you have a background and history working with the the federal government I'm guessing.", "newpara": true, "start": 2986.015, "speaker": "Cory"}, {"confidence": 0.89, "end": 3003.748, "track": 0, "text": "I'm guessing the stuff is actually I'm guessing there's a few agencies who are doing some things in deep learning.", "start": 2997.162, "speaker": "Cory"}, {"confidence": 0.99, "end": 3006.62, "track": 1, "text": "There are but I can't tell you who.", "newpara": true, "start": 3004.764, "speaker": "Keith"}, {"confidence": 0.88, "end": 3011.59, "track": 0, "text": "I wasn't trying to mess up your your pass or anything.", "newpara": true, "start": 3006.32, "speaker": "Cory"}, {"confidence": 0.96, "end": 3021.354, "track": 1, "text": "Well I mean let's be really clear you've got capabilities that.", "newpara": true, "start": 3011.398, "speaker": "Keith"}, {"confidence": 0.85, "end": 3027.862, "track": 1, "text": "Really in the open-source at a very reasonable cost and so licensing center flows free.", "start": 3021.733, "speaker": "Keith"}, {"confidence": 0.95, "end": 3042.518, "track": 1, "text": "The ability to scale unlimitedly on your lots of data and signal and noise yes I could say you would probably expect that the signal intelligence agencies near would be very interested in this.", "start": 3028.728, "speaker": "Keith"}, {"confidence": 0.93, "end": 3053.761, "track": 0, "text": "That's funny you just use the siliconangle cube TVs slogan we extract the signal from the noise.", "newpara": true, "start": 3044.021, "speaker": "Cory"}, {"confidence": 0.89, "end": 3067.942, "track": 0, "text": "Will keep this is been fun I enjoyed the conversation cuz we learned a bit more about the architectural tenants that make up deep learning environments we we talked about architectures that are important things to plan for Knott's boil the ocean.", "newpara": true, "start": 3053.924, "speaker": "Cory"}, {"confidence": 0.96, "end": 3069.451, "track": 0, "text": "Focus on.", "start": 3067.799, "speaker": "Cory"}, {"confidence": 0.94, "end": 3082.389, "track": 0, "text": "Making the business better and using tools that are broadly available today and keeping an eye on some of those Trends and Technology like a ton of Us cars and others before we jump too far and I want to say one thank you but I wanted to jump.", "start": 3069.313, "speaker": "Cory"}, {"confidence": 0.93, "end": 3091.714, "track": 0, "text": "Into a funnel session with you called rapid fire where I'm just going to ask you a handful of questions what I want you to do is I want you to sit back relax.", "start": 3082.311, "speaker": "Cory"}, {"confidence": 0.96, "end": 3101.245, "track": 0, "text": "And give me the first thing that comes to mind whenever I ask you this question you ready\nwhat year will Skynet go online.", "newpara": true, "start": 3092.046, "speaker": "Cory"}, {"confidence": 0.91, "end": 3104.231, "track": 1, "text": "2100.", "newpara": true, "start": 3103.054, "speaker": "Keith"}, {"confidence": 0.99, "end": 3107.092, "track": 0, "text": "If you bought me a book what would it be.", "newpara": true, "start": 3104.478, "speaker": "Cory"}, {"confidence": 0.99, "end": 3110.793, "track": 1, "text": "Probably had a groom your beard.", "newpara": true, "start": 3109.003, "speaker": "Keith"}, {"confidence": 0.93, "end": 3113.185, "track": 0, "text": "Hey easy hot rod.", "newpara": true, "start": 3110.529, "speaker": "Cory"}, {"confidence": 0.88, "end": 3114.314, "track": 1, "text": "I got a beer to now.", "newpara": true, "start": 3112.933, "speaker": "Keith"}, {"confidence": 0.89, "end": 3123.749, "track": 0, "text": "Proud of you he join the club so that's okay hang on time out okay beard that's awesome to lives in the Southeast I've said this before.", "newpara": true, "start": 3114.015, "speaker": "Cory"}, {"confidence": 0.96, "end": 3133.904, "track": 0, "text": "The Deep South Dixie is the place where data science is getting real anyways thanks for that number 3 what genre of music are you rocking right now.", "newpara": true, "start": 3123.881, "speaker": "Cory"}, {"confidence": 0.98, "end": 3140.123, "track": 0, "text": "Classic what is your favorite piece of utterly useless Tech.", "newpara": true, "start": 3135.202, "speaker": "Cory"}, {"confidence": 0.98, "end": 3143.771, "track": 1, "text": "How do I useless.", "newpara": true, "start": 3142.383, "speaker": "Keith"}, {"confidence": 0.9, "end": 3147.659, "track": 0, "text": "Yeah just like Bridget something ridiculous it's like I have this but it's kind of dumb.", "newpara": true, "start": 3143.471, "speaker": "Cory"}, {"confidence": 0.87, "end": 3157.363, "track": 1, "text": "Cuz I had a lot of fun of stuff I'm trying to figure out when I actually my SmartWatch cuz I haven't actually worn it in about 8 months.", "newpara": true, "start": 3149.324, "speaker": "Keith"}, {"confidence": 0.88, "end": 3166.047, "track": 0, "text": "Yeah that's sad I think you're like the 5th vote for the Smartwatch being just generally you so so what is your biggest Money Pit right now.", "newpara": true, "start": 3157.46, "speaker": "Cory"}, {"confidence": 0.91, "end": 3180.192, "track": 1, "text": "Probably my toys which would be either my mountain bikes or my my collection of useless raspberry pies and movie DSN and other.", "newpara": true, "start": 3167.285, "speaker": "Keith"}, {"confidence": 0.92, "end": 3186.496, "track": 2, "text": "What's been your a favorite use of the Raspberry Pi so far.", "newpara": true, "start": 3183.083, "speaker": "Kyle"}, {"confidence": 0.95, "end": 3197.534, "track": 1, "text": "Actually I have a couple of Endive of fume raspberry pies with movidius Intel chips on them so if you know what that is that's actually you can turn your Raspberry Pi into a deep learning machine.", "newpara": true, "start": 3186.49, "speaker": "Keith"}, {"confidence": 0.94, "end": 3199.343, "track": 1, "text": "We're about a hundred fifty bucks.", "start": 3197.727, "speaker": "Keith"}, {"confidence": 0.92, "end": 3215.171, "track": 1, "text": "Okay and little league so I actually have it cut it is trained on a certain set of models so I actually feed date and do it and it runs some progressions for me on on something that I do for kicks and giggles.", "newpara": true, "start": 3200.858, "speaker": "Keith"}, {"confidence": 0.9, "end": 3223.235, "track": 1, "text": "I'm a big mountain biker and so it actually chews on some of the data that comes off my Garmin.", "start": 3215.394, "speaker": "Keith"}, {"confidence": 0.81, "end": 3224.858, "track": 0, "text": "That's pretty cool.", "newpara": true, "start": 3223.302, "speaker": "Cory"}, {"confidence": 0.91, "end": 3230.794, "track": 2, "text": "I thought I was doing well with the you know virtualizing video games on that thing but never mind.", "newpara": true, "start": 3224.557, "speaker": "Kyle"}, {"confidence": 0.88, "end": 3238.336, "track": 0, "text": "That's awesome what can you find out what two things you do a lot as you travel so are you going anywhere exceptionally interesting soon.", "newpara": true, "start": 3228.626, "speaker": "Cory"}, {"confidence": 0.92, "end": 3249.362, "track": 1, "text": "Let's see what's in my plant love Seattle be there soon love New York be there soon I love London be there soon.", "newpara": true, "start": 3242.519, "speaker": "Keith"}, {"confidence": 0.89, "end": 3259.927, "track": 1, "text": "Going to Miami in there and possibly going to Vegas I mean so you know all fun places so actually all the places I'm going.", "newpara": true, "start": 3250.661, "speaker": "Keith"}, {"confidence": 0.93, "end": 3269.451, "track": 0, "text": "Nice I like it okay last question what show and it doesn't three TV could be Netflix Amazon Prime whatever into what show are you binging on right now.", "newpara": true, "start": 3260.269, "speaker": "Cory"}, {"confidence": 0.84, "end": 3282.641, "track": 1, "text": "What do you see\ntry to remember the exact name for\nthe one where they make nice the forging show.", "newpara": true, "start": 3271.434, "speaker": "Keith"}, {"confidence": 0.92, "end": 3286.805, "track": 0, "text": "Oh yeah yeah.", "newpara": true, "start": 3282.479, "speaker": "Cory"}, {"confidence": 0.58, "end": 3288.307, "track": 2, "text": "Blademasters does.", "newpara": true, "start": 3286.571, "speaker": "Kyle"}, {"confidence": 0.75, "end": 3290.21, "track": 1, "text": "No it's not that's one of History Channel.", "newpara": true, "start": 3288.037, "speaker": "Keith"}, {"confidence": 0.77, "end": 3291.684, "track": 0, "text": "Yeah it's the History Channel on that.", "newpara": true, "start": 3290.08, "speaker": "Cory"}, {"confidence": 0.94, "end": 3301.708, "track": 0, "text": "Forest & Fire that's there you go awesome well that's an awesome show I do enjoy it and just don't carry any large plays well on your mountain bike you can hurt yourself.", "newpara": true, "start": 3292.13, "speaker": "Cory"}, {"confidence": 0.96, "end": 3303.108, "track": 1, "text": "Or in the airport they don't like that.", "newpara": true, "start": 3301.414, "speaker": "Keith"}, {"confidence": 0.95, "end": 3309.195, "track": 0, "text": "Generally speaking also true key thank you so much for being on today this is been a super fun conversation,", "newpara": true, "start": 3302.844, "speaker": "Cory"}, {"confidence": 0.93, "end": 3317.92, "track": 0, "text": "Kyle Brett thank you for being actually all of you thank you for growing your beards and thank you for being awesome be sure to check us out in iTunes,", "start": 3308.991, "speaker": "Cory"}, {"confidence": 0.82, "end": 3322.03, "track": 0, "text": "and make sure you're at the podcast next game.", "start": 3317.986, "speaker": "Cory"}]