[{"confidence": 0.91, "end": 8.599, "track": 0, "text": "Start the recording now so we'll get that rolling\ngive it just a minute to get everything wrong.", "newpara": true, "start": 0.006, "speaker": "Cory"}, {"confidence": 0.91, "end": 24.192, "track": 0, "text": "You actually but no that's really good if you I know you just went on mute if you if you're not talking I would recommend you know using the mute feature cuz it does just help in post-production\nalright folks we're going to get started.", "start": 9.32, "speaker": "Cory"}, {"confidence": 0.9, "end": 34.588, "track": 0, "text": "Hi everyone this is Corey Milton from the bigdatabeard team and we are excited to start our episode today to talk about.", "newpara": true, "start": 26.194, "speaker": "Cory"}, {"confidence": 0.97, "end": 39.545, "track": 0, "text": "Software composable infrastructure and how that concept is so important.", "start": 34.546, "speaker": "Cory"}, {"confidence": 0.93, "end": 49.478, "track": 0, "text": "To make it applications today I'm joined by co-host fellow bearded man they did Aficionado in the state of Alabama Thomas Henson and we've invited,", "start": 39.774, "speaker": "Cory"}, {"confidence": 0.84, "end": 58.21, "track": 0, "text": "one of the most interesting organizations in big day today who is working towards the software composable infrastructure model Drive scale,", "start": 49.629, "speaker": "Cory"}, {"confidence": 0.93, "end": 61.545, "track": 0, "text": "and dry scale was founded by a couple of really smart dudes,", "start": 57.982, "speaker": "Cory"}, {"confidence": 0.97, "end": 75.167, "track": 0, "text": "one of those dudes has been nice enough to join his Tom Lyon is the co-founder and chief scientist a dry scale he you may know that name because he's had his hand in the creation of a bunch of a kind of products and Technology things like u c s and Nexus switching.", "start": 61.371, "speaker": "Cory"}, {"confidence": 0.88, "end": 80.221, "track": 0, "text": "VIP switching in general and NFS and Spark cuz he was employee number 8,", "start": 75.138, "speaker": "Cory"}, {"confidence": 0.91, "end": 97.509, "track": 0, "text": "at Sun so excited have Tom and we're also joined by SK vinoda vinod is the VP of product management for drivescale he's got an awesome background and bring an emerging Technologies to market around the world and so Tom and I am but no thank you so much for joining us tell us a little bit about,", "start": 79.999, "speaker": "Cory"}, {"confidence": 0.84, "end": 101.138, "track": 0, "text": "who drives Gill is an and what year what you're trying to accomplish.", "start": 97.317, "speaker": "Cory"}, {"confidence": 0.91, "end": 114.184, "track": 2, "text": "Okay this is Tom but yeah so dry scales found a few years back basically looking at the incredible growth of scale-out Technologies,", "newpara": true, "start": 103.35, "speaker": "Tom Lyon"}, {"confidence": 0.85, "end": 123.642, "track": 2, "text": "and the Big Data space has been probably the preeminent space worry you just so you really large cluster is growing and growing\nand.", "start": 114.173, "speaker": "Tom Lyon"}, {"confidence": 0.9, "end": 127.404, "track": 2, "text": "And yet the the architecture for these things has been somewhat.", "start": 123.703, "speaker": "Tom Lyon"}, {"confidence": 0.88, "end": 134.212, "track": 2, "text": "Primitive his people have gone away from using virtual machines and Sans and Ness.", "start": 128.041, "speaker": "Tom Lyon"}, {"confidence": 0.94, "end": 142.992, "track": 2, "text": "Both for cost and performance reasons so everyone's using the cookie cutter servers with direct attached storage,", "start": 134.351, "speaker": "Tom Lyon"}, {"confidence": 0.91, "end": 151.723, "track": 2, "text": "but as the Clusters grow you would you find a mentally always have an in Balance issue where either there's too much computer too much storage so so how how do you,", "start": 142.878, "speaker": "Tom Lyon"}, {"confidence": 0.93, "end": 161.554, "track": 2, "text": "get around that and so composable infrastructure is a way of bringing you back some of the fundamental advantages of separation of commute and Storage.", "start": 151.849, "speaker": "Tom Lyon"}, {"confidence": 0.97, "end": 167.815, "track": 2, "text": "Without leaving behind the the cost and performance requirements that these new applications have.", "start": 162.071, "speaker": "Tom Lyon"}, {"confidence": 0.97, "end": 181.798, "track": 0, "text": "Interesting so so the goal here is as it's kind of funny you say primitive because it feels like everything that's happening in big data has to be the newest and coolest thing but it sounds like you went like we went backwards in terms of Pi to deployments.", "newpara": true, "start": 168.489, "speaker": "Cory"}, {"confidence": 0.48, "end": 184.34, "track": 2, "text": "Well in some ways,", "newpara": true, "start": 181.997, "speaker": "Tom Lyon"}, {"confidence": 0.92, "end": 192.969, "track": 2, "text": "yeah it's it was the the right thing to do and yet obviously there was a reason that people had Sans and there was a reason that,", "start": 184.202, "speaker": "Tom Lyon"}, {"confidence": 0.85, "end": 202.043, "track": 2, "text": "people had virtual machines and stuff and it would feel the same problems exist but we need different types of solutions to get there.", "start": 192.819, "speaker": "Tom Lyon"}, {"confidence": 0.96, "end": 204.567, "track": 0, "text": "Show me understand how you guys get there when you say,", "newpara": true, "start": 201.743, "speaker": "Cory"}, {"confidence": 0.94, "end": 215.203, "track": 0, "text": "you know there's a splendid mental imbalance between performance and capacity like we've you know a bunch of us have seen this in and talked about it. You know over the other episodes and just in general is that,", "start": 204.351, "speaker": "Cory"}, {"confidence": 0.96, "end": 225.003, "track": 0, "text": "that primitive deployment model of tightly coupling storage in compute was cost-effective but like you said it's really limiting in terms of,", "start": 214.993, "speaker": "Cory"}, {"confidence": 0.97, "end": 227.623, "track": 0, "text": "how you respond to changes not only in,", "start": 224.854, "speaker": "Cory"}, {"confidence": 0.95, "end": 239.702, "track": 0, "text": "just kind of growing your environment but also the changing nature of the landscape of processing framework so what is software composable infrastructure mean to Dexter how does it actually an able that that diss,", "start": 227.744, "speaker": "Cory"}, {"confidence": 0.82, "end": 241.114, "track": 0, "text": "navigation to talk about.", "start": 239.78, "speaker": "Cory"}, {"confidence": 0.94, "end": 254.117, "track": 2, "text": "Well it's interesting when we explain our system most people kind of looking at us as a storage solution but most of our work takes place on the server side and it's really about.", "newpara": true, "start": 242.46, "speaker": "Tom Lyon"}, {"confidence": 0.95, "end": 262.506, "track": 2, "text": "Easily managing in the hundreds or thousands of servers and connecting them to the right Right Storage in the right place.", "start": 254.496, "speaker": "Tom Lyon"}, {"confidence": 0.92, "end": 271.97, "track": 2, "text": "And so it sucks we really have to work on both sides of that connection to make things really easy and.", "start": 262.801, "speaker": "Tom Lyon"}, {"confidence": 0.93, "end": 283.724, "track": 2, "text": "Part of achieving the cost Target on the storage side is making sure that there is no extra bells and whistles so the story is Target's her incredibly dumb but incredibly cheap and fast.", "start": 272.289, "speaker": "Tom Lyon"}, {"confidence": 0.92, "end": 288.537, "track": 2, "text": "At least we saw or tie it all together with our software.", "start": 284.397, "speaker": "Tom Lyon"}, {"confidence": 0.9, "end": 297.28, "track": 3, "text": "Yeah that's what one of the things I'd like to add about that is that the block from that we have it would like to call it a composite Beauty Platte from rather than just two point product.", "newpara": true, "start": 288.43, "speaker": "Vinod"}, {"confidence": 0.94, "end": 305.146, "track": 3, "text": "Andy Gibb and the platform is very simply this you take this list servers on one side of this platform architecture.", "newpara": true, "start": 297.93, "speaker": "Vinod"}, {"confidence": 0.92, "end": 315.65, "track": 3, "text": "And the silver spoon I should just wish they could be of any fun fact that they could be rack mount servers bladed phone Factor modular sofas and so on as long as they don't have much discs in them.", "start": 305.489, "speaker": "Vinod"}, {"confidence": 0.94, "end": 324.045, "track": 3, "text": "And then on the other side of the platform architecture is basically just raw storage so it's hard disks and in the future could be a ssds as well.", "start": 316.035, "speaker": "Vinod"}, {"confidence": 0.89, "end": 336.664, "track": 3, "text": "And what we do is we composed by Binding Together any number of hard disk to any of the servers at the scale of the data center on demand for water well 31 the Run.", "newpara": true, "start": 324.598, "speaker": "Vinod"}, {"confidence": 0.93, "end": 346.687, "track": 3, "text": "And defend these bindings are not fixed in the sense that they could be modified on the flight you can add more capacity to dusit Pasadena change the mix.", "start": 337.037, "speaker": "Vinod"}, {"confidence": 0.93, "end": 357.209, "track": 3, "text": "And even do things like suspend a cluster remove it hard disks and assign the CPU to something else and then bring back the original cluster on demand.", "start": 346.88, "speaker": "Vinod"}, {"confidence": 0.9, "end": 364.606, "track": 3, "text": "So fundamentally compose ability of Forge in level of flexibility and Agility that you cannot get.", "start": 357.456, "speaker": "Vinod"}, {"confidence": 0.87, "end": 367.857, "track": 3, "text": "Buy fixing computer and storage in one box.", "start": 364.913, "speaker": "Vinod"}, {"confidence": 0.92, "end": 375.903, "track": 0, "text": "Okay so so most most of us have been around at least I had to pick up system is kind of the starting point,", "newpara": true, "start": 368.35, "speaker": "Cory"}, {"confidence": 0.98, "end": 395.084, "track": 0, "text": "we look at you no deployment for Hardware as like we talked about for this kind of primitive thing of you by your industry standard kind of commodity to you server that's got you nose much CPU and memory as you can get but also just you know anywhere from 12 to 24 drives in it and those are those drives are physically presented as you know kind of,", "start": 375.735, "speaker": "Cory"}, {"confidence": 0.94, "end": 406.501, "track": 0, "text": "Jaybird to that particular server they're bound to that server and we just buy lots and lots of those pizza boxes as it were right so what you're saying is that now we buy a different.", "start": 396.124, "speaker": "Cory"}, {"confidence": 0.98, "end": 415.22, "track": 0, "text": "Kind of server and we buy a different kind of storage and you guys do something to make that possible help me unpack the architectural.", "start": 406.412, "speaker": "Cory"}, {"confidence": 0.93, "end": 418.76, "track": 3, "text": "Sure sure so I told you want to after that.", "newpara": true, "start": 414.921, "speaker": "Vinod"}, {"confidence": 0.62, "end": 424.462, "track": 2, "text": "Yeah I guess so.", "newpara": true, "start": 418.712, "speaker": "Tom Lyon"}, {"confidence": 0.87, "end": 433.933, "track": 2, "text": "The product talks between servers and industry-standard jbuds Chassis and these Day by chassis art are just dumb ass ass,", "start": 424.463, "speaker": "Tom Lyon"}, {"confidence": 0.95, "end": 444.148, "track": 2, "text": "best things in serial scuzzy that have no processors on their own and of course the servers typically don't have a SAS interface unless you.", "start": 433.879, "speaker": "Tom Lyon"}, {"confidence": 0.94, "end": 458.438, "track": 2, "text": "Pay extra so what we do is we we convert ethernet to SAS with a box that we built that goes in the rack with the servers and and and basically that function of that boxes to make it look like all the discs are present on ethernet,", "start": 444.161, "speaker": "Tom Lyon"}, {"confidence": 0.91, "end": 468.082, "track": 2, "text": "and now any server can't can't connect to any disc subject to a whole bunch of security and top topology constraints.", "start": 458.33, "speaker": "Tom Lyon"}, {"confidence": 0.95, "end": 475.93, "track": 2, "text": "And so it would be to choose any server including the cheapest ones and it allows you to.", "start": 469.405, "speaker": "Tom Lyon"}, {"confidence": 0.89, "end": 487.311, "track": 2, "text": "To choose to choose very cheap storage because he's dumb JBoss her very little more than that sheet metal and every is every server vendor has a selection of these pea pods.", "start": 475.955, "speaker": "Tom Lyon"}, {"confidence": 0.92, "end": 501.066, "track": 2, "text": "So you can you can buy it still buy Hardware from who whoever you choose at the at the cheapest cost and yet tie it together with late binding to to get the right kind of infrastructure you need for your your application.", "start": 488.189, "speaker": "Tom Lyon"}, {"confidence": 0.9, "end": 511.312, "track": 1, "text": "So let me ask you know if we're going through and we're deploying say just to do purse Parker you know something like that art is this.", "newpara": true, "start": 502.815, "speaker": "Thomas"}, {"confidence": 0.96, "end": 526.49, "track": 1, "text": "Is there any architectural changes with how you deploy it and you know maybe I'm thinking it from a different perspective but you know the way I act the way I came up you know traditional you know you looked at it we had her name know that you have your data notes does anything change from architectural perspective I mean I understand that we can we can scale.", "newpara": true, "start": 511.57, "speaker": "Thomas"}, {"confidence": 0.89, "end": 532.512, "track": 1, "text": "You know the computer or the CPU as we need but what about the polling it would drop your house at work.", "newpara": true, "start": 526.491, "speaker": "Thomas"}, {"confidence": 0.72, "end": 535.035, "track": 2, "text": "Yeah so at the.", "newpara": true, "start": 532.494, "speaker": "Tom Lyon"}, {"confidence": 0.95, "end": 549.535, "track": 2, "text": "Son of fundamentally there's no visibility to the higher layers once once we connect the hard drives it looks just like a locally connected hard drive and you can install whatever you like but we do do do is tie in.", "start": 535.481, "speaker": "Tom Lyon"}, {"confidence": 0.84, "end": 555.178, "track": 2, "text": "Well I should back up a little fun of my life part of being composable means your your,", "start": 549.764, "speaker": "Tom Lyon"}, {"confidence": 0.92, "end": 563.326, "track": 2, "text": "you have an API then that makes things automatable and so what we do is we tie into higher-level orchestration systems,", "start": 555.07, "speaker": "Tom Lyon"}, {"confidence": 0.95, "end": 572.328, "track": 2, "text": "Heather's two examples of that today one is the Cloudera director that's normally used for instantiating clusters in the cloud,", "start": 563.134, "speaker": "Tom Lyon"}, {"confidence": 0.76, "end": 578.289, "track": 2, "text": "we were in the back and forth at so they can instantiate clusters using our composable infrastructure.", "start": 572.22, "speaker": "Tom Lyon"}, {"confidence": 0.91, "end": 592.464, "track": 2, "text": "And that's all again it's something where it's totally transparent to the the Hoops offer but we facilitate optimizing to the layer below I do and then the second example of the orchestration.", "start": 578.427, "speaker": "Tom Lyon"}, {"confidence": 0.96, "end": 599.417, "track": 2, "text": "Is with kubernetes so we integrate with kubernetes so that if you have.", "start": 592.921, "speaker": "Tom Lyon"}, {"confidence": 0.96, "end": 609.181, "track": 2, "text": "Containers that have heavy storage demands you can connect them to storage and now the storage will follow the container around as kubernetes schedule.", "start": 599.639, "speaker": "Tom Lyon"}, {"confidence": 0.89, "end": 620.749, "track": 0, "text": "So I want to come back to communities in a second but when things are you talked about was that there's this it's from what I know about drives go there's this control planner there's a software that.", "newpara": true, "start": 610.936, "speaker": "Cory"}, {"confidence": 0.94, "end": 633.404, "track": 0, "text": "That works with the hardware right so when we think about deployment there's a there's a layer in between that Cloudera director Renny the applications and the other line Hardware tell me what about what that control plane does to.", "start": 620.623, "speaker": "Cory"}, {"confidence": 0.95, "end": 641.582, "track": 0, "text": "Enable that I think what vinod you caught that binding of drives to a particular server and understanding what those resources even are.", "start": 633.332, "speaker": "Cory"}, {"confidence": 0.94, "end": 652.741, "track": 2, "text": "I'm at the the first thing we do is all about discovery of the resources and discovery of the topology so we understand the complete,", "newpara": true, "start": 642.724, "speaker": "Tom Lyon"}, {"confidence": 0.89, "end": 662.313, "track": 2, "text": "SAS topology we understand the complete ethernet apology and then those feed into the higher-level composition layer where.", "start": 652.639, "speaker": "Tom Lyon"}, {"confidence": 0.97, "end": 663.708, "track": 2, "text": "You tell it I want,", "start": 662.326, "speaker": "Tom Lyon"}, {"confidence": 0.84, "end": 674.025, "track": 2, "text": "no 17 servers each with 13 hard drives and I can just go as create those and you don't have to care what server is in which hard drives but you get,", "start": 663.642, "speaker": "Tom Lyon"}, {"confidence": 0.93, "end": 687.275, "track": 2, "text": "you get the the right infrastructure and that make sure that the server is in the hard drives are close close together based on the network topology so that you're not wasting you so that you're not in countering network bottlenecks.", "start": 673.96, "speaker": "Tom Lyon"}, {"confidence": 0.94, "end": 693.813, "track": 2, "text": "That's all that's done through management system that lives outside of the.", "start": 687.408, "speaker": "Tom Lyon"}, {"confidence": 0.9, "end": 703.524, "track": 2, "text": "Managed resources\nand so it's best for all the smarts live but then 8 there's agent on each server and agent on IR.", "start": 693.928, "speaker": "Tom Lyon"}, {"confidence": 0.83, "end": 712.712, "track": 2, "text": "Device that translates ethernet this house\ndid that did I cover things.", "start": 703.813, "speaker": "Tom Lyon"}, {"confidence": 0.93, "end": 720.62, "track": 0, "text": "Yes I actually sorry I was trying to come off of you and I couldn't get my mouse over there so it's interesting though cuz one of the things that we've,", "newpara": true, "start": 712.412, "speaker": "Cory"}, {"confidence": 0.85, "end": 726.725, "track": 0, "text": "it was talk to other. You know people from hortonworks In from from other organizations that,", "start": 720.494, "speaker": "Cory"}, {"confidence": 0.94, "end": 735.24, "track": 0, "text": "I've kind of been leaders in developing the processing Frameworks it matter it always sounded like the network bottleneck was.", "start": 726.539, "speaker": "Cory"}, {"confidence": 0.94, "end": 745.185, "track": 0, "text": "Was always a concern so you're saying that the way you guys have out the network like you don't like me you don't think the date of locality is important in the server that going across that.", "start": 735.204, "speaker": "Cory"}, {"confidence": 0.92, "end": 753.249, "track": 0, "text": "That the doctor that birds that you guys have is effective enough to combat that that argument that you need data local to the server.", "start": 745.257, "speaker": "Cory"}, {"confidence": 0.96, "end": 761.187, "track": 2, "text": "Well we we do care about locality but we think we think we can afford typically easily afford one.", "newpara": true, "start": 753.646, "speaker": "Tom Lyon"}, {"confidence": 0.94, "end": 772.484, "track": 2, "text": "One hop and so if you look at your typical ethernet environment today people are deploying at least 10 gigabit switches they should be deploying at least 25 gig.", "start": 761.235, "speaker": "Tom Lyon"}, {"confidence": 0.89, "end": 779.797, "track": 2, "text": "And they overbook the man was coming out of a rack so it's over scripts subscribe typically 41.", "start": 772.725, "speaker": "Tom Lyon"}, {"confidence": 0.9, "end": 788.756, "track": 2, "text": "And that means all the rest of that switch man with his available in the rack so if you keep the dust in the same rack as the server there's a huge amount of bandwidth available.", "start": 780.14, "speaker": "Tom Lyon"}, {"confidence": 0.89, "end": 800.534, "track": 2, "text": "And that if you're careful you can design you design your network such that you can move the disks even further away and so we have one customer friends and Sue's.", "start": 789.953, "speaker": "Tom Lyon"}, {"confidence": 0.86, "end": 810.557, "track": 2, "text": "Who's putting on racks just what server is next to Rax just with storage and the other confident that their Network architecture can keep up with that.", "start": 800.583, "speaker": "Tom Lyon"}, {"confidence": 0.83, "end": 814.085, "track": 2, "text": "But there is a.", "newpara": true, "start": 812.841, "speaker": "Tom Lyon"}, {"confidence": 0.97, "end": 828.224, "track": 2, "text": "Yeah you can do it you can do things either way but if you look at how ethernet has been progressing we've gone from 10 gig 200 gig availability pretty quickly and next year we're going to see 400 gig availability in the top Iraq.", "start": 814.091, "speaker": "Tom Lyon"}, {"confidence": 0.93, "end": 831.601, "track": 2, "text": "So there's there's a lot of man what's happening.", "start": 828.242, "speaker": "Tom Lyon"}, {"confidence": 0.97, "end": 847.014, "track": 1, "text": "So we're talking about data locality and being able to spread that never work out how does that kind of go as we start talking about Edge Computing and you know we have all this information and then you know think of I mean it's a buzz world but I mean the internet of things and then not a date it's being generator out there,", "newpara": true, "start": 831.493, "speaker": "Thomas"}, {"confidence": 0.93, "end": 855.457, "track": 1, "text": "how how do you got to see that going going further as you know we have these Edge systems and we need to get data back or do we need to get data back back to our core data center.", "start": 846.804, "speaker": "Thomas"}, {"confidence": 0.91, "end": 862.734, "track": 2, "text": "Yeah it's a tough problem cuz wide-area man was is is a whole different thing then.", "newpara": true, "start": 855.716, "speaker": "Tom Lyon"}, {"confidence": 0.92, "end": 875.251, "track": 2, "text": "Then in Datacenter bandwidth and I'm not an expert anymore on the cost of all that but it is clear that moving stuff out of the building is it's a whole different problem then when we get around in the bill.", "start": 863.077, "speaker": "Tom Lyon"}, {"confidence": 0.91, "end": 880.99, "track": 0, "text": "Obsolete so curiosity so now you said it's something you got it you got customers that are.", "newpara": true, "start": 875.756, "speaker": "Cory"}, {"confidence": 0.93, "end": 891.463, "track": 0, "text": "The finest where they've got just racks of service in the next two racks of storage within the context of your architecture are you able to like are we able to use.", "start": 881.254, "speaker": "Cory"}, {"confidence": 0.91, "end": 899.534, "track": 0, "text": "A varying set of Technologies the reason I say that meaning monthly unpack that server.", "start": 891.368, "speaker": "Cory"}, {"confidence": 0.92, "end": 908.788, "track": 0, "text": "Manufacturers have to go through the same thing that many other organizations do which is dealing with what each of their component manufacturers makes and many times software,", "start": 899.492, "speaker": "Cory"}, {"confidence": 0.88, "end": 918.071, "track": 0, "text": "developed to run on this commodity service doesn't deal well with these disparities in Cork ounce or gram density or disc types right so are.", "start": 908.86, "speaker": "Cory"}, {"confidence": 0.93, "end": 922.44, "track": 0, "text": "Is is is dry scales technology allowing organizations to,", "start": 918.204, "speaker": "Cory"}, {"confidence": 0.96, "end": 938.136, "track": 0, "text": "introducing new types of servers new disc profiles in terms of you know the media and the speed of the disk and those kind of things are you guys enabling that evolution of new technology being brought into the same clusters or at least into that same resource pool.", "start": 922.236, "speaker": "Cory"}, {"confidence": 0.93, "end": 948.405, "track": 2, "text": "Well we're done we're not solving all the problems that wants to know it's it's baby steps and shortly there are there are types of clusters where.", "newpara": true, "start": 939.801, "speaker": "Tom Lyon"}, {"confidence": 0.95, "end": 959.246, "track": 2, "text": "They really want to see homogeneous resources whereas other other types of clusters can deal with it better but what we do is we at least let you.", "start": 948.796, "speaker": "Tom Lyon"}, {"confidence": 0.96, "end": 968.782, "track": 2, "text": "Reduce the number of types of servers that you use because now you don't need different servers just because of have different storage requirements.", "start": 960.057, "speaker": "Tom Lyon"}, {"confidence": 0.91, "end": 981.065, "track": 2, "text": "And in the future we'll be able to just aggravate other things to France since we're looking at GPU disaggregation fpga acceleration is coming along so maybe that's something that could be desegregated,", "start": 969.389, "speaker": "Tom Lyon"}, {"confidence": 0.91, "end": 985.914, "track": 2, "text": "and I'm still the network man with such that those are both entirely feasible now.", "start": 981.035, "speaker": "Tom Lyon"}, {"confidence": 0.82, "end": 990.541, "track": 0, "text": "Hola memory I would just aggravated memory at some point memory of over Network.", "newpara": true, "start": 986.317, "speaker": "Cory"}, {"confidence": 0.92, "end": 1003.803, "track": 2, "text": "That there's a lot of talk about that and the the genze push that both Dell and HP are very very much behind is supposed to address that area I'm I'm a little skeptical about how soon that happens.", "newpara": true, "start": 990.776, "speaker": "Tom Lyon"}, {"confidence": 0.95, "end": 1006.05, "track": 2, "text": "But I'm sure it'll happen someday.", "start": 1003.966, "speaker": "Tom Lyon"}, {"confidence": 0.93, "end": 1015.076, "track": 0, "text": "Okay so so we went back to the infrastructure kind of architecture a bit I want to talk about the the business impact like what does this mean,", "newpara": true, "start": 1006.279, "speaker": "Cory"}, {"confidence": 0.84, "end": 1017.492, "track": 0, "text": "fertilization that.", "start": 1015.143, "speaker": "Cory"}, {"confidence": 0.95, "end": 1033.59, "track": 0, "text": "Some companies have already started actually I'd say the majority of organizations have already started on the path of hey I need to build a big data scale-out architecture environment typically on a Hadoop type you know deployment very popular almost every organization so,", "start": 1018.039, "speaker": "Cory"}, {"confidence": 0.89, "end": 1040.903, "track": 0, "text": "what's the what's the impact of of us regulation like that looking at your technology what's the business benefit or the,", "start": 1033.398, "speaker": "Cory"}, {"confidence": 0.91, "end": 1047.705, "track": 0, "text": "just more that. Changeable operational benefit that your customers experience when moving to a drive skill type architecture.", "start": 1040.693, "speaker": "Cory"}, {"confidence": 0.76, "end": 1050.632, "track": 2, "text": "So do you want to take.", "newpara": true, "start": 1049.25, "speaker": "Tom Lyon"}, {"confidence": 0.91, "end": 1059.97, "track": 3, "text": "Yeah sure or so before we go there that I want to talk a little bit about performance because one of the things and I think that don't test on this light as likely as well as.", "newpara": true, "start": 1050.374, "speaker": "Vinod"}, {"confidence": 0.89, "end": 1069.849, "track": 3, "text": "If it's even a top of the performance of using a desegregated composable infrastructure product from drivescale with the disc sitting in the j-bar.", "start": 1060.313, "speaker": "Vinod"}, {"confidence": 0.89, "end": 1078.88, "track": 3, "text": "He's actually equal into performance of disc sitting inside the server so we run micro benchmarks and I will try to do if I owe and.", "start": 1069.801, "speaker": "Vinod"}, {"confidence": 0.79, "end": 1084.216, "track": 3, "text": "Better than Terra sword in the numbers coming almost at bar with disc sitting inside the servers.", "start": 1078.833, "speaker": "Vinod"}, {"confidence": 0.93, "end": 1094.81, "track": 3, "text": "So there's talking about business impact illustrate this by giving One customer example so we have a customer who was a small Healthcare analytics company.", "newpara": true, "start": 1084.709, "speaker": "Vinod"}, {"confidence": 0.95, "end": 1105.2, "track": 3, "text": "Are they started out as most small customers do in the public cloud and they hosted their application in AWS.", "start": 1095.129, "speaker": "Vinod"}, {"confidence": 0.63, "end": 1108.289, "track": 3, "text": "And did Anakin AWS for 2 years.", "newpara": true, "start": 1105.837, "speaker": "Vinod"}, {"confidence": 0.91, "end": 1116.347, "track": 3, "text": "What they found was they started as the cluster started growing a little bit they started finding Noisy Neighbor issues.", "newpara": true, "start": 1109.359, "speaker": "Vinod"}, {"confidence": 0.93, "end": 1124.771, "track": 3, "text": "And so they went to AWS inside do how do we solve this the only way to get to Solid Waste actually go to Dedicated ec2 instances.", "start": 1116.54, "speaker": "Vinod"}, {"confidence": 0.93, "end": 1135.396, "track": 3, "text": "As soon as I went to Dedicated ec2 the cost on a monthly basis when from somewhere around $10,000 to within 3 months ago paying $50,000 a month to AWS.", "start": 1125.048, "speaker": "Vinod"}, {"confidence": 0.9, "end": 1142.354, "track": 3, "text": "And so they came across Drive skill they said let's bring this and do a POC Roundup you'll see.", "newpara": true, "start": 1136.087, "speaker": "Vinod"}, {"confidence": 0.94, "end": 1156.896, "track": 3, "text": "And I decided that one of my grade everything over to drive scale so as of last August actually this customer Peterson's is running the entire how do beginner infrastructure and admittedly it's not very big but it's running on bream.", "newpara": true, "start": 1142.967, "speaker": "Vinod"}, {"confidence": 0.91, "end": 1164.041, "track": 3, "text": "Are with using grayscale and the cost went back down to about $10,000 a month and this is all on Dell Hardware.", "start": 1157.107, "speaker": "Vinod"}, {"confidence": 0.96, "end": 1168.307, "track": 3, "text": "Now the second part of this is even more interesting which is.", "newpara": true, "start": 1164.738, "speaker": "Vinod"}, {"confidence": 0.92, "end": 1183.793, "track": 3, "text": "Out with the servers and this with the same setup server cork on memory and the discount spending account a hyper silver their phone to do what I need using about 20% of the CPU capacity on every silver note.", "newpara": true, "start": 1169.095, "speaker": "Vinod"}, {"confidence": 0.9, "end": 1191.821, "track": 3, "text": "And so they using one user where's the provision 12 price for silver to start with and there was sufficient around there at one of their applications.", "newpara": true, "start": 1184.316, "speaker": "Vinod"}, {"confidence": 0.88, "end": 1201.97, "track": 3, "text": "And because they have so much extra CPU capacity left over there buying several more gay bars and their provisioning 40 disk drives or so or no.", "newpara": true, "start": 1192.807, "speaker": "Vinod"}, {"confidence": 0.87, "end": 1208.899, "track": 3, "text": "That would change the server but they're able to provision 42 Streisand on a whole bunch of different apps in Baton in battle.", "newpara": true, "start": 1202.463, "speaker": "Vinod"}, {"confidence": 0.94, "end": 1222.04, "track": 3, "text": "So that's one customer example right and that shut up highlights coming out of the public Cloud highlights the cost savings if you are running especially infrastructure if you're running it 24/7.", "newpara": true, "start": 1209.662, "speaker": "Vinod"}, {"confidence": 0.8, "end": 1229.51, "track": 3, "text": "You really see the benefits of running it on Prime and the advantage of running it with with the drive scale.", "start": 1222.383, "speaker": "Vinod"}, {"confidence": 0.92, "end": 1236.72, "track": 3, "text": "Is this ability to change the inner tube flexibly allocate resources on demand.", "newpara": true, "start": 1230.802, "speaker": "Vinod"}, {"confidence": 0.93, "end": 1247.657, "track": 3, "text": "One of the other things we touch up on your not from an operational perspective is that we handle I'll be able to handle you know failures are different levels much more elegantly for example for single this guy fails you can.", "start": 1237.045, "speaker": "Vinod"}, {"confidence": 0.85, "end": 1251.304, "track": 3, "text": "Swap it out and sign another drive from the J Bar.", "start": 1248.024, "speaker": "Vinod"}, {"confidence": 0.89, "end": 1258.702, "track": 3, "text": "Are we. Having to send somebody to the Datacenter E4 whole server note fails you can take it to discs and move it to another server note.", "start": 1251.623, "speaker": "Vinod"}, {"confidence": 0.93, "end": 1270.089, "track": 3, "text": "And you can assign you can increase the capacity of storage and find your server you can reduce it you can move things around all of that this is phenomenal benefit to the end user customer.", "newpara": true, "start": 1259.411, "speaker": "Vinod"}, {"confidence": 0.86, "end": 1277.234, "track": 3, "text": "On the flip side of the Honda customer collapse Nexus and I'll be there the second largest attic company in the World Behind Google doubleclick.", "newpara": true, "start": 1270.834, "speaker": "Vinod"}, {"confidence": 0.86, "end": 1284.697, "track": 3, "text": "Devara Fleet 2400 notes and running Hadoop in several data centers around the world.", "start": 1277.613, "speaker": "Vinod"}, {"confidence": 0.93, "end": 1293.308, "track": 3, "text": "And their use case is not just my previews but they're able to reduce shrink the number of service skills down to just one.", "newpara": true, "start": 1285.34, "speaker": "Vinod"}, {"confidence": 0.93, "end": 1308.012, "track": 3, "text": "They have their to customer who has a Silverback sitting next to a storage rack at one of the things that they see as an advantage of using this doing it this way is that the store was robbed can I please stay on Prim.", "start": 1293.747, "speaker": "Vinod"}, {"confidence": 0.79, "end": 1313.697, "track": 3, "text": "46 year life cycle and they can swap out the seller acts on a more frequent basis.", "newpara": true, "start": 1308.559, "speaker": "Vinod"}, {"confidence": 0.89, "end": 1325.264, "track": 0, "text": "Oh so they can take advantage of changing CPU memory kind of configurations more quickly so you actually have data persist in.", "newpara": true, "start": 1314.256, "speaker": "Cory"}, {"confidence": 0.94, "end": 1339.8, "track": 3, "text": "Yes absolutely and and then the other nice thing about this whole architecture there is that again this customer has a map reduced job that runs for about 11 12 hours a day and as soon as they're done with the map where do you still want to use the same servers for other applications.", "newpara": true, "start": 1325.259, "speaker": "Vinod"}, {"confidence": 0.94, "end": 1353.08, "track": 3, "text": "And they can simply you know take away the drives keep the cluster configuration the same but just disconnected Rise by suspending the cluster use the servers for different app and they have things like aerospike and work environment.", "start": 1339.945, "speaker": "Vinod"}, {"confidence": 0.94, "end": 1361.006, "track": 3, "text": "That's a lot of hormone homegrown apps and then the plan is to Denver instantiate the mapreduce cluster as soon as you need it again the next day.", "start": 1353.219, "speaker": "Vinod"}, {"confidence": 0.91, "end": 1368.614, "track": 3, "text": "And so it gives them a level of flexibility and able to reuse resource energy optimize use of the server resources.", "start": 1361.265, "speaker": "Vinod"}, {"confidence": 0.91, "end": 1375.41, "track": 3, "text": "I'm much more efficiently and like you said they bite by having different life cycles they can actually swap out servers.", "start": 1368.975, "speaker": "Vinod"}, {"confidence": 0.89, "end": 1382.801, "track": 3, "text": "On a more frequent basis as the CPU get more powerful without having to touch the storage.", "start": 1375.687, "speaker": "Vinod"}, {"confidence": 0.94, "end": 1390.048, "track": 0, "text": "So this is interesting cuz this is one of those that I think is it's starting to to creep into,", "newpara": true, "start": 1383.09, "speaker": "Cory"}, {"confidence": 0.9, "end": 1405.209, "track": 0, "text": "the the conversations that I have with a lot of Enterprises in Franklin just even at the conferences\nit's this concept that you know cloud is an is an excellent model for deployment for that rapid pin up and spend out of resources that as a service model,", "start": 1389.868, "speaker": "Cory"}, {"confidence": 0.96, "end": 1411.176, "track": 0, "text": "but a lot of organizations run into one cost driver challenges what you outlined with I think it was,", "start": 1405.059, "speaker": "Cory"}, {"confidence": 0.88, "end": 1421.92, "track": 0, "text": "when one of your first customer to talk to you about how they're the cost went up when they had to deal with Performance challenges in the cloud so it sounds like you've enabled that repatriation so for,", "start": 1411.02, "speaker": "Cory"}, {"confidence": 0.93, "end": 1428.266, "track": 0, "text": "organizations that may be started in the cloud you could still give them that cloud like elastic experience.", "start": 1421.722, "speaker": "Cory"}, {"confidence": 0.94, "end": 1435.843, "track": 0, "text": "But deployment on premises that's it that's a really powerful thing I don't think I fully understood.", "start": 1428.939, "speaker": "Cory"}, {"confidence": 0.87, "end": 1442.543, "track": 0, "text": "Is that something that I mean is this is is it scaring the cloud guys like it's a w I still worry about you guys.", "start": 1436.511, "speaker": "Cory"}, {"confidence": 0.88, "end": 1448.348, "track": 2, "text": "I think I think we're still the size of a gnat on the elephant's be behind there.", "newpara": true, "start": 1443.265, "speaker": "Tom Lyon"}, {"confidence": 0.96, "end": 1461.724, "track": 2, "text": "But the but yeah it's it gives people a new choice of how to do things and there's no there's no reason that you can't have some of that same kind of flexibility on Prime.", "start": 1448.643, "speaker": "Tom Lyon"}, {"confidence": 0.88, "end": 1477.276, "track": 0, "text": "Actual what's up so we talked about you can you could switch in servers and that the benefit is I'll be to see this this really flexible operating model and Idol response within kubernetes so let's talk about that.", "newpara": true, "start": 1461.442, "speaker": "Cory"}, {"confidence": 0.96, "end": 1487.401, "track": 0, "text": "Obviously most of us in technology we seen a ton of updates around kubernetes it continues to be kind of the winner of the darling in that space,", "start": 1478.141, "speaker": "Cory"}, {"confidence": 0.9, "end": 1492.923, "track": 0, "text": "what have you guys what is kubernetes media like why are you guys interested in kubernetes and what you need guy you're trying to deliver there.", "start": 1487.161, "speaker": "Cory"}, {"confidence": 0.88, "end": 1500.897, "track": 2, "text": "Well at least we see along with most of the rest of the world that kubernetes is you know the answer to a lot of questions.", "newpara": true, "start": 1494.005, "speaker": "Tom Lyon"}, {"confidence": 0.75, "end": 1505.362, "track": 2, "text": "People have more trouble agreeing on the questions not the answer I think.", "start": 1501.102, "speaker": "Tom Lyon"}, {"confidence": 0.96, "end": 1513.036, "track": 2, "text": "But we've created a persistent volume driver plugin for kubernetes as well as a scheduling plug-in so that.", "start": 1505.392, "speaker": "Tom Lyon"}, {"confidence": 0.94, "end": 1528.004, "track": 2, "text": "It's easy to have storage intensive applications in the cluster and so it dark where art is toward solving the storage problem in the cluster or not not pointing at the storage that's outside of the cluster.", "start": 1513.481, "speaker": "Tom Lyon"}, {"confidence": 0.79, "end": 1531.159, "track": 2, "text": "And the.", "start": 1528.167, "speaker": "Tom Lyon"}, {"confidence": 0.88, "end": 1539.187, "track": 2, "text": "So Francis if you're running lots of mites equal in instances or maybe you with blue day that you're running hdfs inside,", "start": 1531.153, "speaker": "Tom Lyon"}, {"confidence": 0.95, "end": 1552.401, "track": 2, "text": "kubernetes things like that. That's that's what we can really have to optimize and we get you away from being crap having the storage trapped in a single server so if a single server goes down or needs to go down,", "start": 1539.037, "speaker": "Tom Lyon"}, {"confidence": 0.95, "end": 1557.184, "track": 2, "text": "it's trivial for our stories to follow the container to a different server.", "start": 1552.389, "speaker": "Tom Lyon"}, {"confidence": 0.92, "end": 1570.933, "track": 0, "text": "House of the centuries the volume but just across your introduction versus title server that's pretty interesting sites persistence like you said for storage and since it work loads so other kind of sorry but no go ahead.", "newpara": true, "start": 1557.473, "speaker": "Cory"}, {"confidence": 0.94, "end": 1581.653, "track": 3, "text": "Yeah the other the other point about about that is that it's not just about storage persistence alone because there's lots of other Technologies reclaim storage persistent but it's about persistently performance because.", "newpara": true, "start": 1570.681, "speaker": "Vinod"}, {"confidence": 0.9, "end": 1590.763, "track": 3, "text": "We give you the same performance of direct attached storage of Rod disk drives inside the kubernetes volume attach to a party.", "start": 1581.611, "speaker": "Vinod"}, {"confidence": 0.91, "end": 1596.568, "track": 3, "text": "It's hazardous for local to the server on the container and you don't get that great most check storage.", "start": 1591.04, "speaker": "Vinod"}, {"confidence": 0.9, "end": 1603.111, "track": 0, "text": "So one of the things you talked about in terms of new technology just starting to look at is,", "newpara": true, "start": 1597.001, "speaker": "Cory"}, {"confidence": 0.97, "end": 1621.854, "track": 0, "text": "emergent Texas around like gpus and I think you said at BJ's in the otherwise clearly that use cash for those is typically around machine learning deep learning it's also about a little bit about what you're doing in the Deep learning machine learning space to empower service similar is also have seen in traditional bigdatabeard with these new emerging use cases.", "start": 1602.908, "speaker": "Cory"}, {"confidence": 0.98, "end": 1630.242, "track": 2, "text": "Well we haven't done anything specific for gpus yet but it turns out,", "newpara": true, "start": 1623.176, "speaker": "Tom Lyon"}, {"confidence": 0.94, "end": 1642.303, "track": 2, "text": "that a lot of the people in the Deep learning space are using hdfs because the Deep learning workload is pretty similar to an analytical workload\nand in fact,", "start": 1630.201, "speaker": "Tom Lyon"}, {"confidence": 0.94, "end": 1653.245, "track": 2, "text": "there's a lot of new servers that are GPU optimized and the endless blog I wrote a blog entry about the Dell server that's been announced that,", "start": 1642.273, "speaker": "Tom Lyon"}, {"confidence": 0.95, "end": 1662.084, "track": 2, "text": "supports for gpus and I want to box and it's a very nice high-density GPU solution but now there's no room for any storage in that box.", "start": 1653.192, "speaker": "Tom Lyon"}, {"confidence": 0.9, "end": 1672.745, "track": 0, "text": "NOAA number for sores but have you guys seen the power consumption of a for GPU box like I don't know if we have enough power in the racks and a more than three or four of those in most people's.", "newpara": true, "start": 1662.157, "speaker": "Cory"}, {"confidence": 0.88, "end": 1678.531, "track": 2, "text": "Yeah that's that's another big problem,", "newpara": true, "start": 1672.445, "speaker": "Tom Lyon"}, {"confidence": 0.92, "end": 1686.68, "track": 2, "text": "a lot of people would then have cheap used servers tied to other hdfs servers run a traditional Drive attached,", "start": 1678.448, "speaker": "Tom Lyon"}, {"confidence": 0.87, "end": 1694.882, "track": 2, "text": "what we say is now you just run the hdfs on the same note same few servers and attach the hard drives with our technology.", "start": 1686.596, "speaker": "Tom Lyon"}, {"confidence": 0.93, "end": 1702.874, "track": 0, "text": "So just bring hdfs to the GPO gpu-accelerated workload rather than bring the workload to the data.", "newpara": true, "start": 1694.618, "speaker": "Cory"}, {"confidence": 0.97, "end": 1708.853, "track": 2, "text": "You get the benefits of having a single single type of server doing all the work.", "newpara": true, "start": 1703.554, "speaker": "Tom Lyon"}, {"confidence": 0.96, "end": 1714.658, "track": 2, "text": "That's kind of what we have in common with the hyper-converged space as well,", "start": 1709.545, "speaker": "Tom Lyon"}, {"confidence": 0.92, "end": 1727.319, "track": 2, "text": "listen and hyper-converged you have a single pool of CPUs doing both the computer and the storage and we we like that we don't want to waste these incredibly fast CPU is just on story tasks.", "start": 1714.64, "speaker": "Tom Lyon"}, {"confidence": 0.95, "end": 1742.336, "track": 0, "text": "So are there are there other I'm thinking things like in Via me and another kind of acceleration Technologies are is there anything interesting around Envia me that the drive skill is enabling or has plans to enable.", "newpara": true, "start": 1727.494, "speaker": "Cory"}, {"confidence": 0.95, "end": 1750.045, "track": 2, "text": "Haha yeah that's kind of our current activity we're not ready to announce details yet.", "newpara": true, "start": 1742.264, "speaker": "Tom Lyon"}, {"confidence": 0.88, "end": 1753.717, "track": 0, "text": "Call darn. I got you.", "newpara": true, "start": 1750.406, "speaker": "Cory"}, {"confidence": 0.94, "end": 1763.277, "track": 2, "text": "You could you could guess a lot and the industries actually doing a fair amount of stuff there with the nvme over Fabrics standards activity.", "newpara": true, "start": 1753.471, "speaker": "Tom Lyon"}, {"confidence": 0.92, "end": 1772.411, "track": 2, "text": "And so that that's a good way to think about the data plan is that you're you're now able to move the the NBA NBA ssds out of out of the box.", "start": 1763.488, "speaker": "Tom Lyon"}, {"confidence": 0.72, "end": 1775.572, "track": 2, "text": "And our Valley rad really comes in.", "start": 1772.52, "speaker": "Tom Lyon"}, {"confidence": 0.93, "end": 1787.241, "track": 2, "text": "The rest of the problem the other the other 90% of the problem that's not the date of data plan about how do you discover manage and secure all this stuff in a way that makes it really usable.", "start": 1775.572, "speaker": "Tom Lyon"}, {"confidence": 0.84, "end": 1793.797, "track": 0, "text": "Yeah so tell me in your wrong and you've got a kind of a neat background I'm curious to hear.", "newpara": true, "start": 1787.254, "speaker": "Cory"}, {"confidence": 0.9, "end": 1804.037, "track": 0, "text": "Two I got two questions for you one when you look at this you know it drives good what you're doing what your plans are I'm curious what do you think or the next big sort of hurdles that,", "start": 1793.816, "speaker": "Cory"}, {"confidence": 0.87, "end": 1810.082, "track": 0, "text": "that the industry needs to to to tackle in order for us to be successful in achieving the goals of,", "start": 1804.398, "speaker": "Cory"}, {"confidence": 0.97, "end": 1819.865, "track": 0, "text": "machine learning deep learning data analytics at the scale we need for the future but like what are things that you're working on that you're interested in that you're paying attention to in this ecosystem.", "start": 1809.848, "speaker": "Cory"}, {"confidence": 0.94, "end": 1828.452, "track": 2, "text": "Wow\nthat's a tough question to answer because I'm I've always been kind of a.", "newpara": true, "start": 1820.538, "speaker": "Tom Lyon"}, {"confidence": 0.96, "end": 1843.486, "track": 2, "text": "Kind of guy who will read read anything and try to absorb what's going on but yeah I've been paying a lot of attention to the analytics world and then deep learning his kind of sprouted out of that and I certainly don't understand the math behind it.", "start": 1828.981, "speaker": "Tom Lyon"}, {"confidence": 0.93, "end": 1852.662, "track": 2, "text": "But I think some of the systems issues are the same same old thing I think from the industry's perspective as a whole there still a lot of.", "start": 1843.871, "speaker": "Tom Lyon"}, {"confidence": 0.95, "end": 1858.888, "track": 2, "text": "Work to do to make gpus and fpgas really usable in.", "start": 1852.795, "speaker": "Tom Lyon"}, {"confidence": 0.85, "end": 1865.473, "track": 2, "text": "In your broad scale Computing context so I think that's where there's going to be a lot of action.", "start": 1859.855, "speaker": "Tom Lyon"}, {"confidence": 0.89, "end": 1869.313, "track": 0, "text": "Absolutely and then I got to ask you if you had a.", "newpara": true, "start": 1865.516, "speaker": "Cory"}, {"confidence": 0.93, "end": 1877.149, "track": 0, "text": "Some some hands and some really interesting technology from Sun and and and others around like Epsilon Networks,", "start": 1869.548, "speaker": "Cory"}, {"confidence": 0.91, "end": 1886.95, "track": 0, "text": "how did you end up getting to starting to work on these data analytics problems cuz it would those work those are clearly pretty infrastructure oriented you know.", "start": 1876.993, "speaker": "Cory"}, {"confidence": 0.89, "end": 1894.942, "track": 0, "text": "Developments this is very much a it's still infrastructure was totally in and out at outside the the industry right before how did you get into this.", "start": 1886.806, "speaker": "Cory"}, {"confidence": 0.94, "end": 1905.572, "track": 2, "text": "Well it's not that far off I might my co-founder Satya nishtala and I we were both at Cisco working on the the UCS product line and so.", "newpara": true, "start": 1894.642, "speaker": "Tom Lyon"}, {"confidence": 0.93, "end": 1916.46, "track": 2, "text": "You don't see that you see you see us as kind of the gold plated silver line originally it was just the blade servers but not now has rack servers and I like to say it was,", "start": 1905.855, "speaker": "Tom Lyon"}, {"confidence": 0.89, "end": 1924.122, "track": 2, "text": "very high-end Hardware to solve the problem of running lots of Fred joyal software.", "start": 1916.377, "speaker": "Tom Lyon"}, {"confidence": 0.92, "end": 1938.087, "track": 2, "text": "But in the meantime all these analytical systems like like a dupe and many other scale-out systems have come along with what you think of it as anti fragile software where they're they're very resilient on their own.", "start": 1925.186, "speaker": "Tom Lyon"}, {"confidence": 0.98, "end": 1940.593, "track": 2, "text": "So now you don't need that kind of Hardware anymore.", "start": 1938.328, "speaker": "Tom Lyon"}, {"confidence": 0.92, "end": 1949.264, "track": 2, "text": "It's a week we are at Cisco looking at this just booming growth of the commodity server market and wondering how the heck.", "start": 1941.326, "speaker": "Tom Lyon"}, {"confidence": 0.91, "end": 1959.389, "track": 2, "text": "Are you off work where is that going to go and how the heck does one add value to that kind of\nmarket and saw this this is our answer drive to go.", "start": 1949.475, "speaker": "Tom Lyon"}, {"confidence": 0.97, "end": 1962.518, "track": 0, "text": "Nice and you guys have been in business for how long now.", "newpara": true, "start": 1959.191, "speaker": "Cory"}, {"confidence": 0.8, "end": 1964.329, "track": 2, "text": "About four years.", "newpara": true, "start": 1962.274, "speaker": "Tom Lyon"}, {"confidence": 0.84, "end": 1967.471, "track": 0, "text": "About 4 years and how big of an organization are you guys now.", "newpara": true, "start": 1964.079, "speaker": "Cory"}, {"confidence": 0.67, "end": 1971.492, "track": 2, "text": "I'm still small\n225 fish.", "newpara": true, "start": 1967.496, "speaker": "Tom Lyon"}, {"confidence": 0.99, "end": 1975.343, "track": 0, "text": "Awesome very cool,", "newpara": true, "start": 1973.313, "speaker": "Cory"}, {"confidence": 0.97, "end": 1992.596, "track": 0, "text": "well guys I appreciate the time you spent with us it sounds like software composable infrastructure delivers some really interesting value back to organizations trying to deploy scale-out applications in a flexible and I draw way certainly interesting as you said customers looking at repatriating,", "start": 1975.116, "speaker": "Cory"}, {"confidence": 0.97, "end": 2011.302, "track": 0, "text": "those were closed from the cloud where cost or noisy neighbors have become a concern so that's super interesting I'm curious to hear from you Tom and you've been owed are you guys involved in the The Big Data conference circuit are you attending where could we find you guys in the public domain we could learn more.", "start": 1992.38, "speaker": "Cory"}, {"confidence": 0.93, "end": 2025.038, "track": 2, "text": "Yeah we we usually go to the the Big Data conferences although what we're saying is that the the attendance and those conferences are shifted more and more to the data sign,", "newpara": true, "start": 2012.174, "speaker": "Tom Lyon"}, {"confidence": 0.78, "end": 2033.661, "track": 2, "text": "far fewer infrastructure people\nand told of the conferences are becoming somewhat less relevant for us and and.", "start": 2025.105, "speaker": "Tom Lyon"}, {"confidence": 0.78, "end": 2034.899, "track": 0, "text": "She bring up a good point I want to I want to.", "newpara": true, "start": 2033.361, "speaker": "Cory"}, {"confidence": 0.94, "end": 2043.787, "track": 0, "text": "Press pause there cuz that's something really interesting we've heard some we've heard some similar things and I'm curious because a lot of our passion is around those folks that bridge the gap between,", "start": 2034.792, "speaker": "Cory"}, {"confidence": 0.96, "end": 2059.332, "track": 0, "text": "like the data scientist achieving their objectives and the Enterprise infrastructure folks like how do you deploy in run these things right much the job of the data engineer the it practitioner archeops or site reliability engineer responsible for,", "start": 2043.589, "speaker": "Cory"}, {"confidence": 0.87, "end": 2066.249, "track": 0, "text": "designing and deployment systems where are those guys hiding those guys used to go to this conference so I totally agree with you.", "start": 2059.122, "speaker": "Cory"}, {"confidence": 0.98, "end": 2070.978, "track": 0, "text": "I'm having a hard time personally finding out where those folks go and where they go learn.", "start": 2066.309, "speaker": "Cory"}, {"confidence": 0.93, "end": 2081.458, "track": 2, "text": "But we've had much more success with recently is the vendor conferences right so we're really looking forward to the Dell EMC World in May,", "newpara": true, "start": 2070.684, "speaker": "Tom Lyon"}, {"confidence": 0.89, "end": 2087.599, "track": 2, "text": "sorry. That's where the it Ops my tech guys go as far as far as we can tell.", "start": 2081.422, "speaker": "Tom Lyon"}, {"confidence": 0.93, "end": 2098.794, "track": 0, "text": "Yeah so it looks like you guys have relationships with Dell EMC I think Cisco probably based on your your your your password those guys any other big Enterprise technology vendors are you great Partnerships with.", "newpara": true, "start": 2087.349, "speaker": "Cory"}, {"confidence": 0.88, "end": 2108.18, "track": 2, "text": "We're in discussions with pretty much everyone you could name but yeah we're farthest to head right now with Ellen Sisco.", "newpara": true, "start": 2098.518, "speaker": "Tom Lyon"}, {"confidence": 0.93, "end": 2121.262, "track": 0, "text": "Are excellent well guys I want to say thank you again I want to shift gears here we've had a good chance to learn a little bit about you and your technology the drive skills bring in the market very interesting stuff now we want to talk about.", "newpara": true, "start": 2108.679, "speaker": "Cory"}, {"confidence": 0.85, "end": 2129.434, "track": 0, "text": "You personally and we like the selection called rapid fire so the way this is going to work, the note is.", "start": 2121.142, "speaker": "Cory"}, {"confidence": 0.96, "end": 2146.812, "track": 0, "text": "The way to work is I will ask each of you one question and we'll just do this will go Tom venuto each time Tom you talked more so you get to I think you out ring venoso you get to go first so we'll ask the same question Tom just give us the first answer that comes to mind and then vanilla you give your answers that sound good.", "start": 2129.591, "speaker": "Cory"}, {"confidence": 0.97, "end": 2148.477, "track": 2, "text": "Okay.", "newpara": true, "start": 2147.347, "speaker": "Tom Lyon"}, {"confidence": 0.98, "end": 2154.558, "track": 0, "text": "Alright cool alright so here we go what year do you think Skynet will go online.", "newpara": true, "start": 2148.724, "speaker": "Cory"}, {"confidence": 0.9, "end": 2161.072, "track": 2, "text": "Way too soon 2030.", "newpara": true, "start": 2154.564, "speaker": "Tom Lyon"}, {"confidence": 0.74, "end": 2161.961, "track": 0, "text": "All right vanilla.", "newpara": true, "start": 2160.772, "speaker": "Cory"}, {"confidence": 0.81, "end": 2163.541, "track": 3, "text": "I think 2050.", "newpara": true, "start": 2162.022, "speaker": "Vinod"}, {"confidence": 0.92, "end": 2176.22, "track": 0, "text": "2050 are a little further out. I personally think it's already online and I'm afraid of it so I want to say nice things if you bought me a book or if you want me to book what would it be your what's the name of the best book you've read recently.", "newpara": true, "start": 2163.722, "speaker": "Cory"}, {"confidence": 0.93, "end": 2188.323, "track": 2, "text": "For me\nprobably the most outstanding book of the past 5 years I read is this cutting for stone\njust kind of a medical.", "newpara": true, "start": 2177.705, "speaker": "Tom Lyon"}, {"confidence": 0.95, "end": 2199.211, "track": 2, "text": "Medical thing Abraham varghese es father he's he's a Stanford doctor and a professor and author so very interesting.", "start": 2188.485, "speaker": "Tom Lyon"}, {"confidence": 0.59, "end": 2201.272, "track": 0, "text": "Vinod.", "newpara": true, "start": 2200.005, "speaker": "Cory"}, {"confidence": 0.85, "end": 2209.709, "track": 3, "text": "Where are you like in recently ever had that's been treating The God Delusion by Richard Dawkins I don't know if I'd recommend it to everybody but I like it.", "newpara": true, "start": 2201.221, "speaker": "Vinod"}, {"confidence": 0.91, "end": 2215.208, "track": 0, "text": "All right what genre of music are you currently enjoying.", "newpara": true, "start": 2209.83, "speaker": "Cory"}, {"confidence": 0.86, "end": 2220.868, "track": 2, "text": "I'm at I grew up in the early 80s so I'm a new way of kind of guy.", "newpara": true, "start": 2215.214, "speaker": "Tom Lyon"}, {"confidence": 0.79, "end": 2223.59, "track": 0, "text": "New Wave killer dude what about you vanilla.", "newpara": true, "start": 2220.851, "speaker": "Cory"}, {"confidence": 0.96, "end": 2231.066, "track": 3, "text": "Well there's an Indian form of singing call Sufi singing or Sufi songs and that's what I'm listening to now days.", "newpara": true, "start": 2223.669, "speaker": "Vinod"}, {"confidence": 0.79, "end": 2235.288, "track": 0, "text": "You do I good you sing it while your self could we get a performance.", "newpara": true, "start": 2230.964, "speaker": "Cory"}, {"confidence": 0.65, "end": 2240.157, "track": 0, "text": "Pokemon out of been brilliant all right.", "start": 2235.929, "speaker": "Cory"}, {"confidence": 0.31, "end": 2241.142, "track": 2, "text": "Sweden.", "newpara": true, "start": 2239.857, "speaker": "Tom Lyon"}, {"confidence": 0.95, "end": 2249.616, "track": 0, "text": "That's right he doesn't forget to take it back to the but I know he spend some time in Japan or overseas we're going to get him in a karaoke bar some point.", "newpara": true, "start": 2240.891, "speaker": "Cory"}, {"confidence": 0.88, "end": 2262.613, "track": 2, "text": "Can it can I tell you something cool to have a node he spent a lot of time in the Merchant Marine sailing those huge huge commercial cargo ships so he's our secret weapon with the container strategy.", "newpara": true, "start": 2249.316, "speaker": "Tom Lyon"}, {"confidence": 0.91, "end": 2273.405, "track": 0, "text": "Hahaha that's awesome so I'm curious Merchant Marines actually don't know enough about what the merchant marines do I should you do you go to boot camp for merchant marines are you. Lee and Salem.", "newpara": true, "start": 2262.493, "speaker": "Cory"}, {"confidence": 0.9, "end": 2284.714, "track": 3, "text": "No motion Marine Training Academy but you got to realize this I don't know people are listening to this but 90% of the world's cargo goes on ships\nacross the web so that's what I was working on for 12 years.", "newpara": true, "start": 2273.328, "speaker": "Vinod"}, {"confidence": 0.87, "end": 2292.502, "track": 0, "text": "Very cool so you have a tight connection the containers I like that time that's funny alright so what is your favorite piece.", "newpara": true, "start": 2284.841, "speaker": "Cory"}, {"confidence": 0.96, "end": 2301.936, "track": 0, "text": "Of what I refer to as generally useless Technologies something that you may be a personal piece of tech that you think it's cool but you get that it's kind of dumb.", "start": 2292.791, "speaker": "Cory"}, {"confidence": 0.97, "end": 2305.313, "track": 2, "text": "Oh my God.", "newpara": true, "start": 2303.686, "speaker": "Tom Lyon"}, {"confidence": 0.9, "end": 2315.745, "track": 2, "text": "Boy there's there's been so many cool toys and you're like 15 years ago is Furbies.", "newpara": true, "start": 2308.992, "speaker": "Tom Lyon"}, {"confidence": 0.24, "end": 2318.041, "track": 0, "text": "Surveys.", "newpara": true, "start": 2315.812, "speaker": "Cory"}, {"confidence": 0.97, "end": 2322.536, "track": 2, "text": "Which are really cool until until they start waking you up accidentally at 3 in the morning.", "newpara": true, "start": 2317.741, "speaker": "Tom Lyon"}, {"confidence": 0.94, "end": 2336.14, "track": 0, "text": "I'll tell you what else does that Amazon's Echo Show if you if you lose power in the middle of the night and then it comes back on that thing had that that waking cycle I think that thing is the worst piece of technology.", "newpara": true, "start": 2322.26, "speaker": "Cory"}, {"confidence": 0.72, "end": 2337.678, "track": 0, "text": "Skills me.", "start": 2336.531, "speaker": "Cory"}, {"confidence": 0.92, "end": 2339.601, "track": 0, "text": "Vinod what about you.", "start": 2338.55, "speaker": "Cory"}, {"confidence": 0.83, "end": 2342.257, "track": 3, "text": "Reminders the iPhone I'm really tired of it.", "newpara": true, "start": 2339.351, "speaker": "Vinod"}, {"confidence": 0.97, "end": 2356.751, "track": 0, "text": "Man my my wife just bought a book about how you're something about how your phones changed you and it's basically just a doomsday about how your phone is making you a moron so I think you're probably right Tom what is your biggest personal Money Pit right now.", "newpara": true, "start": 2342.282, "speaker": "Cory"}, {"confidence": 0.78, "end": 2362.43, "track": 2, "text": "Oh houses have two houses.", "newpara": true, "start": 2356.878, "speaker": "Tom Lyon"}, {"confidence": 0.73, "end": 2365.446, "track": 0, "text": "Got your head so pretty popular heads or vanilla how about you.", "newpara": true, "start": 2360.832, "speaker": "Cory"}, {"confidence": 0.85, "end": 2369.647, "track": 3, "text": "I was going to say the same thing I have two and a half actually in bed.", "newpara": true, "start": 2365.146, "speaker": "Vinod"}, {"confidence": 0.96, "end": 2372.819, "track": 0, "text": "Please tell me they're not all in the Bay Area.", "newpara": true, "start": 2370.584, "speaker": "Cory"}, {"confidence": 0.83, "end": 2377.074, "track": 3, "text": "No one won in the Bay Area I want in Mexico and wanted India.", "newpara": true, "start": 2372.736, "speaker": "Vinod"}, {"confidence": 0.92, "end": 2385.174, "track": 0, "text": "You poor soul alright well so I'm guessing you've been everywhere interesting but I guess time are you going anywhere really interesting soon.", "newpara": true, "start": 2377.218, "speaker": "Cory"}, {"confidence": 0.92, "end": 2391.165, "track": 2, "text": "No they keep me pretty busy here.", "newpara": true, "start": 2385.283, "speaker": "Tom Lyon"}, {"confidence": 0.91, "end": 2396.099, "track": 0, "text": "Good for you\nvinod how about you and you were interested in your cool houses in Mexico and India or anything cool.", "newpara": true, "start": 2389.261, "speaker": "Cory"}, {"confidence": 0.94, "end": 2403.051, "track": 3, "text": "It was a plan is to go to Mexico more often but the coolest place I've been to recently I think is Amsterdam.", "newpara": true, "start": 2395.84, "speaker": "Vinod"}, {"confidence": 0.88, "end": 2410.995, "track": 0, "text": "Answer that's a great town alright so last question Tom what show are you currently binging on.", "newpara": true, "start": 2403.316, "speaker": "Cory"}, {"confidence": 0.93, "end": 2421.991, "track": 2, "text": "Oh this is embarrassing I've been I've been bitten I've been through all the Star Trek's but now I'm currently on Andromeda if you remember that one.", "newpara": true, "start": 2411.62, "speaker": "Tom Lyon"}, {"confidence": 0.93, "end": 2428.367, "track": 0, "text": "Oh wow you are full-on brother I appreciate that but no how about you can you out nerd that.", "newpara": true, "start": 2421.848, "speaker": "Cory"}, {"confidence": 0.95, "end": 2436.772, "track": 3, "text": "Yeah I know I've been going backwards a little bit I've been binging on Frasier and it's unfortunate that John Mahoney just passed away a couple of days ago.", "newpara": true, "start": 2428.085, "speaker": "Vinod"}, {"confidence": 0.94, "end": 2445.841, "track": 0, "text": "Oh did he really I didn't know that I was just about to do an ensemble of tossed salad and scrambled eggs but I guess I won't now that you took it down the sad patch.", "newpara": true, "start": 2436.672, "speaker": "Cory"}, {"confidence": 0.92, "end": 2457.247, "track": 0, "text": "Alright will Tom and vanilla. Where can we find you online are you guys on the Tweeter machine or on the on the the YouTube or anything like that.", "start": 2446.996, "speaker": "Cory"}, {"confidence": 0.65, "end": 2463.484, "track": 2, "text": "Yeah I'm on I'm on Twitter AKA underscore pugs\nwhich.", "newpara": true, "start": 2457.043, "speaker": "Tom Lyon"}, {"confidence": 0.89, "end": 2466.008, "track": 0, "text": "So I can ask what's that about pugs you really in the pug dogs.", "newpara": true, "start": 2463.184, "speaker": "Cory"}, {"confidence": 0.93, "end": 2472.258, "track": 2, "text": "I know it's actually a short for Pugsley from The Addams Family and that's pretty much what I look like in high school.", "newpara": true, "start": 2466.123, "speaker": "Tom Lyon"}, {"confidence": 0.91, "end": 2482.076, "track": 0, "text": "I did not make that connection I was totally thinking you just had like a house full of bugs\nthat's awesome vanilla. How about you.", "newpara": true, "start": 2474.267, "speaker": "Cory"}, {"confidence": 0.9, "end": 2493.86, "track": 3, "text": "Yeah I'm on Twitter at SKB know that thang and Linkedin and\nI don't do Facebook anymore.", "newpara": true, "start": 2482.077, "speaker": "Vinod"}, {"confidence": 0.86, "end": 2497.099, "track": 0, "text": "The things are just burning trash pile in it.", "newpara": true, "start": 2494.041, "speaker": "Cory"}, {"confidence": 0.92, "end": 2504.749, "track": 0, "text": "We're guys thank you so much for the time we enjoyed the conversation for those of you listening please go out check out driving school.com.", "start": 2497.869, "speaker": "Cory"}, {"confidence": 0.9, "end": 2511.154, "track": 0, "text": "Brilliant piece of technology hang out with the guys when they come into 10 some of the cool technology conferences that,", "start": 2504.779, "speaker": "Cory"}, {"confidence": 0.95, "end": 2520.516, "track": 0, "text": "the vendors are putting on what you knew that's where I T practitioners interested in Big Data were thanks so much make sure you wrote Us in iTunes and subscribe to our mailing list.", "start": 2510.974, "speaker": "Cory"}, {"confidence": 0.95, "end": 2525.774, "track": 0, "text": "Have a good day\nalright folks hang on one second I'm going to hit the.", "start": 2520.571, "speaker": "Cory"}]