[{"confidence": 0.94, "end": 11.026, "track": 0, "text": "Alright so we're officially recording and we are at Squaw Valley California the beautiful Squaw Resort.", "newpara": true, "start": 2.212, "speaker": "BigDataBeard"}, {"confidence": 0.88, "end": 14.728, "track": 0, "text": "This is Corey from the bigdatabeard team on joined by.", "start": 11.351, "speaker": "BigDataBeard"}, {"confidence": 0.91, "end": 22.93, "track": 0, "text": "Brett Roberts real life companies doing real life things with data.", "start": 15.227, "speaker": "BigDataBeard"}, {"confidence": 0.93, "end": 32.677, "track": 0, "text": "I really transform interesting Industries in Squaw Valley Resort I honestly I don't know if it gets any cooler or more interesting than skiing and ski resorts so I'm excited to have.", "start": 23.123, "speaker": "BigDataBeard"}, {"confidence": 0.88, "end": 40.236, "track": 0, "text": "RJ technologist leading VP of VP of Technology near Squaw and Tom who's the VP of marketing.", "start": 32.864, "speaker": "BigDataBeard"}, {"confidence": 0.91, "end": 44.407, "track": 0, "text": "And appreciate you having us come out with his voice.", "start": 40.501, "speaker": "BigDataBeard"}, {"confidence": 0.81, "end": 45.585, "track": 2, "text": "Thanks Guardian really well.", "newpara": true, "start": 44.125, "speaker": "Tom"}, {"confidence": 0.94, "end": 47.345, "track": 1, "text": "Yeah great thank you.", "newpara": true, "start": 45.741, "speaker": "RJ"}, {"confidence": 0.76, "end": 53.028, "track": 0, "text": "So where it's interesting the recordings about Rex Lee on the Luna telephone until how do you say.", "newpara": true, "start": 47.376, "speaker": "BigDataBeard"}, {"confidence": 0.42, "end": 53.883, "track": 2, "text": "Trenitalia that's right.", "newpara": true, "start": 52.784, "speaker": "Tom"}, {"confidence": 0.76, "end": 55.956, "track": 0, "text": "Furniture are at where's that come from.", "newpara": true, "start": 53.633, "speaker": "BigDataBeard"}, {"confidence": 0.84, "end": 60.241, "track": 2, "text": "Funicular.", "newpara": true, "start": 55.957, "speaker": "Tom"}, {"confidence": 0.93, "end": 71.754, "track": 0, "text": "Virtual so as we go up the mountain I wanted to do just a quick level setting on Squaw Valley it's a beautiful place been here a long time has a great history till sold about Squad how to get started.", "newpara": true, "start": 60.055, "speaker": "BigDataBeard"}, {"confidence": 0.91, "end": 82.57, "track": 2, "text": "I'm so we're at Squaw Valley and in Northern California right on the edge almost of Lake Tahoe and he's a notable thing about Squaw Valley especially in this year is the home of the 1960 Winter Olympics,", "newpara": true, "start": 71.586, "speaker": "Tom"}, {"confidence": 0.93, "end": 96.133, "track": 2, "text": "and you see that throughout the resort so you see Rings you know here and there and it'll work exceptionally we're really proud of that Heritage share beyond that has Bend Resorts certainly in California.", "start": 82.553, "speaker": "Tom"}, {"confidence": 0.88, "end": 102.905, "track": 2, "text": "And I think remain so with you a tremendous number of different athletes and Olympians have come out of this place so it's been great and then you know.", "start": 96.199, "speaker": "Tom"}, {"confidence": 0.89, "end": 110.735, "track": 2, "text": "Part of you know the new history of squad I guess is you know we actually can buy with Alpine Meadows which in adjacent Resort 2011.", "start": 103.212, "speaker": "Tom"}, {"confidence": 0.9, "end": 123.937, "track": 2, "text": "I'm at are in the process of trying to link those two together through through a gondola that will you know run between the two it's a you know incredible expanding the train offering here so it's going to be great we're pretty excited about that and that I mean you know.", "start": 110.88, "speaker": "Tom"}, {"confidence": 0.92, "end": 131.899, "track": 2, "text": "Even more recent news is we've actually then combined with a whole new company that has resorts in Southern California Colorado,", "start": 124.045, "speaker": "Tom"}, {"confidence": 0.91, "end": 136.916, "track": 2, "text": "are the New England areas and Colorado so it's pretty exciting time with Squaw Valley Alpine Meadows.", "start": 131.815, "speaker": "Tom"}, {"confidence": 0.91, "end": 151.254, "track": 0, "text": "So scale is actually interesting so corporate scales great going to bring a lot more power and probably more interested digital transformation that's cool so they look super cool as their aspirations for the company in and for this mountain for future Olympic kibitz.", "newpara": true, "start": 136.616, "speaker": "BigDataBeard"}, {"confidence": 0.83, "end": 158.098, "track": 2, "text": "Will there actually is a bid on going or starting.", "newpara": true, "start": 152.09, "speaker": "Tom"}, {"confidence": 0.98, "end": 158.952, "track": 1, "text": "For your ears only.", "newpara": true, "start": 157.852, "speaker": "RJ"}, {"confidence": 0.95, "end": 174.713, "track": 2, "text": "I mean honestly it would be great I mean you know I think it would be something that wouldn't just be centered here like it had been in the past but we'd be happy participant and I think it would be really an incredible incredible event for the region is Hall so that be exciting.", "newpara": true, "start": 160.527, "speaker": "Tom"}, {"confidence": 0.93, "end": 179.028, "track": 0, "text": "So VP of marketing and sales I'm guessing one of your roles and as we talked before.", "newpara": true, "start": 174.522, "speaker": "BigDataBeard"}, {"confidence": 0.92, "end": 191.353, "track": 0, "text": "Really excited about customer experience and making sure that that people know this in a credible resort to be part of Tulsa what about this this this move towards technology and specifically around the app.", "start": 179.185, "speaker": "BigDataBeard"}, {"confidence": 0.93, "end": 196.22, "track": 0, "text": "And why that's so important why your location drive so much of that.", "start": 191.491, "speaker": "BigDataBeard"}, {"confidence": 0.94, "end": 202.608, "track": 2, "text": "Well guess experiences is something that you know me and my team think about everyday.", "newpara": true, "start": 196.767, "speaker": "Tom"}, {"confidence": 0.91, "end": 213.869, "track": 2, "text": "And specific to your were lucky in that were you know we're pretty proximate to Silicon Valley San Francisco or so much you know the leading technology it comes out and it is being built right.", "start": 202.975, "speaker": "Tom"}, {"confidence": 0.94, "end": 218.141, "track": 2, "text": "So for us it gives us I think better maybe.", "start": 214.079, "speaker": "Tom"}, {"confidence": 0.93, "end": 230.255, "track": 2, "text": "I don't know if it gives us a better ability to to get it but I think we know more about what's happening we just get exposed to it so much more frequently out here and he know that's really translated into our strategy around our mobile app.", "start": 218.586, "speaker": "Tom"}, {"confidence": 0.93, "end": 238.62, "track": 2, "text": "Which you know we've always understood that there's there's any more to skiing than just the actual skiing so we've looked at is how do you take.", "start": 230.418, "speaker": "Tom"}, {"confidence": 0.97, "end": 243.523, "track": 2, "text": "And you technology to make that user experience you know that much better how do you do.", "start": 238.747, "speaker": "Tom"}, {"confidence": 0.95, "end": 251.756, "track": 2, "text": "Make that experience better before they get to the resort while they're at the resort and when they leave the resort and so what we really try to do is use our app.", "start": 243.56, "speaker": "Tom"}, {"confidence": 0.95, "end": 255.205, "track": 2, "text": "As a way to accomplish that so friends just to give you some examples right.", "start": 251.786, "speaker": "Tom"}, {"confidence": 0.93, "end": 266.995, "track": 2, "text": "You're on your way up you can understand what lifts are opening what things are happening what wait lines look like you know will notify you via and at push if there's delays on you know roads that are coming into the resort.", "start": 255.241, "speaker": "Tom"}, {"confidence": 0.95, "end": 274.59, "track": 2, "text": "You can start really planning your day so we're trying to create a a good experience on the front and right.", "start": 267.175, "speaker": "Tom"}, {"confidence": 0.93, "end": 288.237, "track": 2, "text": "Within the time when you're at the resorts we have functionality where you can build groups with your friends so you can see where your friends are along the mountain which I mean you know of anyone that skied for a bit I mean it's always like hey look I'm going to meet you at Katy.", "start": 275.21, "speaker": "Tom"}, {"confidence": 0.91, "end": 298.02, "track": 2, "text": "And then have to go over the top of the Katie the other half at the bottom of the Katy and they're like Woodward we decide to meet you know always happens every time so we really wanted to create.", "newpara": true, "start": 288.538, "speaker": "Tom"}, {"confidence": 0.95, "end": 310.248, "track": 2, "text": "A way for people to more effectively be able to ski with a group and then also really participate with each other ski days right so you know you see how many runs your your group ski you see how many vertical feet you see where they ski.", "start": 298.044, "speaker": "Tom"}, {"confidence": 0.94, "end": 320.121, "track": 2, "text": "It's what creates this this more of an interaction with the group where it's like man that was a great day and you get to actually relive it and tell anyone actually like go back and understand it so.", "start": 310.297, "speaker": "Tom"}, {"confidence": 0.93, "end": 325.992, "track": 2, "text": "You know we tried to come to take that through and then at the end of the day when you're leaving just a reminder you know thanks for visiting.", "start": 320.236, "speaker": "Tom"}, {"confidence": 0.86, "end": 333.149, "track": 2, "text": "You know really try and then talk to RJ about the Soviet Morris how does this all play in a Commerce where then you're giving people the ability to have.", "start": 326.13, "speaker": "Tom"}, {"confidence": 0.91, "end": 345.527, "track": 2, "text": "You know a better product better design for them at a cheaper rate at you know and really being with Target the right people so our views Technologies through and through a guest experience we want a compliment or physical experience here that's what our goals are.", "start": 333.233, "speaker": "Tom"}, {"confidence": 0.91, "end": 354.319, "track": 0, "text": "Yeah we saw that today we we were lucky enough to be able to hit some the hit the slopes earlier I get some runs in this morning you all downloaded the app and we create a group and there's four of us here.", "newpara": true, "start": 345.239, "speaker": "BigDataBeard"}, {"confidence": 0.92, "end": 364.901, "track": 0, "text": "One of us had a call he had to take so we had to figure out how do we make sure we know where we're going is at the top of the mountain the bottom and the after that just that very simple if we got together we were able to.", "start": 354.463, "speaker": "BigDataBeard"}, {"confidence": 0.86, "end": 370.819, "track": 0, "text": "I don't think you had any downtime at all waiting for one person and we will get back together and hit the slopes again so.", "start": 365.099, "speaker": "BigDataBeard"}, {"confidence": 0.85, "end": 376.612, "track": 0, "text": "Please see that then the other things go as we are at what you have a little friendly competition who can go the fastest.", "start": 370.994, "speaker": "BigDataBeard"}, {"confidence": 0.95, "end": 391.869, "track": 0, "text": "Cory is winning right now I'm a little disappointed about that but we'll we'll see what happens later on but yeah what's your point it really is giving that experience the end the end from when you get here to Neely so that you really do have the optimal time when you're on the mountain and I think it's awesome.", "start": 376.907, "speaker": "BigDataBeard"}, {"confidence": 0.91, "end": 399.206, "track": 1, "text": "Another another point there is it creates these memories and incarnations with your family like if you come up with.", "newpara": true, "start": 392.441, "speaker": "RJ"}, {"confidence": 0.93, "end": 410.341, "track": 1, "text": "You know to two children and your wife all the sudden you can relive your day based on you know these incarnations that you created on the mound through technology which is pretty cool right.", "start": 399.507, "speaker": "RJ"}, {"confidence": 0.9, "end": 420.4, "track": 0, "text": "Don't think I'm always find interesting so big the app is brilliant for the user experience that's awesome right we experience it great the flip side of it is though to that there's a.", "newpara": true, "start": 410.888, "speaker": "BigDataBeard"}, {"confidence": 0.9, "end": 435.429, "track": 0, "text": "Enterprise needs to him to have a return on investment like they were making this up not just for years experience so they have the best you know we have we increased sales obviously we attributed some of the two of them like how are you connecting very specific business outcomes to the app and then,", "start": 420.605, "speaker": "BigDataBeard"}, {"confidence": 0.97, "end": 442.55, "track": 0, "text": "are you able to do new things based on what you're learning about your customers and their usage of your brilliant facility.", "start": 435.315, "speaker": "BigDataBeard"}, {"confidence": 0.97, "end": 446.648, "track": 0, "text": "Is there something that you're learning about them that's changing the way that you do business today.", "start": 442.779, "speaker": "BigDataBeard"}, {"confidence": 0.9, "end": 457.765, "track": 2, "text": "Well one way to think about that as you know and we're just getting into being able to take all this day that's be accumulated and start using it you know really putting some business Series against it to see what they shake out and even if so.", "newpara": true, "start": 446.931, "speaker": "Tom"}, {"confidence": 0.91, "end": 459.201, "track": 2, "text": "An example of that would be.", "start": 457.789, "speaker": "Tom"}, {"confidence": 0.9, "end": 468.593, "track": 2, "text": "You don't work work work we're grabbing Radwanski rice we know how many Blues runs just intermediate runs you ski when I'm a beginner run jetski you know how many Advance rent jet ski.", "start": 459.334, "speaker": "Tom"}, {"confidence": 0.9, "end": 478.622, "track": 2, "text": "You know so down the line but we would like to be able to do is say when someone's really skiing blues or intermediate runs and that are starting to dabble a little bit in advance run.", "start": 468.816, "speaker": "Tom"}, {"confidence": 0.92, "end": 493.399, "track": 2, "text": "The perfect person to provide you know a discounted opportunity for ski lesson to kind of get them to that next level it said be one example from amount safety perspective is heat mapping where are points of of compression are skiers write an understanding flow around the mouth.", "start": 478.629, "speaker": "Tom"}, {"confidence": 0.88, "end": 496.415, "track": 2, "text": "And actually indicating people where you know.", "start": 493.639, "speaker": "Tom"}, {"confidence": 0.94, "end": 504.047, "track": 2, "text": "A better route down might be so almost building itineraries for them based on their past experience and what runs they like to build still there,", "start": 496.5, "speaker": "Tom"}, {"confidence": 0.88, "end": 511.702, "track": 2, "text": "do my day that work like there's all I'm just a myriad of things that we could be doing right now we're going to hopefully start kind of knock them off one by one.", "start": 503.993, "speaker": "Tom"}, {"confidence": 0.85, "end": 516.071, "track": 1, "text": "I mean you keep stealing all my thunder my key words, and I have.", "newpara": true, "start": 511.438, "speaker": "RJ"}, {"confidence": 0.87, "end": 520.139, "track": 0, "text": "Well there when I get to how it work it's a how you enable it it's that the ideas though.", "newpara": true, "start": 514.034, "speaker": "BigDataBeard"}, {"confidence": 0.75, "end": 522.362, "track": 1, "text": "Fermentation product.", "newpara": true, "start": 519.839, "speaker": "RJ"}, {"confidence": 0.9, "end": 528.293, "track": 0, "text": "We'll get there so I so I see you like obviously.", "newpara": true, "start": 524.406, "speaker": "BigDataBeard"}, {"confidence": 0.92, "end": 542.336, "track": 0, "text": "You know good user experience your you want to use in the future what are some of the like the challenges for marketing is your as your team had to have the change like the makeup of the team the kinds of people that you're going out and having to bring into the organization.", "start": 528.642, "speaker": "BigDataBeard"}, {"confidence": 0.93, "end": 551.38, "track": 2, "text": "You know what when I took the role as kind of head arm waiver of marketing at Squaw I was blessed with that and this is honest guy genuine.", "newpara": true, "start": 542.066, "speaker": "Tom"}, {"confidence": 0.78, "end": 555.664, "track": 2, "text": "They just said a very very technology Savvy team.", "start": 551.975, "speaker": "Tom"}, {"confidence": 0.92, "end": 563.368, "track": 2, "text": "And very bright and so the great news is it again I think it's some of that has to do with where we're located I mean you just have people who are kind of InTune.", "start": 555.821, "speaker": "Tom"}, {"confidence": 0.89, "end": 569.642, "track": 2, "text": "With kind of cutting edge of Technology on what's Happening is it as much as you can be excused all right and I and I would say that.", "start": 563.495, "speaker": "Tom"}, {"confidence": 0.96, "end": 577.808, "track": 2, "text": "You know you know and I've seen a lot of different marketing through a lot even ski resorts and I absolutely believe that we are just at the very like tip of the spear on the stuff.", "start": 569.738, "speaker": "Tom"}, {"confidence": 0.93, "end": 586.575, "track": 2, "text": "So you know we've over the years we've really made a transition you know from more of a traditional marketing perspective to a more of a digital technology base.", "start": 578.127, "speaker": "Tom"}, {"confidence": 0.9, "end": 595.619, "track": 2, "text": "And it's been an ongoing process and it's what I think that's going to continue but I honestly the team that I had that I have had is just been absolutely the right team for the transition.", "start": 586.69, "speaker": "Tom"}, {"confidence": 0.86, "end": 603.623, "track": 0, "text": "Roya quick pause do we going to hop off here.", "newpara": true, "start": 595.343, "speaker": "BigDataBeard"}, {"confidence": 0.91, "end": 615.791, "track": 0, "text": "It's up to you want to stop here doing to go back down and talk at the bottom\nsounds fine I have no problem with the sound.", "newpara": true, "start": 607.589, "speaker": "BigDataBeard"}, {"confidence": 0.78, "end": 624.408, "track": 2, "text": "Yeah we got to Lubeck.", "newpara": true, "start": 622.979, "speaker": "Tom"}, {"confidence": 0.73, "end": 637.923, "track": 2, "text": "Exactly.", "newpara": true, "start": 636.319, "speaker": "Tom"}, {"confidence": 0.72, "end": 639.707, "track": 0, "text": "So hang on.", "newpara": true, "start": 637.763, "speaker": "BigDataBeard"}, {"confidence": 0.93, "end": 648.27, "track": 2, "text": "Yeah it'll get quieter.", "newpara": true, "start": 642.808, "speaker": "Tom"}, {"confidence": 0.86, "end": 659.916, "track": 0, "text": "What was the voice of the market, saying about.", "newpara": true, "start": 650.176, "speaker": "BigDataBeard"}, {"confidence": 0.72, "end": 696.325, "track": 0, "text": "There are they're cheap so we just get this.", "newpara": true, "start": 686.332, "speaker": "BigDataBeard"}, {"confidence": 0.94, "end": 714.803, "track": 2, "text": "I just like to talk.", "newpara": true, "start": 712.766, "speaker": "Tom"}, {"confidence": 0.87, "end": 722.801, "track": 0, "text": "It's really one second hang on.", "newpara": true, "start": 713.355, "speaker": "BigDataBeard"}, {"confidence": 0.94, "end": 735.221, "track": 0, "text": "So you push them up this to the app you as new features new functionality some new things I think as recent as last September what's next what are some of the new things that you're looking at adding how do you prioritize it.", "start": 724.207, "speaker": "BigDataBeard"}, {"confidence": 0.89, "end": 743.045, "track": 0, "text": "What you added how do you justify the the business results for that and then what's the feedback they've been getting from.", "start": 735.793, "speaker": "BigDataBeard"}, {"confidence": 0.92, "end": 753.711, "track": 2, "text": "Well we have a pretty and are jumping if you want a pretty robust road map and you know one of these we just launched was our leaderboard which was you know where are short-term.", "newpara": true, "start": 743.623, "speaker": "Tom"}, {"confidence": 0.92, "end": 756.788, "track": 2, "text": "Near-term Target Fry Road map which was,", "start": 753.76, "speaker": "Tom"}, {"confidence": 0.94, "end": 769.972, "track": 2, "text": "you know if you opt into it and you skier on the mountain you cut you said you stack up against other skiers in the mountain on a weekly basis on a daily basis weekly pay this monthly basis basis and season-to-date in vertical feet Mesquite and so forth.", "start": 756.759, "speaker": "Tom"}, {"confidence": 0.92, "end": 776.516, "track": 2, "text": "And you know the purpose of that was again just to create this you know kind of immersive feeling when you're dealing with technology and skin here.", "start": 770.171, "speaker": "Tom"}, {"confidence": 0.89, "end": 787.446, "track": 2, "text": "And the feedback on that has been it's been funny because I was getting emails from people like that didn't record on my run.", "start": 776.54, "speaker": "Tom"}, {"confidence": 0.92, "end": 799.296, "track": 2, "text": "We take all of that very seriously so right now in the process of okay let's investigate this person's feedback and where we may have missed something and so we're constantly in a development cycle on this right.", "start": 787.495, "speaker": "Tom"}, {"confidence": 0.98, "end": 803.238, "track": 2, "text": "You don't my hope is going forward that were able to.", "start": 799.495, "speaker": "Tom"}, {"confidence": 0.93, "end": 816.735, "track": 2, "text": "Unicorn RC make purchase easier as it relates to live tickets for people and then you know from Financial you know fiduciary responsibility sad I guess we're going to call it and then from the perspective of our on Hill gas for the next cut you know.", "start": 803.569, "speaker": "Tom"}, {"confidence": 0.87, "end": 821.788, "track": 2, "text": "Everything that we're going to focus on is how do you get you know I spoke a little bit about.", "start": 816.753, "speaker": "Tom"}, {"confidence": 0.91, "end": 834.185, "track": 2, "text": "You know if you're skiing blues and you started dialing Blacklick perfect person to introduce to ski lesson how do you bring that in because the more the better somebody get that skiing the more Avenue B, they were loyal they become Resorts the next real step.", "start": 821.861, "speaker": "Tom"}, {"confidence": 0.88, "end": 842.886, "track": 2, "text": "How do you bring in the ski lesson ski school component of it and do it in an easy where we take out all the pain points of going down go on a ticket window.", "newpara": true, "start": 834.209, "speaker": "Tom"}, {"confidence": 0.9, "end": 846.503, "track": 2, "text": "You know meeting at a certain spot we don't know that's really where it is.", "start": 843.001, "speaker": "Tom"}, {"confidence": 0.88, "end": 853.835, "track": 2, "text": "And make it super seamless almost like if you're just waiting for an Uber can I push a button you see it coming it shows up you go.", "start": 846.57, "speaker": "Tom"}, {"confidence": 0.84, "end": 860.811, "track": 2, "text": "And so I think that's you know those are one of the areas that we really focus on neck stuff you know how can we be impactful discussing.", "start": 854.099, "speaker": "Tom"}, {"confidence": 0.95, "end": 868.286, "track": 0, "text": "Yeah so out of curiosity you've got a you've got an ecosystem of businesses around here right with the restaurants in different kind of places.", "newpara": true, "start": 860.836, "speaker": "BigDataBeard"}, {"confidence": 0.92, "end": 879.83, "track": 0, "text": "How are you using the technology using the advancements of the you start to understand user experience how are using that to drive activity or help you know kind of help people find the best Med Express just on the mountain.", "start": 868.395, "speaker": "BigDataBeard"}, {"confidence": 0.96, "end": 881.2, "track": 0, "text": "You know in the village.", "start": 879.944, "speaker": "BigDataBeard"}, {"confidence": 0.94, "end": 894.125, "track": 2, "text": "That's a good question and you know right now obviously we have just your map where you can figure out where you are two shows your walk to the Villas she can always tell you know we're using Beacon technology to you know approximate when your approximate to a certain.", "newpara": true, "start": 881.537, "speaker": "Tom"}, {"confidence": 0.92, "end": 902.153, "track": 2, "text": "Pacifica f&b Outlet you know here's a 10% discount if you want to have a nap since then so far they're trying to make it a little bit easier.", "start": 894.138, "speaker": "Tom"}, {"confidence": 0.84, "end": 912.05, "track": 2, "text": "And so you know what really our Focus been primarily cannot mountain and doing that but we're starting out dabble more into how do you provide people with.", "start": 903.23, "speaker": "Tom"}, {"confidence": 0.94, "end": 925.409, "track": 2, "text": "Their understanding of choices understanding where they're traveling give them incentive to go in but then reward them for doing that right cuz it's it's always your best situation or everybody West I win by getting them in there they win by getting a disc.", "start": 912.676, "speaker": "Tom"}, {"confidence": 0.95, "end": 939.169, "track": 0, "text": "Yeah that's excellent so so obviously we're here with RJ so you got a business partner in technology so what is the what's it like when you when you have this this vision for transforming the business transforming how marketing and sales Works in customer service work.", "newpara": true, "start": 925.403, "speaker": "BigDataBeard"}, {"confidence": 0.92, "end": 944.409, "track": 0, "text": "Like what's that relationship look like with it how crucial is it to your success.", "start": 939.38, "speaker": "BigDataBeard"}, {"confidence": 0.86, "end": 948.285, "track": 2, "text": "I mean RJ use app to Eastdale so it's been just kidding.", "newpara": true, "start": 944.464, "speaker": "Tom"}, {"confidence": 0.94, "end": 963.308, "track": 2, "text": "Hahaha. Just kidding could be further from the truth actually I mean I've felt like what we've been doing it's been incredibly important to Foster just a partnership if you will piers on all of this because you know,", "start": 948.652, "speaker": "Tom"}, {"confidence": 0.95, "end": 971.264, "track": 2, "text": "in marketing with me and my team we can have the greatest ideas on the planet I mean I have a 10 year old son he has the greatest ideas on planet he can't Implement any of them.", "start": 963.266, "speaker": "Tom"}, {"confidence": 0.94, "end": 978.475, "track": 2, "text": "So what I found is when you really combine your resources with it in our world it takes an idea.", "start": 971.264, "speaker": "Tom"}, {"confidence": 0.9, "end": 987.999, "track": 2, "text": "From what idea but actually makes the executable and actually you know allows you to achieve that and so we really try to work together shoulder-to-shoulder peer-to-peer on the same.", "start": 978.571, "speaker": "Tom"}, {"confidence": 0.96, "end": 991.16, "track": 0, "text": "That's awesome so I can curiosity for you.", "newpara": true, "start": 988.192, "speaker": "BigDataBeard"}, {"confidence": 0.94, "end": 1005.63, "track": 0, "text": "So this is obviously some big goals and big Visions for a ski resort which is so fun that there's this this much activity going on what's it like for you what it what are the big things on your plate as you as you can look at in the 2018 what's it look like the support some of these initiatives.", "start": 991.623, "speaker": "BigDataBeard"}, {"confidence": 0.92, "end": 1010.197, "track": 1, "text": "Yeah I mean it's vast and Broad and deep,", "newpara": true, "start": 1006.375, "speaker": "RJ"}, {"confidence": 0.9, "end": 1021.476, "track": 1, "text": "no it's totally fine right and we leverage our Partnerships to the full extent and capabilities the experts whether it's in data lakes or Federated identity.", "start": 1010.263, "speaker": "RJ"}, {"confidence": 0.96, "end": 1033.289, "track": 1, "text": "We want to leverage those relationships and Technologies and build those in to meet the marketing Vision around Gaston gagement gamification segmentation cross upsell Predictive Analytics.", "start": 1021.584, "speaker": "RJ"}, {"confidence": 0.86, "end": 1039.287, "track": 1, "text": "You know that advanced the guest experience so.", "start": 1033.5, "speaker": "RJ"}, {"confidence": 0.96, "end": 1044.178, "track": 1, "text": "It is quite fun and we got a little bit of a blank slate on several areas.", "start": 1039.587, "speaker": "RJ"}, {"confidence": 0.98, "end": 1051.761, "track": 1, "text": "That gives us the opportunity to not only Implement new technologies but also R&D up-and-coming Technologies and having a partner,", "start": 1044.293, "speaker": "RJ"}, {"confidence": 0.96, "end": 1059.014, "track": 1, "text": "like Tom in the marketing team to allow us to Pilot Technologies and contained groups is very beneficial.", "start": 1051.834, "speaker": "RJ"}, {"confidence": 0.92, "end": 1066.778, "track": 1, "text": "And understanding of a bill deployed learn mentality and the agile sort of factor is super great.", "start": 1059.123, "speaker": "RJ"}, {"confidence": 0.86, "end": 1073.905, "track": 1, "text": "You know the lot of ski resorts are stuck into Amor Legacy operating mode Squaw Valley's not in that mode.", "start": 1067.121, "speaker": "RJ"}, {"confidence": 0.94, "end": 1084.691, "track": 1, "text": "And we have a CEO's very supportive of us as well from The Innovation Factor so it's support all around from the business because operations actually have to consume these Technologies as well.", "start": 1074.037, "speaker": "RJ"}, {"confidence": 0.91, "end": 1093.518, "track": 1, "text": "And support them and interface with the ghast so it's quite the ecosystem here of marketing operations it.", "start": 1084.878, "speaker": "RJ"}, {"confidence": 0.84, "end": 1097.412, "track": 1, "text": "To make it actually successful and finance Finance is always.", "start": 1094.005, "speaker": "RJ"}, {"confidence": 0.86, "end": 1098.722, "track": 0, "text": "I got somebody got paid for a ride.", "newpara": true, "start": 1097.112, "speaker": "BigDataBeard"}, {"confidence": 0.94, "end": 1111.491, "track": 0, "text": "So when we talked a lot about the app and I'm curious over the last you know two to three years if you started to move towards this sort of mobile user experience based sort of model for changing how the resort operates.", "start": 1098.873, "speaker": "BigDataBeard"}, {"confidence": 0.92, "end": 1123.6, "track": 0, "text": "What's it look like for you when you talk about new technologies and shifting from you know the Legacy just transactional stuff to this more predictive right experiential game of vacation if you would say What's it been like for you like what.", "start": 1111.648, "speaker": "BigDataBeard"}, {"confidence": 0.9, "end": 1130.684, "track": 0, "text": "When you say new tools and Technology what are some of the top like new tools and Tech that you've looked at of last couple years that have been transformative here.", "start": 1123.793, "speaker": "BigDataBeard"}, {"confidence": 0.87, "end": 1140.72, "track": 1, "text": "Yeah I mean it's mostly Cloud right and there's been some challenges in the ski resort industry overtime just based on their locations do you hide Broadband connectivity,", "newpara": true, "start": 1130.901, "speaker": "RJ"}, {"confidence": 0.94, "end": 1151.65, "track": 1, "text": "I'm we're fortunate enough here in Squaw Valley and Alpine Meadows to have access to that so leveraging the cloud for additional data and Computer Resources is key in.", "start": 1140.756, "speaker": "RJ"}, {"confidence": 0.94, "end": 1160.111, "track": 1, "text": "Transactional processing is another thing that's a challenge here based on connectivity so we're looking at Technologies to streamline that too.", "start": 1151.789, "speaker": "RJ"}, {"confidence": 0.82, "end": 1165.333, "track": 1, "text": "With offline capabilities and what not what's your plan about some of the Technologies we met.", "start": 1160.232, "speaker": "RJ"}, {"confidence": 0.93, "end": 1173.733, "track": 1, "text": "You know within the last 2 years so Amazon's been a big piece of our infrastructure we use Excuse me everything from Amazon redshift.", "start": 1165.537, "speaker": "RJ"}, {"confidence": 0.79, "end": 1180.83, "track": 1, "text": "To the RTS infrastructure to the EC to ask 3 to the DNS services.", "start": 1173.992, "speaker": "RJ"}, {"confidence": 0.84, "end": 1190.409, "track": 1, "text": "So we're constantly the Beanstalk be used in stock for configuration when using a bunch of items that were using.", "start": 1180.963, "speaker": "RJ"}, {"confidence": 0.9, "end": 1199.602, "track": 1, "text": "Agnostic in the technology stack so from the Federated identity perspective or looking at stuff like Microsoft as you are identity Services right.", "start": 1190.577, "speaker": "RJ"}, {"confidence": 0.95, "end": 1209.475, "track": 1, "text": "To meet some of these expectations around guest engagement and experience it's not only about knowing the customer it's also understanding how an unknown.", "start": 1199.951, "speaker": "RJ"}, {"confidence": 0.88, "end": 1218.212, "track": 1, "text": "Customer converts to a known customer right so that's where federated-identity comes in that's right so.", "start": 1209.824, "speaker": "RJ"}, {"confidence": 0.92, "end": 1226.583, "track": 1, "text": "A bit of some of the Technologies beacons into my O2 stuff we have rolled out RFID is key to our lift access and fraud management.", "start": 1218.616, "speaker": "RJ"}, {"confidence": 0.92, "end": 1240.41, "track": 1, "text": "Had that fluorine about 8 years provides for a frictionless guest experience going through the gates and also provides deep analytic capability on the back and for Revenue management to fraud and predictive analysis.", "newpara": true, "start": 1226.728, "speaker": "RJ"}, {"confidence": 0.9, "end": 1248.011, "track": 1, "text": "And how many skiers we might forecast for the coming weekend based on you know historic usage weather and what not.", "start": 1240.561, "speaker": "RJ"}, {"confidence": 0.86, "end": 1254.838, "track": 0, "text": "Going to continue this conversation do we want to hop on Hop here to want to go another loop around since your car I'm easy.", "newpara": true, "start": 1248.397, "speaker": "BigDataBeard"}, {"confidence": 0.53, "end": 1257.308, "track": 2, "text": "I think we just going to leave around that way.", "newpara": true, "start": 1255.289, "speaker": "Tom"}, {"confidence": 0.89, "end": 1261.917, "track": 0, "text": "Gun that way it's easy whenever I already set up throw with it.", "newpara": true, "start": 1257.02, "speaker": "BigDataBeard"}, {"confidence": 0.87, "end": 1273.556, "track": 0, "text": "That's good\nso one of y'all will do it will take him to the second will do the class thing and 2nd\nthis is really.", "newpara": true, "start": 1264.243, "speaker": "BigDataBeard"}, {"confidence": 0.73, "end": 1283.543, "track": 0, "text": "25 minutes will be plenty of time to get up and down\nAlicia.", "newpara": true, "start": 1277.799, "speaker": "BigDataBeard"}, {"confidence": 0.77, "end": 1285.508, "track": 2, "text": "They will get out right now.", "newpara": true, "start": 1284.114, "speaker": "Tom"}, {"confidence": 0.88, "end": 1295.82, "track": 1, "text": "Yeah science.", "newpara": true, "start": 1294.678, "speaker": "RJ"}, {"confidence": 0.83, "end": 1300.621, "track": 0, "text": "Uber by the way I just said this yet.", "newpara": true, "start": 1297.292, "speaker": "BigDataBeard"}, {"confidence": 0.94, "end": 1309.574, "track": 0, "text": "I hope that are the output of this will be very good this actually going to be our first video.", "newpara": true, "start": 1303.584, "speaker": "BigDataBeard"}, {"confidence": 0.86, "end": 1318.889, "track": 0, "text": "What is a perforated video so we're going to be a lot of work I'll be doing this afternoon is grabbing really cool b-roll like from around the facility.", "start": 1310.26, "speaker": "BigDataBeard"}, {"confidence": 0.86, "end": 1326.472, "track": 0, "text": "How to incorporate into the right spot transitions I'll be two things worked in so we'll let you know how it goes but there will be.", "start": 1319.664, "speaker": "BigDataBeard"}, {"confidence": 0.81, "end": 1351.157, "track": 0, "text": "Yeah we got some.", "newpara": true, "start": 1343.202, "speaker": "BigDataBeard"}, {"confidence": 0.84, "end": 1370.176, "track": 0, "text": "Okay I love it it's awesome I said my friend.", "newpara": true, "start": 1365.61, "speaker": "BigDataBeard"}, {"confidence": 0.79, "end": 1380.722, "track": 0, "text": "They're in Vietnam right now building.", "start": 1370.952, "speaker": "BigDataBeard"}, {"confidence": 0.99, "end": 1383.053, "track": 2, "text": "Oh yeah I saw that.", "newpara": true, "start": 1380.542, "speaker": "Tom"}, {"confidence": 0.88, "end": 1392.049, "track": 0, "text": "Vietnam.", "newpara": true, "start": 1383.12, "speaker": "BigDataBeard"}, {"confidence": 0.86, "end": 1400.732, "track": 0, "text": "To continue the conversation on it and business cuz there's one of the things that we see a lot of organizations.", "newpara": true, "start": 1395.541, "speaker": "BigDataBeard"}, {"confidence": 0.87, "end": 1406.02, "track": 0, "text": "Struggle with his mighty there's a lot of you can do things.", "start": 1400.991, "speaker": "BigDataBeard"}, {"confidence": 0.91, "end": 1417.804, "track": 0, "text": "And like in terms of there's the technology just out there to do a lot of crazy cool stuff right now I didn't and services like things that Amazon and it is you're in Google Earth providing the cloud and people are doing the open source ecosystem it can power.", "start": 1406.135, "speaker": "BigDataBeard"}, {"confidence": 0.92, "end": 1424.468, "track": 0, "text": "Pretty much any Vision or dream marketing might ever have but parlotones we often see is that there's a skill gap between,", "start": 1417.955, "speaker": "BigDataBeard"}, {"confidence": 0.96, "end": 1434.172, "track": 0, "text": "what it can do and what marketing wants to execute on a lot of times people called that like data science or you know the devops kind of community that's this power in it,", "start": 1424.546, "speaker": "BigDataBeard"}, {"confidence": 0.9, "end": 1441.606, "track": 0, "text": "have you have you guys did you have to go out and build like a a data science community of you had the heart attack signs or is this been sort of an organic.", "start": 1434.263, "speaker": "BigDataBeard"}, {"confidence": 0.91, "end": 1449.135, "track": 0, "text": "Thing where you views people within your own organization and kind of retrained retooled rescaled them to do more Innovative things.", "start": 1441.726, "speaker": "BigDataBeard"}, {"confidence": 0.91, "end": 1455.114, "track": 1, "text": "Right that it's the latter and also the predecessor of what you said.", "newpara": true, "start": 1449.815, "speaker": "RJ"}, {"confidence": 0.94, "end": 1466.225, "track": 1, "text": "So we're looking to scale the organization specifically around 8 I mean we live in the world of data right I mean it's the data of things as far as I'm concerned right so.", "start": 1455.217, "speaker": "RJ"}, {"confidence": 0.94, "end": 1473.904, "track": 1, "text": "But we like to keep all of our resources engaged we like to build a culture and Community within you know I T and within the organization as a whole.", "start": 1466.4, "speaker": "RJ"}, {"confidence": 0.95, "end": 1487.413, "track": 1, "text": "Do you allow people to be engaged and execute and train and provide growth as any good organization should so we do provide those tools to the team we all wear multiple hats to your point about devops and.", "start": 1474.061, "speaker": "RJ"}, {"confidence": 0.91, "end": 1497.526, "track": 1, "text": "How that works we work with a vendor as well as internally I mean I personally write code still occasionally in my team last at me but that's okay.", "start": 1487.6, "speaker": "RJ"}, {"confidence": 0.84, "end": 1499.876, "track": 0, "text": "That's cool man I have to ask though which language.", "newpara": true, "start": 1497.292, "speaker": "BigDataBeard"}, {"confidence": 0.98, "end": 1503.589, "track": 1, "text": "I'm not going to tell you.", "newpara": true, "start": 1499.612, "speaker": "RJ"}, {"confidence": 0.78, "end": 1504.407, "track": 0, "text": "Try for training.", "newpara": true, "start": 1501.637, "speaker": "BigDataBeard"}, {"confidence": 0.96, "end": 1516.851, "track": 1, "text": "So what's your point it's kind of bows and we're trying to find that equilibrium to be successful because.", "newpara": true, "start": 1508.295, "speaker": "RJ"}, {"confidence": 0.89, "end": 1519.483, "track": 1, "text": "As you mentioned you can't meet every vision,", "start": 1517.501, "speaker": "RJ"}, {"confidence": 0.9, "end": 1529.53, "track": 1, "text": "butter for collaborative and we work together and we're in alignment which unfortunate to have a great relationship with Tom and his team and we're open and communicative and collaborative.", "start": 1519.544, "speaker": "RJ"}, {"confidence": 0.96, "end": 1543.351, "track": 1, "text": "Which is key silos just don't work right when we want to move fast and quick we have short run ways to implement short run ways to develop based on our seasonality so we have a life cycle around there,", "start": 1529.675, "speaker": "RJ"}, {"confidence": 0.89, "end": 1549.21, "track": 1, "text": "no different than you know that you weak Sprint's sort of deal so that's kind of how we Rollin.", "start": 1543.304, "speaker": "RJ"}, {"confidence": 0.88, "end": 1555.135, "track": 0, "text": "Yes I'm on the folks at that we talked to you and that that listen to this this podcast are in that sort of space between.", "newpara": true, "start": 1549.229, "speaker": "BigDataBeard"}, {"confidence": 0.88, "end": 1563.115, "track": 0, "text": "There a lot of them have been even Oscar at the guys that hosting else had that kind of work on the scene it's a lot of us have been an it for a long time and we've kinda had to reschedule.", "start": 1555.484, "speaker": "BigDataBeard"}, {"confidence": 0.93, "end": 1574.16, "track": 0, "text": "But where but we also have a lot of business users that are trying to figure out how to the interface with it so I want to dig into like that communicative collaborative thing you guys do together like.", "start": 1563.386, "speaker": "BigDataBeard"}, {"confidence": 0.95, "end": 1580.217, "track": 0, "text": "That did not happen just cuz you guys were like buddies or like was there some formal approach that you took to achieve that.", "start": 1574.611, "speaker": "BigDataBeard"}, {"confidence": 0.92, "end": 1587.085, "track": 2, "text": "Well I think you know what what are you just said is you know we've had to kind of build from the ground up right so it was absolutely crucial.", "newpara": true, "start": 1579.929, "speaker": "Tom"}, {"confidence": 0.91, "end": 1594.951, "track": 2, "text": "To involve it early on in these various ideas because as you said you got these crazy ideas and then probably couldn't happen.", "start": 1587.176, "speaker": "Tom"}, {"confidence": 0.9, "end": 1602.673, "track": 2, "text": "Everything's kind of allocating resources right so by having it right initially and what we're doing.", "start": 1595.186, "speaker": "Tom"}, {"confidence": 0.93, "end": 1606.284, "track": 2, "text": "You start getting the structure of how you know we'll go about doing this right,", "start": 1602.787, "speaker": "Tom"}, {"confidence": 0.9, "end": 1620.406, "track": 2, "text": "and it'll be like that idea is great and all your toys think about it wrong what if we accomplish it this way and see how the idiot of a process taking place to beginning with i t rather than at the end where you're just giving unlike the grand reveal I really want to do.", "start": 1606.279, "speaker": "Tom"}, {"confidence": 0.96, "end": 1634.581, "track": 1, "text": "Yeah like for instance you know we've collaborated on the guest journey of persona mapping right like I think it helps to have it involved in the business and have people in it that are business savvy so to say.", "newpara": true, "start": 1621.271, "speaker": "RJ"}, {"confidence": 0.88, "end": 1645.037, "track": 1, "text": "And then part of the other collaborations will provide framework so everybody knows about Shadow it in the world of the internet right now it's called of the World Wide Web.", "start": 1635.411, "speaker": "RJ"}, {"confidence": 0.95, "end": 1648.346, "track": 0, "text": "I think it's the the Google machine the internet of The Intern.", "newpara": true, "start": 1645.248, "speaker": "BigDataBeard"}, {"confidence": 0.59, "end": 1649.946, "track": 1, "text": "Google hello Google.", "newpara": true, "start": 1648.42, "speaker": "RJ"}, {"confidence": 0.84, "end": 1652.025, "track": 0, "text": "The other Google's just put it in Google Docs.", "newpara": true, "start": 1649.702, "speaker": "BigDataBeard"}, {"confidence": 0.91, "end": 1653.408, "track": 2, "text": "The inner tubes at the inner tubes.", "newpara": true, "start": 1650.403, "speaker": "Tom"}, {"confidence": 0.79, "end": 1655.186, "track": 1, "text": "No", "newpara": true, "start": 1653.108, "speaker": "RJ"}, {"confidence": 0.98, "end": 1657.638, "track": 0, "text": "Are they connected.", "newpara": true, "start": 1654.886, "speaker": "BigDataBeard"}, {"confidence": 0.93, "end": 1661.081, "track": 1, "text": "Hahaha we measure your speed on that.", "newpara": true, "start": 1658.101, "speaker": "RJ"}, {"confidence": 0.87, "end": 1662.355, "track": 0, "text": "How about I go faster than bread.", "newpara": true, "start": 1661.027, "speaker": "BigDataBeard"}, {"confidence": 0.89, "end": 1672.847, "track": 1, "text": "But we can always try to set some parameters with him so when I'm working with Tom team or people on my team are collaborating with people on Tom's Kansas like okay yeah that's cool we're looking at a new.", "newpara": true, "start": 1663.822, "speaker": "RJ"}, {"confidence": 0.97, "end": 1686.325, "track": 1, "text": "Multi-channel Communication Service that does text and phone and email well okay let's pull in it to understand what kind of API access there is around Dave and Ava Security in Federation.", "start": 1674.001, "speaker": "RJ"}, {"confidence": 0.88, "end": 1694.107, "track": 1, "text": "I was going to feed into some other XML Legacy Based Services we have for you know with management or something like that.", "start": 1686.458, "speaker": "RJ"}, {"confidence": 0.91, "end": 1701.883, "track": 1, "text": "I mean we're all here for the same reason that you create something great so I think it's a little easier than and maybe a more traditional environment.", "start": 1694.678, "speaker": "RJ"}, {"confidence": 0.94, "end": 1709.815, "track": 0, "text": "What are things it's gotten really popular in the last year in the data and kind of digital transformation spaces been this.", "newpara": true, "start": 1702.502, "speaker": "BigDataBeard"}, {"confidence": 0.94, "end": 1720.246, "track": 0, "text": "Is topical machine learning and artificial intelligence is there anything because everything you guys are looking at like when you look at machine learning theory look at artificial intelligence is there any areas where you think.", "start": 1709.947, "speaker": "BigDataBeard"}, {"confidence": 0.98, "end": 1725.078, "track": 0, "text": "Like we might be able to do something with that or are you doing anything today that we don't know about.", "start": 1720.535, "speaker": "BigDataBeard"}, {"confidence": 0.9, "end": 1729.777, "track": 1, "text": "You want to go, I had a couple tickets.", "newpara": true, "start": 1725.667, "speaker": "RJ"}, {"confidence": 0.91, "end": 1738.676, "track": 1, "text": "Tell using you know Ai and machine learning for predictive capabilities you'd be surprised at how much it takes to.", "start": 1730.012, "speaker": "RJ"}, {"confidence": 0.93, "end": 1752.551, "track": 1, "text": "Forecast demand at the mountain here based on all the variability and running those scenarios and models and looking for those expected outcomes right that's one thing fraud is another fraud is.", "start": 1738.929, "speaker": "RJ"}, {"confidence": 0.92, "end": 1759.918, "track": 1, "text": "I'm an item in the industry that we want to tackle and get more heuristics around and understand.", "start": 1752.72, "speaker": "RJ"}, {"confidence": 0.93, "end": 1768.307, "track": 1, "text": "That user flow and identify those in reduce right cuz that affects our bottom line and revenue we have a short.", "start": 1760.574, "speaker": "RJ"}, {"confidence": 0.91, "end": 1772.447, "track": 1, "text": "Trying to do that so that's kind of a business capability right there.", "start": 1768.656, "speaker": "RJ"}, {"confidence": 0.95, "end": 1782.458, "track": 1, "text": "You know another one is operational decision support right so based on demand the ability to Crunch this data around sales labor.", "start": 1772.712, "speaker": "RJ"}, {"confidence": 0.97, "end": 1786.965, "track": 1, "text": "Skiers on the mountain what lifts are running.", "start": 1782.621, "speaker": "RJ"}, {"confidence": 0.91, "end": 1799.38, "track": 1, "text": "And experience in factored that into say hi to maybe we need to shift some more people to Gold Coast and food and beverage because there seems to be an aggregate of people there right so that real-time data stream,", "start": 1787.098, "speaker": "RJ"}, {"confidence": 0.95, "end": 1808.087, "track": 1, "text": "that's that's coming in and then disseminated to our leaders on the mountain so they can make that information right and then obviously I think.", "start": 1799.314, "speaker": "RJ"}, {"confidence": 0.88, "end": 1816.95, "track": 1, "text": "We're machine learning and AI can come in really handy is you know Crossing up cell and product recommendation engine.", "start": 1808.796, "speaker": "RJ"}, {"confidence": 0.97, "end": 1829.948, "track": 1, "text": "And converting the three to four times visitor into a season pass holder and going from the intermediate to the advanced level of skiing to get those memories and carnations.", "newpara": true, "start": 1817.047, "speaker": "RJ"}, {"confidence": 0.93, "end": 1838.661, "track": 1, "text": "And to create those family experiences that we all strive for mean the snow is great right now and people should be coming up like I mean the snow is awesome.", "start": 1830.267, "speaker": "RJ"}, {"confidence": 0.97, "end": 1839.845, "track": 0, "text": "That's really not here.", "newpara": true, "start": 1838.746, "speaker": "BigDataBeard"}, {"confidence": 0.89, "end": 1844.947, "track": 2, "text": "So I maybe I would add maybe so they were doing right now and working on right now is.", "newpara": true, "start": 1839.749, "speaker": "Tom"}, {"confidence": 0.77, "end": 1847.404, "track": 1, "text": "What we're not doing any of that right now.", "newpara": true, "start": 1844.647, "speaker": "RJ"}, {"confidence": 0.92, "end": 1855.126, "track": 2, "text": "Oh yeah yeah but you know in the machine learning perspective is you don't understanding by device.", "newpara": true, "start": 1847.158, "speaker": "Tom"}, {"confidence": 0.96, "end": 1860.143, "track": 2, "text": "People like to to get their information through and when they like to get their information right.", "start": 1855.493, "speaker": "Tom"}, {"confidence": 0.96, "end": 1871.729, "track": 2, "text": "Because really what you're trying to do is trying to serve them information on their preferred from their preferred Channel at the exact time that they want to receive it so we've really been working a lot around how do we get there.", "start": 1860.24, "speaker": "Tom"}, {"confidence": 0.92, "end": 1880.833, "track": 2, "text": "And you know using sure machine learning with IBM and Watson what have you two to really facilitate that I think that's something that you know we're doing now as an example.", "start": 1871.934, "speaker": "Tom"}, {"confidence": 0.87, "end": 1889.047, "track": 1, "text": "That's a good one of a very value out of Partners is IBM Watson technology in marketing is really utilizing that so.", "newpara": true, "start": 1881.073, "speaker": "RJ"}, {"confidence": 0.92, "end": 1902.61, "track": 0, "text": "Interesting look at very cool we Cena IBM and watching the apis we seen a lot of adoption of the the data scientist data science experience to look at that they're coming out with an integrated was on Hoarders looks very interesting for powering something to talk about.", "newpara": true, "start": 1889.12, "speaker": "BigDataBeard"}, {"confidence": 0.81, "end": 1911.443, "track": 0, "text": "Rent take a break real quick while we're in the lifthouse the few natel house.", "start": 1902.826, "speaker": "BigDataBeard"}, {"confidence": 0.92, "end": 1923.407, "track": 0, "text": "Oh I know I do we need to get that will get it will get it when we wrap here in a second I want you to record like what food of July.", "newpara": true, "start": 1917.362, "speaker": "BigDataBeard"}, {"confidence": 0.92, "end": 1931.207, "track": 0, "text": "Weasel are our chaperone\nis the one with the knowledge.", "newpara": true, "start": 1925.228, "speaker": "BigDataBeard"}, {"confidence": 0.95, "end": 1948.639, "track": 0, "text": "So I want to jump just real quick to you talked about beacons and want to talk about just like in the iot space.", "newpara": true, "start": 1939.686, "speaker": "BigDataBeard"}, {"confidence": 0.95, "end": 1958.674, "track": 0, "text": "What's driving here to brother he brought up at lunch like what's driving the use of beacons versus just pure GPS like this is a high-level cuz we get I get a ton of questions about that just in the market they're like.", "start": 1949.138, "speaker": "BigDataBeard"}, {"confidence": 0.89, "end": 1967.52, "track": 0, "text": "If I have GPS why don't you deacons but that's a general one that we get and then what I do when I flip 2 is rapid fire.", "start": 1959.089, "speaker": "BigDataBeard"}, {"confidence": 0.94, "end": 1976.431, "track": 0, "text": "Actually know what I'm getting on mine I got it\nI got it.", "start": 1968.235, "speaker": "BigDataBeard"}, {"confidence": 0.92, "end": 1991.952, "track": 0, "text": "So then one thing we do shift to just for fun as we always ask her guess a list of about 8 questions and they're called rapid fire and I'll set it up but it's basically like just some fun questions to get to know are you that that we just ask him it will just.", "start": 1977.014, "speaker": "BigDataBeard"}, {"confidence": 0.94, "end": 1998.394, "track": 0, "text": "Just whatever first thing that comes to mind to snap it off and we'll just go from there.", "start": 1992.229, "speaker": "BigDataBeard"}, {"confidence": 0.88, "end": 2010.581, "track": 0, "text": "Things like what you're like what you're into but you're reading that guy stop yeah\noh yeah I got us so we're going to switch one will do what show your engine on to favorites favorites key movie.", "start": 1999.29, "speaker": "BigDataBeard"}, {"confidence": 0.96, "end": 2012.684, "track": 0, "text": "So you got previous again.", "start": 2011.41, "speaker": "BigDataBeard"}, {"confidence": 0.86, "end": 2039.785, "track": 0, "text": "It's okay give me a favor.", "newpara": true, "start": 2032.063, "speaker": "BigDataBeard"}, {"confidence": 0.91, "end": 2049.88, "track": 0, "text": "So you talked about beacons previously and I want to unpack that a bit because we we know that the apps in the phones I got GPS.", "newpara": true, "start": 2042.429, "speaker": "BigDataBeard"}, {"confidence": 0.95, "end": 2063.4, "track": 0, "text": "And what GPS you can do laundry and stuff but it's interesting we played around beacons and I get that alot of this question a bunch from a business users 90 practitioners like why do I need a beginner what is it why is it technology interesting man in the IRT context.", "start": 2050.079, "speaker": "BigDataBeard"}, {"confidence": 0.97, "end": 2065.96, "track": 0, "text": "Since I already have GPS like why do I need that.", "start": 2063.629, "speaker": "BigDataBeard"}, {"confidence": 0.93, "end": 2076.873, "track": 1, "text": "What GPS works great when you have full cell coverage and every nook and cranny across 6000 acres into mountains unfortunately that's not the case.", "newpara": true, "start": 2066.94, "speaker": "RJ"}, {"confidence": 0.94, "end": 2085.069, "track": 1, "text": "Here we're working on building full wire in a WiFi mesh networks were working on with our telephone providers pull up new towers.", "start": 2077.21, "speaker": "RJ"}, {"confidence": 0.93, "end": 2097.826, "track": 1, "text": "And provide better coverage across every nook and cranny but sometimes because work really good in certain areas and it's just part of our mess Network and capabilities for communications that we want Intel I mean we have a wired Network in a fiber Network.", "start": 2085.208, "speaker": "RJ"}, {"confidence": 0.93, "end": 2104.67, "track": 1, "text": "A Wi-Fi network you know the Telecom Network and a beacon Network so we want to be able to use it.", "start": 2097.959, "speaker": "RJ"}, {"confidence": 0.96, "end": 2112.747, "track": 1, "text": "As necessary where we need to use it when we don't have every use case identified but part of the overarching you know architecture.", "start": 2104.965, "speaker": "RJ"}, {"confidence": 0.93, "end": 2125.234, "track": 0, "text": "So as you look out and kind of in the next 12 to 24 months we talked a little bit machine learning in Big Data like what are the things that you're most excited about and what you're going to be bringing.", "newpara": true, "start": 2112.675, "speaker": "BigDataBeard"}, {"confidence": 0.93, "end": 2130.762, "track": 0, "text": "The Squaw Valley Inn for your for the people who are visiting this mountain what are you most excited about the next 12-24 months.", "start": 2125.421, "speaker": "BigDataBeard"}, {"confidence": 0.94, "end": 2141.452, "track": 2, "text": "Well if I could have one dream that wasn't me living in Tavarua surfing it would be to have someone be able to just walk to the lift with their phone.", "newpara": true, "start": 2131.658, "speaker": "Tom"}, {"confidence": 0.93, "end": 2148.717, "track": 2, "text": "And never worry about a ticket or a pass and that's that's the big Target that I see out there that I've been pushing rji.", "start": 2141.819, "speaker": "Tom"}, {"confidence": 0.9, "end": 2156.565, "track": 1, "text": "Yeah I mean mobile to lift would be amazing right I mean obviously you're going to need some contingency planning for people that don't have phones are is there anybody.", "newpara": true, "start": 2149.03, "speaker": "RJ"}, {"confidence": 0.9, "end": 2162.057, "track": 0, "text": "It's a I think there's some in Alabama where I'm I'm where I'm from.", "newpara": true, "start": 2156.92, "speaker": "BigDataBeard"}, {"confidence": 0.87, "end": 2165.494, "track": 1, "text": "We can make it a target market for a little.", "newpara": true, "start": 2162.292, "speaker": "RJ"}, {"confidence": 0.9, "end": 2179.508, "track": 1, "text": "Yeah I mean having this frictionless experience on the resort and having our Gaston operations and host know the ghazt and approaching them with the right questions are inside so when we're engaging face to face.", "start": 2166.132, "speaker": "RJ"}, {"confidence": 0.94, "end": 2190.33, "track": 1, "text": "Ideally want technology to augment the face to face expressions and personalization that can't get anywhere else I mean it's people-to-people interactions that makes skiing so great.", "start": 2179.802, "speaker": "RJ"}, {"confidence": 0.92, "end": 2202.156, "track": 0, "text": "Yeah absolutely well Argent on this has been informed that this is exciting we've obviously had a blast at your at your Mountaineer Resort we've experienced firsthand the the really cool things to do with this app to make.", "newpara": true, "start": 2190.583, "speaker": "BigDataBeard"}, {"confidence": 0.94, "end": 2213.272, "track": 0, "text": "The experience that much better right we're technologist week we showed up here we wanted to have a great time and then I tell you the work you're doing this is absolutely have an impact this is a very smooth easy to easy to enjoy experiencing.", "start": 2202.3, "speaker": "BigDataBeard"}, {"confidence": 0.95, "end": 2225.237, "track": 0, "text": "I think the app make sure that we were able to find Keith exceptionally well and able to find pizza so thank you for that amazing place.", "start": 2213.483, "speaker": "BigDataBeard"}, {"confidence": 0.82, "end": 2227.16, "track": 0, "text": "And rabbits are questions are really just.", "start": 2225.411, "speaker": "BigDataBeard"}, {"confidence": 0.92, "end": 2238.985, "track": 0, "text": "The quick questions just answer the first thing that comes to mind when I ask you a question but just give our listeners a chance to get to know a little more about you so hard you will start with you and then go back and forth.", "start": 2227.568, "speaker": "BigDataBeard"}, {"confidence": 0.97, "end": 2242.464, "track": 0, "text": "What year do you think Skynet will go online.", "start": 2239.178, "speaker": "BigDataBeard"}, {"confidence": 0.59, "end": 2246.437, "track": 1, "text": "2021.", "newpara": true, "start": 2242.363, "speaker": "RJ"}, {"confidence": 0.75, "end": 2247.344, "track": 0, "text": "21 hour.", "newpara": true, "start": 2246.329, "speaker": "BigDataBeard"}, {"confidence": 0.87, "end": 2250.222, "track": 2, "text": "I think it's already online and this is just a dream we're living in.", "newpara": true, "start": 2247.387, "speaker": "Tom"}, {"confidence": 0.96, "end": 2256.105, "track": 0, "text": "See I think this guy's I think this guy's got it right here if you bought me a book what would it be.", "newpara": true, "start": 2249.922, "speaker": "BigDataBeard"}, {"confidence": 0.88, "end": 2263.977, "track": 0, "text": "Or maybe let's rephrase it this way what was your favorite book you read in the last year.", "newpara": true, "start": 2259.273, "speaker": "BigDataBeard"}, {"confidence": 0.91, "end": 2274.667, "track": 2, "text": "Actually the one I'm eating right now is called the beautiful constraint and it's all about you know how to use constraints to actually push yourself past things and feel like her toes and actually I read that right now it's actually really good.", "newpara": true, "start": 2264.17, "speaker": "Tom"}, {"confidence": 0.82, "end": 2276.073, "track": 0, "text": "The beautiful constraint are and you.", "newpara": true, "start": 2274.53, "speaker": "BigDataBeard"}, {"confidence": 0.96, "end": 2281.295, "track": 1, "text": "I got two answers for you I'll get you the squallywood book okay.", "newpara": true, "start": 2276.002, "speaker": "RJ"}, {"confidence": 0.87, "end": 2281.902, "track": 0, "text": "Okay o\nsounds righteous.", "newpara": true, "start": 2279.133, "speaker": "BigDataBeard"}, {"confidence": 0.81, "end": 2291.667, "track": 1, "text": "Interesting items I'm actually reading the book by thoughtworks called digital transformation building an IT agile organ organization.", "newpara": true, "start": 2281.981, "speaker": "RJ"}, {"confidence": 0.98, "end": 2294.221, "track": 1, "text": "Quite quite exciting.", "newpara": true, "start": 2292.815, "speaker": "RJ"}, {"confidence": 0.97, "end": 2298.341, "track": 0, "text": "What genre of music do you have in the earbuds when you're cruising down the mountain.", "newpara": true, "start": 2294.073, "speaker": "BigDataBeard"}, {"confidence": 0.97, "end": 2308.6, "track": 1, "text": "I typically like the sound of nature personally but if I was going to wear earbuds I probably put like the Red Hot Chili Peppers.", "newpara": true, "start": 2299.353, "speaker": "RJ"}, {"confidence": 0.94, "end": 2313.816, "track": 2, "text": "Old school rap every time all the time.", "newpara": true, "start": 2309.55, "speaker": "Tom"}, {"confidence": 0.92, "end": 2323.497, "track": 0, "text": "We're rocking in wa on the way I turned them down today so we feel you on that one so do you have a favorite piece of like technology that you think is really cool but you also it's kind of like dumb and useless.", "newpara": true, "start": 2312.128, "speaker": "BigDataBeard"}, {"confidence": 0.81, "end": 2335.551, "track": 1, "text": "I got to think about this is rapid fire\nI know I'm trying to think of one here really.", "newpara": true, "start": 2327.668, "speaker": "RJ"}, {"confidence": 0.96, "end": 2338.43, "track": 0, "text": "All technology is not cool let's just let me know that right.", "newpara": true, "start": 2335.251, "speaker": "BigDataBeard"}, {"confidence": 0.89, "end": 2340.657, "track": 1, "text": "A Blackberry oh wait at the house.", "newpara": true, "start": 2338.971, "speaker": "RJ"}, {"confidence": 0.86, "end": 2344.084, "track": 1, "text": "Yeah I have one of those I don't have one anymore.", "start": 2341.664, "speaker": "RJ"}, {"confidence": 0.89, "end": 2347.209, "track": 0, "text": "It would help with your frictionless experience right I don't think they were going to.", "newpara": true, "start": 2343.796, "speaker": "BigDataBeard"}, {"confidence": 0.97, "end": 2355.651, "track": 1, "text": "Question you know I don't know I recently got an Alexa at home which is definitely extremely useful.", "newpara": true, "start": 2346.921, "speaker": "RJ"}, {"confidence": 0.91, "end": 2363.067, "track": 1, "text": "To my kids start over riding me and then we get in this argument with Alexa fighting you know in the kitchen about what song were they.", "start": 2356.403, "speaker": "RJ"}, {"confidence": 0.88, "end": 2368.571, "track": 1, "text": "So it becomes useless to a point that I guess that's fine.", "start": 2363.632, "speaker": "RJ"}, {"confidence": 0.66, "end": 2369.725, "track": 0, "text": "What you and your so sick.", "newpara": true, "start": 2368.355, "speaker": "BigDataBeard"}, {"confidence": 0.86, "end": 2378.636, "track": 2, "text": "Being and I wouldn't say useless I did just get this new Apple three watch and it's created an add like I've never known before.", "newpara": true, "start": 2369.671, "speaker": "Tom"}, {"confidence": 0.9, "end": 2389.098, "track": 0, "text": "I just wanna make you feel better that is literally the number one answer we've gotten of all gas like overarching the Apple watches a silly one what is your biggest personal Money Pit right.", "newpara": true, "start": 2377.213, "speaker": "BigDataBeard"}, {"confidence": 0.9, "end": 2393.04, "track": 1, "text": "Surfboards.", "newpara": true, "start": 2391.724, "speaker": "RJ"}, {"confidence": 0.58, "end": 2394.025, "track": 0, "text": "Surfboards all right.", "newpara": true, "start": 2392.944, "speaker": "BigDataBeard"}, {"confidence": 0.91, "end": 2395.834, "track": 2, "text": "Surf trips.", "newpara": true, "start": 2393.9, "speaker": "Tom"}, {"confidence": 0.9, "end": 2405.629, "track": 0, "text": "Address alright so you're going to see in and surfing when it's nice outside okay are you going anywhere I mean you love you guys work no more interesting but are you going anywhere exceptionally interesting soon.", "newpara": true, "start": 2395.858, "speaker": "BigDataBeard"}, {"confidence": 0.85, "end": 2409.781, "track": 2, "text": "I actually Arjun are both going to Nicaragua in May so yeah.", "newpara": true, "start": 2405.972, "speaker": "Tom"}, {"confidence": 0.94, "end": 2421.529, "track": 0, "text": "Pretty awesome all right so we usually want to know what TV show you're currently benjen on but for this episode I'm curious what is your favorite ski themed movie.", "newpara": true, "start": 2409.787, "speaker": "BigDataBeard"}, {"confidence": 0.64, "end": 2423.758, "track": 2, "text": "Hot dog carts.", "newpara": true, "start": 2421.914, "speaker": "Tom"}, {"confidence": 0.92, "end": 2425.399, "track": 1, "text": "Sharknado.", "newpara": true, "start": 2424.065, "speaker": "RJ"}, {"confidence": 0.98, "end": 2431.125, "track": 0, "text": "I can officially say that's never been listed.", "newpara": true, "start": 2425.299, "speaker": "BigDataBeard"}, {"confidence": 0.96, "end": 2435.558, "track": 1, "text": "We got we got to do a quick quick Q&A with you guys to like one question I got one.", "newpara": true, "start": 2431.162, "speaker": "RJ"}, {"confidence": 0.42, "end": 2436.047, "track": 0, "text": "Okay laying on us laying on it.", "newpara": true, "start": 2434.269, "speaker": "BigDataBeard"}, {"confidence": 0.91, "end": 2439.394, "track": 1, "text": "You got to recite your favorite movie quote.", "newpara": true, "start": 2436.061, "speaker": "RJ"}, {"confidence": 0.76, "end": 2446.641, "track": 1, "text": "Is that The Big Lebowski.", "newpara": true, "start": 2443.463, "speaker": "RJ"}, {"confidence": 0.85, "end": 2448.954, "track": 0, "text": "Anything from Paul Fix and probably.", "newpara": true, "start": 2447.068, "speaker": "BigDataBeard"}, {"confidence": 0.95, "end": 2457.746, "track": 0, "text": "Very good thank you so much for being on the show I will say I highly encourage folks that are anywhere near.", "start": 2450.379, "speaker": "BigDataBeard"}, {"confidence": 0.92, "end": 2469.379, "track": 0, "text": "Lake Tahoe to come out to Squaw Valley Resort have one of the best experiences on a mountain I can imagine and you guys are absolute best in NY I think will be an amazing experience going forward so thanks for spending time with us in this.", "start": 2457.86, "speaker": "BigDataBeard"}, {"confidence": 0.98, "end": 2470.911, "track": 0, "text": "Utterly beautiful location.", "start": 2469.518, "speaker": "BigDataBeard"}, {"confidence": 0.81, "end": 2473.063, "track": 2, "text": "Awesome thanks Corey thanks Brett preach.", "newpara": true, "start": 2471.345, "speaker": "Tom"}, {"confidence": 0.94, "end": 2474.944, "track": 1, "text": "Thank you appreciate it yeah.", "newpara": true, "start": 2471.963, "speaker": "RJ"}]