[{"confidence": 0.91, "end": 10.66, "track": 0, "text": "How to fix this is Cory Minton from the big to the Beer team we are at strata conference in San Jose California and we are in day 2.", "newpara": true, "start": 2.921, "speaker": "Cory Minton"}, {"confidence": 0.87, "end": 16.248, "track": 0, "text": "Had some awesome Keynotes this morning some of the funniest kid notes I've ever seen at a.", "start": 10.907, "speaker": "Cory Minton"}, {"confidence": 0.79, "end": 17.841, "track": 1, "text": "The machine learning language and I was awesome.", "newpara": true, "start": 15.948, "speaker": "Rob Hout"}, {"confidence": 0.92, "end": 28.549, "track": 0, "text": "Yeah we're going to have to get with the AI weirdness that, as soon as possible so we are recording at our are both here in the hall and we've actually got to really excited yes so we have,", "newpara": true, "start": 17.577, "speaker": "Cory Minton"}, {"confidence": 0.93, "end": 32.941, "track": 0, "text": "Fabian from did Artisans and we got Flavio from Dell EMC to talk to us about.", "start": 28.591, "speaker": "Cory Minton"}, {"confidence": 0.91, "end": 44.01, "track": 0, "text": "Streaming data but it's also nice to know that I'm all know that I'm joined by Rob how the purveyor of the streaming data Scruff and it turns out the two guys talking and screaming did I have stuff as well welcome boys.", "start": 33.122, "speaker": "Cory Minton"}, {"confidence": 0.96, "end": 45.627, "track": 3, "text": "Thanks.", "newpara": true, "start": 44.455, "speaker": "Fabian Hueske"}, {"confidence": 0.85, "end": 50.29, "track": 0, "text": "Alright so baby I want you to do is a favor and tell us a little about who you are and what you do.", "newpara": true, "start": 45.861, "speaker": "Cory Minton"}, {"confidence": 0.91, "end": 60.042, "track": 3, "text": "Yes I'm a co-founder and stuff engineer at The Artisans I'm also a PMC member of Apache Flink I'm with the project since the beginning so.", "newpara": true, "start": 50.741, "speaker": "Fabian Hueske"}, {"confidence": 0.88, "end": 69.074, "track": 3, "text": "Yeah I kind of that was my PhD project and we brought that afterwards in to do the Apache software foundation and I'm sticking with.", "start": 60.518, "speaker": "Fabian Hueske"}, {"confidence": 0.62, "end": 71.458, "track": 0, "text": "Alright so PhD where where are you sitting.", "newpara": true, "start": 69.435, "speaker": "Cory Minton"}, {"confidence": 0.62, "end": 73.184, "track": 3, "text": "In Berlin Germany.", "newpara": true, "start": 71.208, "speaker": "Fabian Hueske"}, {"confidence": 0.71, "end": 77.955, "track": 0, "text": "Alfred go home my favorite cities that's awesome what you do.", "newpara": true, "start": 73.175, "speaker": "Cory Minton"}, {"confidence": 0.78, "end": 83.73, "track": 2, "text": "Yeah he's a thanks for having me today and Fabian is of course.", "newpara": true, "start": 78.407, "speaker": "Flavio Junqueira"}, {"confidence": 0.89, "end": 93.206, "track": 2, "text": "Current leads the project project that dailyom seat so pravegaya is an open source project starting a new we have started doing it.", "start": 84.301, "speaker": "Flavio Junqueira"}, {"confidence": 0.82, "end": 101.09, "track": 2, "text": "Even 2 years ago will pass or say last year so I guess people are still getting to know where they go.", "start": 93.814, "speaker": "Flavio Junqueira"}, {"confidence": 0.91, "end": 111.871, "track": 2, "text": "A before pravega I've done a bunch of things affect I was doing research before before.", "start": 101.866, "speaker": "Flavio Junqueira"}, {"confidence": 0.92, "end": 125.812, "track": 2, "text": "At what is a Yahoo search than Microsoft research and then I work for counseling for a for sometime and then I joined another provocative mean and IM see that's what I'm doing today I've been doing open source for quite a bit of time.", "start": 112.208, "speaker": "Flavio Junqueira"}, {"confidence": 0.9, "end": 139.152, "track": 2, "text": "As I was I was one of people who started projects like Apache zookeeper in and Apache bookkeeper so I'll be involved with Apache projects for for quite some time and I find it very excited to work an open house projects that we like.", "start": 126.125, "speaker": "Flavio Junqueira"}, {"confidence": 0.83, "end": 142.084, "track": 2, "text": "If you're working with the community and inside.", "start": 139.423, "speaker": "Flavio Junqueira"}, {"confidence": 0.93, "end": 151.837, "track": 0, "text": "Very cool so you guys are doing a taco today cuz I find it interesting that you guys are here together and you're going to tell him that I joined story but your your title later today is as title Unified.", "newpara": true, "start": 142.013, "speaker": "Cory Minton"}, {"confidence": 0.94, "end": 161.361, "track": 0, "text": "Inelastic batch and stream processing with pravega and apache-flink so help me understand why you guys like what's the story with these together and then let's dig into it.", "start": 151.946, "speaker": "Cory Minton"}, {"confidence": 0.94, "end": 172.25, "track": 3, "text": "Yeah so did the story that we are here telling us so we're basically Sharon division of yeah it's a sad unified Bisons game processing.", "newpara": true, "start": 163.561, "speaker": "Fabian Hueske"}, {"confidence": 0.82, "end": 177.484, "track": 3, "text": "We see these today these concerts are basically seen as to.", "start": 172.545, "speaker": "Fabian Hueske"}, {"confidence": 0.93, "end": 188.805, "track": 3, "text": "Distinct distinct processing prayer times and in our vision we want to share that you can actually do that with the combination of two systems.", "start": 177.935, "speaker": "Fabian Hueske"}, {"confidence": 0.87, "end": 194.628, "track": 3, "text": "But integrate nicely with each other and Men or talk we going to talk about how Rebecca and Flint.", "start": 189.046, "speaker": "Fabian Hueske"}, {"confidence": 0.84, "end": 199.2, "track": 3, "text": "Can be such a combination to achieve this unification affection screen process.", "start": 194.85, "speaker": "Fabian Hueske"}, {"confidence": 0.94, "end": 201.586, "track": 0, "text": "Okay so for the folks who don't know so batch processing.", "newpara": true, "start": 199.111, "speaker": "Cory Minton"}, {"confidence": 0.94, "end": 212.949, "track": 0, "text": "Is pretty common in the another Hadoop land rights on that produce obviously be in the early sort of batch processing many of the other Frameworks that have come along since I've been sort of batch oriented is that accurate,", "start": 201.725, "speaker": "Cory Minton"}, {"confidence": 0.95, "end": 219.367, "track": 0, "text": "so then what's the like why is streaming so important what is streaming do for us that we can't do with Bash.", "start": 212.998, "speaker": "Cory Minton"}, {"confidence": 0.86, "end": 233.482, "track": 2, "text": "What's the one thing is processing data any real time as soon just in time trying to get insights and you know very quickly over the day that they are in Jackson.", "newpara": true, "start": 223.532, "speaker": "Flavio Junqueira"}, {"confidence": 0.96, "end": 248.577, "track": 2, "text": "So you can think of a number of applications that can benefit from this if you're trying you're trying to get recommendations out of a you know whatever set of events that that is coming in it's important that you process those events in a in an orderly manner.", "start": 233.699, "speaker": "Flavio Junqueira"}, {"confidence": 0.85, "end": 252.741, "track": 2, "text": "Right because if you want to determine that a things you know one.", "start": 248.818, "speaker": "Flavio Junqueira"}, {"confidence": 0.94, "end": 262.157, "track": 2, "text": "Get one type of customers is purchasing one thing and then purchasing the next one and you want to do this or recommendation to another customer you'd like to know that.", "start": 253.102, "speaker": "Flavio Junqueira"}, {"confidence": 0.89, "end": 269.302, "track": 2, "text": "So those kinds of a of a that kind of processing and dick out of a recommendation that something you can do with your new real time.", "start": 262.723, "speaker": "Flavio Junqueira"}, {"confidence": 0.84, "end": 276.387, "track": 2, "text": "Crossing over the date of the other spaces other demands of applications that are also interesting.", "start": 269.88, "speaker": "Flavio Junqueira"}, {"confidence": 0.89, "end": 283.015, "track": 2, "text": "People talk a lot of a lot about iot this stays right so sensors sensors producing.", "start": 276.832, "speaker": "Flavio Junqueira"}, {"confidence": 0.91, "end": 298.236, "track": 2, "text": "Lots of samples of a time and in are you processing all those samples and trying to make sense of all that data sometimes it reacting to the interchurch it up servation to make out of there are the sensors connected cars connected Home Center and all that stuff.", "newpara": true, "start": 284.007, "speaker": "Flavio Junqueira"}, {"confidence": 0.85, "end": 302.929, "track": 0, "text": "Sabaton screaming and in many many large organizations can have is if these Technologies.", "newpara": true, "start": 298.098, "speaker": "Cory Minton"}, {"confidence": 0.96, "end": 315.139, "track": 0, "text": "Can I came into fruition a lot of folks adopted this concept of the land architecture where you had this sort of streaming you know capability that was for that near-real-time sort of analytics and then you had this batch that was.", "start": 303.17, "speaker": "Cory Minton"}, {"confidence": 0.95, "end": 329.651, "track": 0, "text": "You know yet you still had to store all the data in some persistent file system but then you created these views that were logical based on the needs of the business right and that was the concept of Landon if I if I know if I've heard her correctly about some things if link is after another's is.", "start": 315.825, "speaker": "Cory Minton"}, {"confidence": 0.82, "end": 334.314, "track": 0, "text": "At a table made of a slightly modified architecture I think the folks called the kappas at the right.", "start": 329.808, "speaker": "Cory Minton"}, {"confidence": 0.94, "end": 346.988, "track": 0, "text": "So some of the terms so help me understand what you guys are doing is it is this a and that this is part of the land architecture where you're continuing to just do that differently less lossy can a more accurate or you.", "start": 334.681, "speaker": "Cory Minton"}, {"confidence": 0.93, "end": 350.256, "track": 0, "text": "Truly like changing the overall data pipeline in architecture.", "start": 347.198, "speaker": "Cory Minton"}, {"confidence": 0.91, "end": 359.889, "track": 3, "text": "Answer the main motivation for the land architecture was to provide Frost the results for for analytics dashboard.", "newpara": true, "start": 351.296, "speaker": "Fabian Hueske"}, {"confidence": 0.94, "end": 374.713, "track": 3, "text": "You would have like a man in the classical Pax Brothers in science what collect data for certain amount of time then if your batch processing trip to Crunch the Raider and right at 8 hours to some some Cafe Restaurant later or let her use it.", "start": 360.082, "speaker": "Fabian Hueske"}, {"confidence": 0.9, "end": 388.384, "track": 3, "text": "The land architecture you would have added real-time system that processes the day to answer this as it arrives but at that time and its architecture was proposed the systems that screaming systems when that mature.", "start": 375.074, "speaker": "Fabian Hueske"}, {"confidence": 0.9, "end": 398.251, "track": 3, "text": "And only could only produce a proximate result so they results better not not exactly the same as batch process I would have produced.", "start": 388.787, "speaker": "Fabian Hueske"}, {"confidence": 0.89, "end": 409.458, "track": 3, "text": "Modern stream technology stream processing technology you can actually get much closer to do this trip to the results that match president.", "start": 399.778, "speaker": "Fabian Hueske"}, {"confidence": 0.87, "end": 414.331, "track": 0, "text": "Okay so cuz that's one thing so stringent when it first started out that the concern was that.", "newpara": true, "start": 409.693, "speaker": "Cory Minton"}, {"confidence": 0.95, "end": 426.812, "track": 0, "text": "If I want to go fast I get real-time then I had to be willing to give up Fidelity right accuracy which scares people like in a recommendation engine it's not that big of a deal cuz if you get a recommendation a little bit wrong.", "start": 414.566, "speaker": "Cory Minton"}, {"confidence": 0.91, "end": 436.312, "track": 0, "text": "It's not like detrimental the company but if you were trying to see if you get if you get that data wrong and you make that decision incorrectly like somebody's life is at stake.", "start": 427.185, "speaker": "Cory Minton"}, {"confidence": 0.93, "end": 443.583, "track": 0, "text": "So is what you're saying that these new architectures are allowing us to not have to make those selections between speed and fidelity.", "start": 436.505, "speaker": "Cory Minton"}, {"confidence": 0.91, "end": 453.324, "track": 2, "text": "But it's smaller than that right side only Fidelity you also have to consider that if you if you do the lungs architecture you have to datapads to maintain.", "newpara": true, "start": 444.149, "speaker": "Flavio Junqueira"}, {"confidence": 0.91, "end": 465.348, "track": 2, "text": "Straight sew-in if you have you have you found in operations you have to deal with both by Plies The Real Time one which is perhaps not accurate but that doesn't have high fidelity.", "start": 454.015, "speaker": "Flavio Junqueira"}, {"confidence": 0.64, "end": 468.172, "track": 2, "text": "And the other one that is suing batch-processing.", "start": 465.757, "speaker": "Flavio Junqueira"}, {"confidence": 0.91, "end": 476.309, "track": 1, "text": "2 digit today to buy blinds to code sets to prove everything right so it's the main take the maintenance of that kind of environment probably comes down.", "newpara": true, "start": 468.251, "speaker": "Rob Hout"}, {"confidence": 0.93, "end": 478.73, "track": 2, "text": "He can be up yeah it can be a nightmare.", "newpara": true, "start": 476.201, "speaker": "Flavio Junqueira"}, {"confidence": 0.94, "end": 491.692, "track": 0, "text": "Help me understand what because Flink is a project that I know is is gained popularity over the last few years and it's super cool to talk somebody else sent but part of the team that's bringing that to its Russian tell me why.", "newpara": true, "start": 480.618, "speaker": "Cory Minton"}, {"confidence": 0.96, "end": 496.968, "track": 0, "text": "Flint came to be like what its history was and how it kind of fits in the in the ecosystem.", "start": 491.861, "speaker": "Cory Minton"}, {"confidence": 0.88, "end": 504.041, "track": 3, "text": "Yep so blink before I started out as an academic research project so.", "newpara": true, "start": 497.503, "speaker": "Fabian Hueske"}, {"confidence": 0.86, "end": 511.594, "track": 3, "text": "We initially designed that to be something like a hybrid system of meth use and relational database systems.", "start": 504.522, "speaker": "Fabian Hueske"}, {"confidence": 0.92, "end": 522.416, "track": 3, "text": "I forgot database research group so we packed a lot of database principles in the India processing engine we had an Optimizer to optimize certain the.", "start": 511.817, "speaker": "Fabian Hueske"}, {"confidence": 0.93, "end": 531.135, "track": 3, "text": "Processing strategies right from the start and we had a pipeline execution engine such as.", "newpara": true, "start": 523.18, "speaker": "Fabian Hueske"}, {"confidence": 0.85, "end": 541.147, "track": 3, "text": "And such are the ones that out today the best systems have and when my disease design decisions pretty much probably on when we brought them Flink.", "start": 531.587, "speaker": "Fabian Hueske"}, {"confidence": 0.86, "end": 544.361, "track": 3, "text": "Gave blank into the edges of a foundation.", "start": 541.477, "speaker": "Fabian Hueske"}, {"confidence": 0.9, "end": 559.072, "track": 3, "text": "We noticed that I'm still processing was really picking up and we were looking at bass guitar technology stack of the technology that thing provides and if they got well actually it's not that far away from what copas has to offer and.", "start": 544.807, "speaker": "Fabian Hueske"}, {"confidence": 0.85, "end": 567.935, "track": 3, "text": "We are basically at all these features that are necessary for a modern screen process such as.", "start": 559.348, "speaker": "Fabian Hueske"}, {"confidence": 0.82, "end": 579.274, "track": 3, "text": "Events in processing handling of lot State large state trooper from Statesboro complications of a streams and evolve these pictures now for A4 quiet quite some time.", "start": 568.314, "speaker": "Fabian Hueske"}, {"confidence": 0.91, "end": 589.784, "track": 0, "text": "Okay so what is the so if somebody's looking at you know there's more to get in the Stream processing like what's the big Advantage at a kind of at a higher level on what Flink does that maybe.", "newpara": true, "start": 579.353, "speaker": "Cory Minton"}, {"confidence": 0.94, "end": 597.464, "track": 0, "text": "I don't know what storm or even Kafka the might do like what's the the big pitch on why I should be really digging into flank.", "start": 590.037, "speaker": "Cory Minton"}, {"confidence": 0.73, "end": 602.866, "track": 3, "text": "So think I'm coming to the full spectrum of all streaming use cases.", "newpara": true, "start": 598.155, "speaker": "Fabian Hueske"}, {"confidence": 0.84, "end": 610.966, "track": 3, "text": "It's handled such a sad it was designed as a batch process that also have not found it streams would be cool like that. It's reprocessing.", "start": 603.161, "speaker": "Fabian Hueske"}, {"confidence": 0.93, "end": 622.293, "track": 3, "text": "Very well as well as a screaming analytics use cases but also have Android applications like the kind like the evolution of microservices architecture.", "start": 611.105, "speaker": "Fabian Hueske"}, {"confidence": 0.79, "end": 626.956, "track": 3, "text": "Hannah's all these all day the photo full spectrum of batch processing.", "start": 622.522, "speaker": "Fabian Hueske"}, {"confidence": 0.87, "end": 629.816, "track": 0, "text": "Okay so then if I wanted to play flank is it something that's,", "newpara": true, "start": 626.812, "speaker": "Cory Minton"}, {"confidence": 0.94, "end": 641.787, "track": 0, "text": "is it shipping with you know what your standard distribution of of a Hadoop distribution like pick your favorite one with his horn works or Cloudera or the open-source versions is fling shipping is part of that package or is it something that.", "start": 629.835, "speaker": "Cory Minton"}, {"confidence": 0.9, "end": 647.345, "track": 0, "text": "Lives underneath the Zookeeper or yarn heard in terms of service how does it actually get deployed.", "start": 641.967, "speaker": "Cory Minton"}, {"confidence": 0.84, "end": 655.944, "track": 3, "text": "So if you think it's not included in any any hair while it's included in elastic mapreduce Amazon.", "newpara": true, "start": 647.706, "speaker": "Fabian Hueske"}, {"confidence": 0.89, "end": 660.487, "track": 3, "text": "It's not not included by the other Defenders.", "newpara": true, "start": 656.996, "speaker": "Fabian Hueske"}, {"confidence": 0.94, "end": 674.211, "track": 3, "text": "Flint hamady price on yarn so you separate can run it as a yarn service it also runs on messes with a new release that will come out in a few in a few weeks I will also have a prime support when it is so you can actually.", "start": 660.673, "speaker": "Fabian Hueske"}, {"confidence": 0.96, "end": 681.302, "track": 3, "text": "Keep LifeLink pretty much everywhere and it also runs as a standalone system if you if you don't want to set up a resource manager.", "start": 674.578, "speaker": "Fabian Hueske"}, {"confidence": 0.94, "end": 694.564, "track": 0, "text": "Virtual so so we've got to link which handles Downstream processing very cool why do we need for Vega what what's the what's the reason why pravega exist and why is it complementary to what you're trying to accomplish.", "newpara": true, "start": 681.218, "speaker": "Cory Minton"}, {"confidence": 0.83, "end": 700.483, "track": 2, "text": "Right there are there two main reasons for pravega to exist.", "newpara": true, "start": 695.682, "speaker": "Flavio Junqueira"}, {"confidence": 0.92, "end": 712.892, "track": 2, "text": "When is any change s data and typically you the one couple the source that is producing data to the stream processor which is Lincoln dinner in the in the in the discussion.", "start": 701.157, "speaker": "Flavio Junqueira"}, {"confidence": 0.94, "end": 720.223, "track": 2, "text": "But that's something you don't want to do it don't do that coupling and so you need some some component to ingest that data.", "start": 713.703, "speaker": "Flavio Junqueira"}, {"confidence": 0.92, "end": 733.172, "track": 2, "text": "Traditionally this has been done with messaging systems are you look at a right angle Kafka author of messaging but substyle substrates that its substrate that that ingested it for you.", "start": 720.74, "speaker": "Flavio Junqueira"}, {"confidence": 0.81, "end": 740.6, "track": 2, "text": "Problem is those systems I've never be have not being developed.", "newpara": true, "start": 735.024, "speaker": "Flavio Junqueira"}, {"confidence": 0.92, "end": 752.173, "track": 2, "text": "They have not been designed and developed to host a top for snowfall for long periods of time for extended periods of time so if you have a string that is long granny has me running for and I know maybe ears.", "start": 740.901, "speaker": "Flavio Junqueira"}, {"confidence": 0.91, "end": 765.429, "track": 2, "text": "What you have to do is you have your recent past or than those systems and then your distant past is stored somewhere else movie to hdfs maybe and then going to do any processing you have to go to that other sister.", "start": 752.726, "speaker": "Flavio Junqueira"}, {"confidence": 0.93, "end": 773.529, "track": 2, "text": "What causes your complications to in passing that data because you can easily think that out when you want to do this over the data you might want to combine,", "start": 765.628, "speaker": "Flavio Junqueira"}, {"confidence": 0.9, "end": 783.787, "track": 2, "text": "you know that that the recent past with the with the distant past due joints over that and it that that kind of processing and if they are across separate systems you just complicates the life of webassign.", "start": 773.536, "speaker": "Flavio Junqueira"}, {"confidence": 0.95, "end": 791.322, "track": 2, "text": "To do that and so pravega is a system that allows you to ingest data and just keep it there in whatever form you choose.", "start": 783.949, "speaker": "Flavio Junqueira"}, {"confidence": 0.89, "end": 799.501, "track": 0, "text": "So like when you say whatever form like is it does it go and live in a file system does it go live in an object store like our visits until it with writing data.", "newpara": true, "start": 792.134, "speaker": "Cory Minton"}, {"confidence": 0.88, "end": 807.481, "track": 2, "text": "Obstruction is a string so you write you your pantry stream you read from a swing by say it nearly guarantee order.", "newpara": true, "start": 799.363, "speaker": "Flavio Junqueira"}, {"confidence": 0.94, "end": 816.891, "track": 2, "text": "A pretty bases that that kind of stuff but so we got into that ordered that is given by the application and the and the any process the data in extreme format.", "start": 808.088, "speaker": "Flavio Junqueira"}, {"confidence": 0.88, "end": 825.418, "track": 2, "text": "That's one of the things that I that we're trying to achieve overall is going with protected by the overall vision is that applications.", "start": 817.156, "speaker": "Flavio Junqueira"}, {"confidence": 0.91, "end": 829.245, "track": 2, "text": "Are the process data in string format.", "start": 826.133, "speaker": "Flavio Junqueira"}, {"confidence": 0.91, "end": 839.491, "track": 2, "text": "And how you need to Acacia of baton stream is is along those lines right so let's not differentiate batch and stream everything can be processed as a stream.", "start": 829.805, "speaker": "Flavio Junqueira"}, {"confidence": 0.94, "end": 854.934, "track": 1, "text": "Find a storage nerd it so I have a question what what what what makes up what makes when it comes to actually lay that down and we like what do I write so it may be calling it a stream but I don't know what's in.", "newpara": true, "start": 840.453, "speaker": "Rob Hout"}, {"confidence": 0.92, "end": 863.936, "track": 2, "text": "So abstractly for the application what he means is that we are storing the events you're giving us in order.", "newpara": true, "start": 855.662, "speaker": "Flavio Junqueira"}, {"confidence": 0.93, "end": 866.484, "track": 0, "text": "It's like an immutable log file right.", "newpara": true, "start": 864.411, "speaker": "Cory Minton"}, {"confidence": 0.92, "end": 874.8, "track": 2, "text": "Pretty much an internally while we do is to some extent expose that as well we have we have segments.", "newpara": true, "start": 866.785, "speaker": "Flavio Junqueira"}, {"confidence": 0.95, "end": 879.001, "track": 2, "text": "And the segments can be either open or seal.", "newpara": true, "start": 876.099, "speaker": "Flavio Junqueira"}, {"confidence": 0.89, "end": 892.605, "track": 2, "text": "And we use those to compose streams right so you can you can you know you can think of a stream as a as for example of a concatenation of a sealed sidemen in real Consignment and when you went to the open sign.", "newpara": true, "start": 880.016, "speaker": "Flavio Junqueira"}, {"confidence": 0.95, "end": 905.17, "track": 2, "text": "Overtime you can see you. Just like when you create another one and with that you can you can stay that I can spread that I download across across a number of service and I'm not limited by the capacity of a of one single machine.", "newpara": true, "start": 893.591, "speaker": "Flavio Junqueira"}, {"confidence": 0.8, "end": 914.7, "track": 2, "text": "But there are cool things I can do with that right with the satisfaction of segments another thing I can do is skate with string.", "start": 905.585, "speaker": "Flavio Junqueira"}, {"confidence": 0.9, "end": 925.066, "track": 2, "text": "But because I have one single segment if it's hot it's taking too much load I can see all that great you and have just given you power Listen by doing that.", "newpara": true, "start": 915.885, "speaker": "Flavio Junqueira"}, {"confidence": 0.86, "end": 926.514, "track": 0, "text": "I'm running across multiple machines that are.", "newpara": true, "start": 924.808, "speaker": "Cory Minton"}, {"confidence": 0.95, "end": 935.179, "track": 2, "text": "I run across multiple machines exactly right and in those two I can split into four and I don't know so depending on the workload I can we can I just.", "newpara": true, "start": 926.911, "speaker": "Flavio Junqueira"}, {"confidence": 0.78, "end": 942.246, "track": 2, "text": "Capacity for Gaston forestream Basin on that one we observe.", "start": 935.985, "speaker": "Flavio Junqueira"}, {"confidence": 0.92, "end": 951.71, "track": 0, "text": "Knows I can find to a to a Cluster meeting like in a location or can you actually segments that scale over distances between like data centers between clouds.", "newpara": true, "start": 942.222, "speaker": "Cory Minton"}, {"confidence": 0.88, "end": 956.944, "track": 2, "text": "It's okay instructor yes we haven't done that work yet.", "newpara": true, "start": 954.126, "speaker": "Flavio Junqueira"}, {"confidence": 0.83, "end": 958.531, "track": 0, "text": "Okay. That's totally fair that's right.", "newpara": true, "start": 956.686, "speaker": "Cory Minton"}, {"confidence": 0.88, "end": 963.236, "track": 0, "text": "I'm so so that's that's interesting so what's the.", "start": 960.154, "speaker": "Cory Minton"}, {"confidence": 0.95, "end": 978.144, "track": 0, "text": "What's the path for for consumption of afflink and pravega like how to people meet us out to dinner since I'll be so you guys bring Flink to Market and what is your value are you providing services are you providing licenses like what's your your delivery model.", "start": 963.663, "speaker": "Cory Minton"}, {"confidence": 0.93, "end": 987.729, "track": 3, "text": "Yeah so there are dozens provides distribution so which obviously includes open source link but also.", "newpara": true, "start": 978.133, "speaker": "Fabian Hueske"}, {"confidence": 0.93, "end": 1002.745, "track": 3, "text": "A proprietary component which we call the application manager and does application manager basically maintains the life cycle of applications of streaming applications these applications typically run 24/7 so they need like a special.", "start": 987.987, "speaker": "Fabian Hueske"}, {"confidence": 0.94, "end": 1013.898, "track": 3, "text": "38 Special Care when you want to maintain them and something to drink or price of each other Frank provides are safe points while you take consistent Snapchat the whole state of an application.", "start": 1002.926, "speaker": "Fabian Hueske"}, {"confidence": 0.88, "end": 1026.049, "track": 3, "text": "Put that in hdfs find some more S3 and then you can restore the application from that from that site once all the source I reset it to that position of the safe Point all the internet's verification reset.", "start": 1014.145, "speaker": "Fabian Hueske"}, {"confidence": 0.92, "end": 1030.423, "track": 3, "text": "And this is a very powerful tool because you can do things like stop and resume.", "start": 1026.217, "speaker": "Fabian Hueske"}, {"confidence": 0.94, "end": 1044.707, "track": 3, "text": "An application you can also run a pee test you run different applications starting from the same safe but you can migrate an application to another data center on Euclid version and all these things nicely integrated in this application manager.", "start": 1030.58, "speaker": "Fabian Hueske"}, {"confidence": 0.88, "end": 1048.432, "track": 0, "text": "That's incredible that's pretty interesting cuz that's one of the things I think.", "newpara": true, "start": 1044.996, "speaker": "Cory Minton"}, {"confidence": 0.93, "end": 1061.598, "track": 0, "text": "A lot of the the modern applications of struggled with which is that traditional it thing of I need to be able to take a point in time snap of a application recreated for Natalie purposive disaster recovery.", "start": 1048.757, "speaker": "Cory Minton"}, {"confidence": 0.95, "end": 1070.648, "track": 0, "text": "How about I take a copy of that put an hdfs set a replication job so that if I have a smoking whole disaster I can actually rebuild that critical application that's that's pretty interesting.", "start": 1061.947, "speaker": "Cory Minton"}, {"confidence": 0.88, "end": 1076.399, "track": 3, "text": "If I may interrupt you so we're actually have a user who's using this feature for an awesome.", "newpara": true, "start": 1071.808, "speaker": "Fabian Hueske"}, {"confidence": 0.93, "end": 1091.445, "track": 3, "text": "You scared so they are basically checking safe points and always going for the for the originator of yes that has the lowest spot into so they're running their applications on spot instances and whenever something fan stitches migration to the next to the next week.", "start": 1076.579, "speaker": "Fabian Hueske"}, {"confidence": 0.78, "end": 1092.479, "track": 0, "text": "See that's pretty slick.", "newpara": true, "start": 1091.512, "speaker": "Cory Minton"}, {"confidence": 0.93, "end": 1106.768, "track": 0, "text": "Think that that's what I see I was trying to get back that's what I want to know is like what's the use case I forget that you're building locations in this is a framework that allows you to do that but it's not that's cool I could actually solve the problem of decrease latency improve performance that's kind of cool.", "start": 1092.804, "speaker": "Cory Minton"}, {"confidence": 0.53, "end": 1108.349, "track": 1, "text": "1 calls.", "newpara": true, "start": 1106.51, "speaker": "Rob Hout"}, {"confidence": 0.93, "end": 1119.874, "track": 0, "text": "Yeah I know exactly what are some of the other like that it I saw there's a ton on your under the date our sins website you got great logos of customers that are using it what are some of the unique problems that they're solving by partnering with The Artisans.", "newpara": true, "start": 1107.244, "speaker": "Cory Minton"}, {"confidence": 0.84, "end": 1125.709, "track": 3, "text": "Yeah so are the friends i n g is using using fan for a fall protection.", "newpara": true, "start": 1120.464, "speaker": "Fabian Hueske"}, {"confidence": 0.91, "end": 1133.791, "track": 3, "text": "I like using that too young for to detect fraud and in financial transactions.", "start": 1126.052, "speaker": "Fabian Hueske"}, {"confidence": 0.82, "end": 1142.703, "track": 3, "text": "Yeah I thought you just are using flank to to build in House services based on secret screaming secret or.", "start": 1134.14, "speaker": "Fabian Hueske"}, {"confidence": 0.9, "end": 1156.92, "track": 3, "text": "We also know of a company that built the back end of her social network using Flink so that this is like an event-driven architecture design pattern and every click on a website basically.", "newpara": true, "start": 1143.857, "speaker": "Fabian Hueske"}, {"confidence": 0.9, "end": 1166.342, "track": 3, "text": "Create an event that goes into into into a m s h q stand deliver to flank handled by Frank and tragus also.", "newpara": true, "start": 1157.804, "speaker": "Fabian Hueske"}, {"confidence": 0.89, "end": 1175.68, "track": 3, "text": "Other operations and again this company uses light side points for for princess for AP testing 2 to test different recommendation.", "start": 1166.709, "speaker": "Fabian Hueske"}, {"confidence": 0.88, "end": 1180.854, "track": 0, "text": "Shoulder like if it's on just my mind starts going on anytime I hear like event processing already I start thinking about like.", "newpara": true, "start": 1175.621, "speaker": "Cory Minton"}, {"confidence": 0.91, "end": 1192.71, "track": 0, "text": "You know machine-generated data logs like so thinking about log analytics and is there a is there a used case or do you see a future where that could be used for large-scale log information and analytics for.", "start": 1181.161, "speaker": "Cory Minton"}, {"confidence": 0.95, "end": 1197.463, "track": 0, "text": "Things like preventive maintenance if you think about the iot constructive dealing with how do I make sure that.", "start": 1192.927, "speaker": "Cory Minton"}, {"confidence": 0.93, "end": 1207.294, "track": 0, "text": "Assets in the field are being consistently monitored so that I can analyze are virtues when we take them out of a so you know how to production is that kind of a future that kind of a different use case.", "start": 1197.614, "speaker": "Cory Minton"}, {"confidence": 0.83, "end": 1214.433, "track": 3, "text": "No I think that actually fits the the division of think that pretty well like out of this place.", "newpara": true, "start": 1208.118, "speaker": "Fabian Hueske"}, {"confidence": 0.91, "end": 1221.463, "track": 0, "text": "Very cool Southern pravega obviously is an open-source thing but I think it's been announced in in previous conversations that.", "newpara": true, "start": 1214.271, "speaker": "Cory Minton"}, {"confidence": 0.8, "end": 1229.365, "track": 0, "text": "You know there's some Dell EMC project going on there where they're going to have this project code name which one of what Starbucks is open source today correct is that right.", "start": 1221.614, "speaker": "Cory Minton"}, {"confidence": 0.77, "end": 1230.91, "track": 2, "text": "Predict is open Saturday yes.", "newpara": true, "start": 1229.258, "speaker": "Flavio Junqueira"}, {"confidence": 0.96, "end": 1241.997, "track": 0, "text": "And then is there work being done inside LMC to do something similar to what they did Artisans has done with having that unique thing that they deliver above and beyond the open-source is that something that that's being worked on.", "newpara": true, "start": 1230.718, "speaker": "Cory Minton"}, {"confidence": 0.79, "end": 1245.86, "track": 2, "text": "Yes oh so we are we are working a platform.", "newpara": true, "start": 1241.889, "speaker": "Flavio Junqueira"}, {"confidence": 0.92, "end": 1260.474, "track": 2, "text": "But that's not that's not an official project product yet so he has been announced in some Dell EMC conferences it you know so that the project has been announced but it's not at IGA is IJ product.", "start": 1246.486, "speaker": "Flavio Junqueira"}, {"confidence": 0.95, "end": 1270.822, "track": 0, "text": "Very cool but the goal is then to create a like you said a streaming storage platform that allows these stream processors to ingest the beta separated from your traditional.", "newpara": true, "start": 1260.367, "speaker": "Cory Minton"}, {"confidence": 0.74, "end": 1273.057, "track": 2, "text": "Yes on the product side yes but.", "newpara": true, "start": 1270.552, "speaker": "Flavio Junqueira"}, {"confidence": 0.93, "end": 1283.555, "track": 2, "text": "Maybe I'd rather talk about more about the community cuz that's one of the directions that are that that we really want to go so we one of the reasons we wanted we open source early.", "start": 1273.244, "speaker": "Flavio Junqueira"}, {"confidence": 0.92, "end": 1295.946, "track": 2, "text": "Was exactly to be able to attract people and Guetta and Imperial Community around Utica meaning of developers set up perhaps excited about the technology about the cool things that at that we can do with all that attractions that we are proposing.", "start": 1284.018, "speaker": "Flavio Junqueira"}, {"confidence": 0.86, "end": 1305.903, "track": 2, "text": "And that sucks that's recently that we look into doing more I mean it's is still we still don't have many contributions are people interacting but we would discuss One Direction that we want to go.", "start": 1296.205, "speaker": "Flavio Junqueira"}, {"confidence": 0.87, "end": 1310.746, "track": 0, "text": "Well that's why you're here right I'm here talking about it showing the use cases excellence.", "newpara": true, "start": 1305.777, "speaker": "Cory Minton"}, {"confidence": 0.91, "end": 1311.598, "track": 2, "text": "Exactly in talking to you guys as well.", "newpara": true, "start": 1309.577, "speaker": "Flavio Junqueira"}, {"confidence": 0.75, "end": 1313.45, "track": 0, "text": "Yeah I've told are you going to go to get a greater than Siri.", "newpara": true, "start": 1311.348, "speaker": "Cory Minton"}, {"confidence": 0.96, "end": 1327.59, "track": 0, "text": "So so when you guys when you go prison I mean tell us a little bit about the story like it at a higher level like that what are the three things people are going to hear when they come sit in your session that they're going to take away and why they should go down with the slides and bring you guys in.", "start": 1313.733, "speaker": "Cory Minton"}, {"confidence": 0.91, "end": 1337.595, "track": 2, "text": "It's okay so I'm going to help line to talk and say I guess that's it that's a nice way of doing this so we will start by motivating.", "newpara": true, "start": 1328.071, "speaker": "Flavio Junqueira"}, {"confidence": 0.75, "end": 1342.354, "track": 2, "text": "Why we are talking about a unified batstream Vibeline.", "start": 1337.95, "speaker": "Flavio Junqueira"}, {"confidence": 0.86, "end": 1351.091, "track": 2, "text": "Price of giving queries along the lines of what I was saying before like you in a so you're crazy do not need to differentiate between recent passing this and that,", "start": 1342.601, "speaker": "Flavio Junqueira"}, {"confidence": 0.93, "end": 1358.891, "track": 2, "text": "and weather in of the data is is he or if the date is there and how do I make that work right so it's all coming from the same source.", "start": 1351.002, "speaker": "Flavio Junqueira"}, {"confidence": 0.84, "end": 1365.435, "track": 2, "text": "Vega and I in need to process City Express perhaps in with a sequel with a sequel query.", "start": 1359.156, "speaker": "Flavio Junqueira"}, {"confidence": 0.9, "end": 1377.212, "track": 2, "text": "So that that's that's that that's out of the motivation of of of the work and then a provider provides a number of features that enable the processing with fling.", "start": 1365.952, "speaker": "Flavio Junqueira"}, {"confidence": 0.85, "end": 1382.02, "track": 2, "text": "To be really but you be efficient and effective.", "start": 1378.096, "speaker": "Flavio Junqueira"}, {"confidence": 0.92, "end": 1394.837, "track": 2, "text": "For example one of the really nice things that we can do is is processing with exactly one semantics so in pravega we provide two features that enable that in the flame pipeline maybe Fabian wants to talk about it.", "start": 1382.471, "speaker": "Flavio Junqueira"}, {"confidence": 0.88, "end": 1407.18, "track": 2, "text": "On the flip side by the end of the checkpoint in we do on the reader side and the and the the transaction to provide on the right side and Abel has to have a full pipeline.", "start": 1395.084, "speaker": "Flavio Junqueira"}, {"confidence": 0.91, "end": 1413.646, "track": 2, "text": "I think job reads data from pravega right and Xena does its processing and outstate a bag.", "start": 1407.529, "speaker": "Flavio Junqueira"}, {"confidence": 0.62, "end": 1419.012, "track": 0, "text": "Very cool did you want to come to the door.", "newpara": true, "start": 1415.088, "speaker": "Cory Minton"}, {"confidence": 0.89, "end": 1431.408, "track": 0, "text": "So we just need some in the past and I think you're kind of letting this earlier like we've seen early stages of this and there was I think it was it was it was a dumb SeaWorld last year when they did the the brain waves.", "start": 1420.4, "speaker": "Cory Minton"}, {"confidence": 0.83, "end": 1435.945, "track": 1, "text": "We did it we did it at at David works.", "newpara": true, "start": 1431.108, "speaker": "Rob Hout"}, {"confidence": 0.8, "end": 1438.217, "track": 0, "text": "So tell me but to be part of that do you know what time at the.", "newpara": true, "start": 1435.657, "speaker": "Cory Minton"}, {"confidence": 0.92, "end": 1439.412, "track": 2, "text": "Yeah I know yet.", "newpara": true, "start": 1437.917, "speaker": "Flavio Junqueira"}, {"confidence": 0.93, "end": 1448.264, "track": 0, "text": "Okay so tell me about that cuz it was I saw people I literally walked by this booth and I saw people wearing these you know look like you know EKG or whatever monitors on their heads.", "newpara": true, "start": 1439.263, "speaker": "Cory Minton"}, {"confidence": 0.92, "end": 1455.937, "track": 0, "text": "Well this isn't being a virtual reality this is freaking me out or what are we doing so tell me about what that like what that wasn't going to use casewise what that drill.", "start": 1448.402, "speaker": "Cory Minton"}, {"confidence": 0.88, "end": 1465.197, "track": 2, "text": "Was that was that thing in the head I don't know that out that's called to be honest but that was just a bunch of sensors generating.", "newpara": true, "start": 1456.106, "speaker": "Flavio Junqueira"}, {"confidence": 0.97, "end": 1466.537, "track": 2, "text": "Events.", "start": 1465.727, "speaker": "Flavio Junqueira"}, {"confidence": 0.9, "end": 1479.565, "track": 2, "text": "I said if application was actually pretty simple that was just some visualization around the events that that add that device is generating I show you know your brain waves and so on based on a remember correct was like a bunch of questions and opinions,", "start": 1466.748, "speaker": "Flavio Junqueira"}, {"confidence": 0.76, "end": 1483.639, "track": 2, "text": "I know how your reaction was then your brain with this play differently so.", "start": 1479.644, "speaker": "Flavio Junqueira"}, {"confidence": 0.91, "end": 1490.279, "track": 0, "text": "It's another done that at conferences around the world and you're not reading Minds that's what I just took away from that.", "newpara": true, "start": 1483.387, "speaker": "Cory Minton"}, {"confidence": 0.92, "end": 1503.974, "track": 0, "text": "The answers to questions that's very cool so I wanted to give you the chance to talk about your session I've certainly we encourage folks to go check out this will the slides be online are you guys going to post your slides online after order.", "start": 1490.574, "speaker": "Cory Minton"}, {"confidence": 0.95, "end": 1516.605, "track": 0, "text": "And I will try to grab the link for those to the folks can check them out weird if I had a folks engage with you to personally if they're interested in learning more about data artisans in about 4 Vega what's the best way for them to engage you to learn more.", "start": 1504.894, "speaker": "Cory Minton"}, {"confidence": 0.89, "end": 1526.099, "track": 3, "text": "Yes or no for me the best way would be you can write me on my Apache email address which is probably out there if you want.", "newpara": true, "start": 1517.224, "speaker": "Fabian Hueske"}, {"confidence": 0.96, "end": 1528.978, "track": 0, "text": "You guys have sales guys that are like out in the field selling for you or.", "newpara": true, "start": 1525.799, "speaker": "Cory Minton"}, {"confidence": 0.85, "end": 1537.462, "track": 3, "text": "Oh yeah of course I mean well so far yeah you can also reach out by the day. Is this website to us if you don't want the approximate.", "newpara": true, "start": 1529.056, "speaker": "Fabian Hueske"}, {"confidence": 0.94, "end": 1551.866, "track": 0, "text": "That's good we'll find you in Apache what about you how's the best place for how do people if they want to learn more about for vague and they want to learn more about the Dell EMC kind of work on the side in terms of product ization what's the best ways for folks to engage with you.", "newpara": true, "start": 1537.493, "speaker": "Cory Minton"}, {"confidence": 0.87, "end": 1559.456, "track": 2, "text": "Yes for protecting itself that is a website for Vegas that are you outside our main repository son isn't get hub.", "newpara": true, "start": 1552.077, "speaker": "Flavio Junqueira"}, {"confidence": 0.9, "end": 1567.634, "track": 2, "text": "I'm in fact a starting point to highlight that that's where we do the work is out there we have an internal branch and push stuff out we will redo the work.", "start": 1559.654, "speaker": "Flavio Junqueira"}, {"confidence": 0.88, "end": 1576.491, "track": 2, "text": "In under you have a repository directly so we're going to go there going to see all of all the thousand in the same no pushing stuff and interacting a song.", "start": 1567.995, "speaker": "Flavio Junqueira"}, {"confidence": 0.9, "end": 1589.771, "track": 2, "text": "So you just said about the project self go there and I'll check while we're doing the things that they're going on as such if you want to reach out to me directly I mean the number of ways is that is right.", "start": 1576.738, "speaker": "Flavio Junqueira"}, {"confidence": 0.88, "end": 1593.335, "track": 2, "text": "I guess I am not active on Facebook these days but no lie.", "start": 1590.349, "speaker": "Flavio Junqueira"}, {"confidence": 0.79, "end": 1594.537, "track": 0, "text": "Trash fire you don't.", "newpara": true, "start": 1593.389, "speaker": "Cory Minton"}, {"confidence": 0.87, "end": 1606.459, "track": 2, "text": "At least LinkedIn Anna and the Intruder II check regularly so free free to connect on those and then I'll email all his works fpj at a party.", "newpara": true, "start": 1595.264, "speaker": "Flavio Junqueira"}, {"confidence": 0.89, "end": 1616.476, "track": 0, "text": "So then one quick question for you shift gears you're here this week going to be talking about this this idea of unified in elastic and unified an elastic search for streaming batch.", "newpara": true, "start": 1607.018, "speaker": "Cory Minton"}, {"confidence": 0.93, "end": 1625.105, "track": 0, "text": "What's next what are you guys doing over the next couple months like what are the exciting projects you're working on our kind of the the direction you're trying to take the product and give us a little forecast would be great.", "start": 1616.843, "speaker": "Cory Minton"}, {"confidence": 0.84, "end": 1632.526, "track": 3, "text": "Yeah so I've been working for the last 2 years on Nexus I'd like the radiation if you guys like screaming Secrets very very hot topic.", "newpara": true, "start": 1625.676, "speaker": "Fabian Hueske"}, {"confidence": 0.8, "end": 1636.534, "track": 3, "text": "I was just asking like being Integrated Health System ski stays.", "start": 1632.845, "speaker": "Fabian Hueske"}, {"confidence": 0.93, "end": 1651.454, "track": 3, "text": "Blinkist Farragut support for offering streaming Secret Service on streams but also an investigator we do that in a way that you don't have a special special send text message to Magic so it running the Furious.", "start": 1636.721, "speaker": "Fabian Hueske"}, {"confidence": 0.89, "end": 1659.771, "track": 3, "text": "Bad semantics with Patterson Tax on streams which also means they can easily part part lyrics from historic attitude originator.", "start": 1651.737, "speaker": "Fabian Hueske"}, {"confidence": 0.89, "end": 1665.474, "track": 3, "text": "Something that I'm I'm working on into something that I will also continue to be working on.", "start": 1660.006, "speaker": "Fabian Hueske"}, {"confidence": 0.95, "end": 1679.493, "track": 0, "text": "Rico becomes at their first I understand correctly for Steven Seagal apis that you can any of those previous queries that you can have built in the batch contacts that you can without having to totally rewrite the way that you interact with stream data sets you can actually take those.", "newpara": true, "start": 1665.432, "speaker": "Cory Minton"}, {"confidence": 0.84, "end": 1684.192, "track": 0, "text": "Complex equal language grease and move them into the stream is the day after that.", "start": 1679.776, "speaker": "Cory Minton"}, {"confidence": 0.87, "end": 1691.914, "track": 3, "text": "ESO what what basically happens is that the screws are the end not not processed by.", "newpara": true, "start": 1684.18, "speaker": "Fabian Hueske"}, {"confidence": 0.83, "end": 1700.158, "track": 3, "text": "Investing all day that once crash another day too and debating Resort properties Coricidin incrementally computer.", "start": 1692.431, "speaker": "Fabian Hueske"}, {"confidence": 0.86, "end": 1705.086, "track": 3, "text": "So I kinda like similar to what battery system is doing when you're building a materialist View,", "start": 1700.321, "speaker": "Fabian Hueske"}, {"confidence": 0.88, "end": 1718.095, "track": 3, "text": "so you're changing the base status of the definition and then these changes need to be propagated into the material rescue so this is basically doing that in, in the context of length that is running late just wait at sister,", "start": 1705.134, "speaker": "Fabian Hueske"}, {"confidence": 0.69, "end": 1720.421, "track": 3, "text": "High throughput streams.", "start": 1718.162, "speaker": "Fabian Hueske"}, {"confidence": 0.89, "end": 1727.049, "track": 0, "text": "Okay so so what's the next big conference for you are you presenting it any any conferences your next few months.", "newpara": true, "start": 1720.704, "speaker": "Cory Minton"}, {"confidence": 0.85, "end": 1734.752, "track": 3, "text": "Oh yeah so they will be looking forward conference in a month here in San Francisco.", "newpara": true, "start": 1728.059, "speaker": "Fabian Hueske"}, {"confidence": 0.88, "end": 1743.327, "track": 3, "text": "Yeah so the conference will see quite a lot of interesting use cases of length that would be an awesome show.", "newpara": true, "start": 1735.462, "speaker": "Fabian Hueske"}, {"confidence": 0.89, "end": 1750.827, "track": 0, "text": "You have like 4 weeks all that on the web and I was like this is cool so how many people are saying that in that have you cuz I know it's it's only was last year the first year for point forward.", "newpara": true, "start": 1743.232, "speaker": "Cory Minton"}, {"confidence": 0.9, "end": 1763.337, "track": 3, "text": "So we had last year the first fin 14 San Francisco we had it already three times in Berlin yeah so usually about three to three and 50 people.", "newpara": true, "start": 1750.935, "speaker": "Fabian Hueske"}, {"confidence": 0.92, "end": 1774.172, "track": 0, "text": "That's awesome and we'll go over look forward to some news over there maybe we'll come by and hang out with you\nfuck it what's your what's your next up man what are you working on the next few months\nGolden Community obviously.", "newpara": true, "start": 1763.458, "speaker": "Cory Minton"}, {"confidence": 0.88, "end": 1778.817, "track": 2, "text": "Yes been community at exit but probably the question is what I'm not working.", "newpara": true, "start": 1774.088, "speaker": "Flavio Junqueira"}, {"confidence": 0.88, "end": 1788.131, "track": 2, "text": "Thanks a bunch of things that directly doing of course I'm not at the stages same say yes Frank.", "newpara": true, "start": 1780.277, "speaker": "Flavio Junqueira"}, {"confidence": 0.88, "end": 1795.834, "track": 2, "text": "If there's lots of things I still need to do I think one exciting thing that we were really going to be working on his side.", "start": 1788.36, "speaker": "Flavio Junqueira"}, {"confidence": 0.89, "end": 1809.583, "track": 2, "text": "Historical stream processing boosting your historical swing Brasi story in sorry I focus a lot on the on the east side of New York near real-time stream processing story but you know we also care about the distant past data which.", "start": 1796.015, "speaker": "Flavio Junqueira"}, {"confidence": 0.82, "end": 1817.665, "track": 2, "text": "And if we need to boost outside around there to provide a new features on efficiently.", "start": 1809.836, "speaker": "Flavio Junqueira"}, {"confidence": 0.93, "end": 1826.727, "track": 2, "text": "So yeah so that's that's one thing that we going to be focusing on and in addition to I don't know stuff like security and all the fun stuff.", "newpara": true, "start": 1818.747, "speaker": "Flavio Junqueira"}, {"confidence": 0.92, "end": 1829.99, "track": 0, "text": "Governance and all the other fun things are you going to be at the flick forward conference as well.", "newpara": true, "start": 1826.439, "speaker": "Cory Minton"}, {"confidence": 0.84, "end": 1837.117, "track": 2, "text": "I'm compared to Free Fall conference then at the data which conference in Berlin then then Estrada London answer.", "newpara": true, "start": 1830.189, "speaker": "Flavio Junqueira"}, {"confidence": 0.95, "end": 1840.326, "track": 0, "text": "Yeah okay very cool you're making the full conference circuit that's awesome.", "newpara": true, "start": 1836.943, "speaker": "Cory Minton"}, {"confidence": 0.8, "end": 1841.593, "track": 2, "text": "Community Building.", "newpara": true, "start": 1840.5, "speaker": "Flavio Junqueira"}, {"confidence": 0.95, "end": 1851.328, "track": 0, "text": "That's right that's exactly what you're doing well very cool guys thank you so much for being on it again I encourage folks to check out the the slides will put a link in the show notes for folks into Flink,", "newpara": true, "start": 1841.293, "speaker": "Cory Minton"}, {"confidence": 0.86, "end": 1858.064, "track": 0, "text": "today Taurus and what you're doing there that the unique project things you doing their sounds really interesting and I'll be super Vega building a community,", "start": 1851.341, "speaker": "Cory Minton"}, {"confidence": 0.94, "end": 1865.335, "track": 0, "text": "if you're interested in getting involved certainly reach out and get involved in the get Hub in the put it on my work but thanks again for being on guys I want to do a quick.", "start": 1858.083, "speaker": "Cory Minton"}, {"confidence": 0.93, "end": 1873.129, "track": 0, "text": "Shift here we have a little fun section of the show we like to call Rapid Fire and it's basically our chance to just ask you some fun personal questions,", "start": 1865.48, "speaker": "Cory Minton"}, {"confidence": 0.92, "end": 1876.669, "track": 0, "text": "so here's that works you basically just sit back relax take a deep breath.", "start": 1873.196, "speaker": "Cory Minton"}, {"confidence": 0.94, "end": 1887.905, "track": 0, "text": "And say the first thing that comes to mind then when I ask you these questions and we'll just going to I'll go back and forth so we'll start with we will start with you Flavia what year do you think Skynet will go online.", "start": 1877.042, "speaker": "Cory Minton"}, {"confidence": 0.86, "end": 1891.619, "track": 2, "text": "2013.", "newpara": true, "start": 1889.889, "speaker": "Flavio Junqueira"}, {"confidence": 0.82, "end": 1900.26, "track": 0, "text": "2030 alright what about you\nwe all are later we're all going to be killed if it doesn't okay what's the last good book you read.", "newpara": true, "start": 1891.583, "speaker": "Cory Minton"}, {"confidence": 0.88, "end": 1906.285, "track": 3, "text": "Oh that's that's probably brought the book that I'm currently writing.", "newpara": true, "start": 1901.997, "speaker": "Fabian Hueske"}, {"confidence": 0.87, "end": 1907.345, "track": 0, "text": "Oh you're writing a book.", "newpara": true, "start": 1906.216, "speaker": "Cory Minton"}, {"confidence": 0.94, "end": 1913.192, "track": 3, "text": "Yeah writing about ice cream processing with Apache Flink it's a still working progress but I hope it will be outside.", "newpara": true, "start": 1907.119, "speaker": "Fabian Hueske"}, {"confidence": 0.88, "end": 1914.67, "track": 0, "text": "We could be an O'Reilly media hopefully.", "newpara": true, "start": 1912.892, "speaker": "Cory Minton"}, {"confidence": 0.83, "end": 1921.058, "track": 3, "text": "Add wavy yeah it's already in the early early so you can look at it like\nunedited pets.", "newpara": true, "start": 1914.989, "speaker": "Fabian Hueske"}, {"confidence": 0.92, "end": 1924.675, "track": 0, "text": "I like it alright will check it out what about you what's the what's the best book you've read recently.", "newpara": true, "start": 1920.757, "speaker": "Cory Minton"}, {"confidence": 0.91, "end": 1934.35, "track": 2, "text": "I've been reading a lot about the political situation Catalunya sorry I don't know if you guys know about that but I am so that's it that's an issue that has been going on so I've been writing for myself.", "newpara": true, "start": 1924.838, "speaker": "Flavio Junqueira"}, {"confidence": 0.9, "end": 1939.115, "track": 0, "text": "How good for you stand for and on us next all right so what genre of music are you rocking these days.", "newpara": true, "start": 1934.338, "speaker": "Cory Minton"}, {"confidence": 0.84, "end": 1946.944, "track": 2, "text": "I don't know why I just go all over the place I go from classic to pop and end in rocket.", "newpara": true, "start": 1940.425, "speaker": "Flavio Junqueira"}, {"confidence": 0.9, "end": 1950.231, "track": 0, "text": "Alright so you're at your renaissance man with your music what about you.", "newpara": true, "start": 1946.873, "speaker": "Cory Minton"}, {"confidence": 0.92, "end": 1953.122, "track": 3, "text": "Yeah pretty much the same like it really depends on the mood.", "newpara": true, "start": 1950.016, "speaker": "Fabian Hueske"}, {"confidence": 0.94, "end": 1959.918, "track": 0, "text": "Keep it looks alright alright so what piece of technology is currently making your life worse.", "newpara": true, "start": 1953.032, "speaker": "Cory Minton"}, {"confidence": 0.9, "end": 1973.036, "track": 3, "text": "That's that's a that's a tough question what is my command I guess like all the all the mobile data situation Germany it's pretty awful.", "newpara": true, "start": 1962.761, "speaker": "Fabian Hueske"}, {"confidence": 0.98, "end": 1974.953, "track": 0, "text": "The mobile data situation what's going on there.", "newpara": true, "start": 1973.012, "speaker": "Cory Minton"}, {"confidence": 0.86, "end": 1981.629, "track": 3, "text": "Like all the other providers said it is all very expensive and not very good service.", "newpara": true, "start": 1974.827, "speaker": "Fabian Hueske"}, {"confidence": 0.86, "end": 1983.209, "track": 0, "text": "Really that's too bad cuz I actually have.", "newpara": true, "start": 1981.329, "speaker": "Cory Minton"}, {"confidence": 0.72, "end": 1989.615, "track": 3, "text": "So I'm my provider Park me here for 2 years are 6 megabytes.", "newpara": true, "start": 1983.396, "speaker": "Fabian Hueske"}, {"confidence": 0.89, "end": 1995.864, "track": 0, "text": "It's actually funny I actually bought so we were in Germany this past year and my wife.", "newpara": true, "start": 1991.13, "speaker": "Cory Minton"}, {"confidence": 0.94, "end": 2003.874, "track": 0, "text": "Has a phone from the us and we went over there and we ended up instead of buying one in London where it's an English-speaking country and I could have easily easily navigate to the website,", "start": 1996.021, "speaker": "Cory Minton"}, {"confidence": 0.84, "end": 2007.336, "track": 0, "text": "we waited till we go to Germany and so I got Vodafone Dez on Deutschland.", "start": 2003.905, "speaker": "Cory Minton"}, {"confidence": 0.93, "end": 2016.523, "track": 0, "text": "Like SIM card to put the iPhone oh my God you would not believe how hard it was for me to put money on the stupid thing I was blown away alright so what piece of technology is making your life worse.", "start": 2007.492, "speaker": "Cory Minton"}, {"confidence": 0.86, "end": 2021.403, "track": 2, "text": "I think that you obvious colors would be printers in video conferencing.", "newpara": true, "start": 2017.497, "speaker": "Flavio Junqueira"}, {"confidence": 0.93, "end": 2030.603, "track": 0, "text": "That's good that I like that one have you seen the baby seen the YouTube video of a if a video conference was in real life.", "newpara": true, "start": 2021.229, "speaker": "Cory Minton"}, {"confidence": 0.92, "end": 2039.899, "track": 0, "text": "I'll send you the like that dude it'll you'll die it's you if it's exactly the thing that you're talking about okay what is your your your biggest personal Money Pit right now.", "start": 2031.144, "speaker": "Cory Minton"}, {"confidence": 0.88, "end": 2043.823, "track": 0, "text": "Where you spending all your personal money.", "newpara": true, "start": 2041.732, "speaker": "Cory Minton"}, {"confidence": 0.94, "end": 2058.148, "track": 2, "text": "I don't know I think I'm just leaving that in the bank but I think I'm wine recently not a lot of it but I think probably more than I should.", "newpara": true, "start": 2045.74, "speaker": "Flavio Junqueira"}, {"confidence": 0.75, "end": 2060.117, "track": 0, "text": "What region what region are you into these days.", "newpara": true, "start": 2057.927, "speaker": "Cory Minton"}, {"confidence": 0.8, "end": 2061.447, "track": 2, "text": "Spanish wine of course.", "newpara": true, "start": 2059.927, "speaker": "Flavio Junqueira"}, {"confidence": 0.89, "end": 2063.142, "track": 0, "text": "Mine are very cool I want you baby.", "newpara": true, "start": 2061.209, "speaker": "Cory Minton"}, {"confidence": 0.83, "end": 2068.087, "track": 3, "text": "Yeah I don't have any expensive puppies.", "newpara": true, "start": 2063.058, "speaker": "Fabian Hueske"}, {"confidence": 0.9, "end": 2074.193, "track": 0, "text": "You guys are much smarter than us are you going anywhere exceptionally interesting soon for work or for.", "newpara": true, "start": 2065.672, "speaker": "Cory Minton"}, {"confidence": 0.86, "end": 2085.472, "track": 0, "text": "Shameless plug Fleet forward conference super interesting.", "newpara": true, "start": 2080.034, "speaker": "Cory Minton"}, {"confidence": 0.92, "end": 2093.085, "track": 3, "text": "I haven't talked about that already and I'm not sure how exciting how exciting San Francisco\nit's not a very exciting.", "newpara": true, "start": 2082.498, "speaker": "Fabian Hueske"}, {"confidence": 0.83, "end": 2093.872, "track": 0, "text": "Yeah there you go how about you you going to go anywhere cool.", "newpara": true, "start": 2090.76, "speaker": "Cory Minton"}, {"confidence": 0.91, "end": 2096.721, "track": 2, "text": "Yes I'm going to Barcelona I leave there.", "newpara": true, "start": 2094.209, "speaker": "Flavio Junqueira"}, {"confidence": 0.93, "end": 2105.728, "track": 0, "text": "You live in Barcelona I see I like I like Berlin and in Germany it's a great sound Barcelona if I had to pick one city to live in in Europe I think it be Barcelona.", "newpara": true, "start": 2096.421, "speaker": "Cory Minton"}, {"confidence": 0.91, "end": 2114.171, "track": 0, "text": "Yeah well so I got kind of thrown off because the the first customers visit that I went to an in Barcelona visit a couple years ago,", "start": 2106.654, "speaker": "Cory Minton"}, {"confidence": 0.94, "end": 2123.425, "track": 0, "text": "was Desi koala the the clothing manufacturer you know where their store is right over there their shop so it's right there on the point and literally I'm in this conference room and it's all glass.", "start": 2114.238, "speaker": "Cory Minton"}, {"confidence": 0.92, "end": 2129.025, "track": 0, "text": "I'm standing kind of on this whiteboard talking looking at people in the glasses behind them.", "start": 2124.032, "speaker": "Cory Minton"}, {"confidence": 0.93, "end": 2140.935, "track": 0, "text": "Animals on the beach and it's the beat it's the Barcelona Beach how do you guys get any work done or are you currently or have you recently binged on.", "start": 2129.212, "speaker": "Cory Minton"}, {"confidence": 0.85, "end": 2143.057, "track": 0, "text": "TV show or Netflix.", "start": 2141.447, "speaker": "Cory Minton"}, {"confidence": 0.91, "end": 2160.327, "track": 2, "text": "There is there is this show to series to see the series but that she is pretty serious I think when one of them is section on American Netflix is a cow money Heist.", "newpara": true, "start": 2146.344, "speaker": "Flavio Junqueira"}, {"confidence": 0.86, "end": 2168.619, "track": 2, "text": "But I like that one a lot and does another one that I actually don't know the translation to that to Spanish ministerio Del Tiempo.", "newpara": true, "start": 2162.508, "speaker": "Flavio Junqueira"}, {"confidence": 0.85, "end": 2172.489, "track": 0, "text": "Okay alright do I need any TV shows are into these days.", "newpara": true, "start": 2168.506, "speaker": "Cory Minton"}, {"confidence": 0.89, "end": 2183.149, "track": 3, "text": "Well it's it's been awhile but I've watched like it's going to be a crime show that was quite interesting I can't remember the name of those.", "newpara": true, "start": 2172.682, "speaker": "Fabian Hueske"}, {"confidence": 0.94, "end": 2197.384, "track": 0, "text": "All right we'll look it up what guys thanks again for being on we are so appreciative of your time here we hope your session goes well we wish you the best of luck will say break a leg and I certainly look forward to reading the book and I want to hear some updates out of 44 conference thanks again for being on John.", "newpara": true, "start": 2183.041, "speaker": "Cory Minton"}, {"confidence": 0.92, "end": 2198.58, "track": 2, "text": "Thank you for hosting us.", "newpara": true, "start": 2197.445, "speaker": "Flavio Junqueira"}, {"confidence": 0.86, "end": 2200.744, "track": 3, "text": "Thanks for asking us.", "newpara": true, "start": 2198.407, "speaker": "Fabian Hueske"}]